TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/common/stm32wl55x_radio/Sidewalk/sid_radio.c
/**
  ******************************************************************************
  * @file    sid_radio.c
  * @brief   SubGHz peripheral handling: app commands and IRQ processing
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023-2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/

/* App-specific headers */
#include "host_comm.h"
#include "serial_bus_spi_pal.h"
#include "sid_pal_log_like.h"
#include "sid_radio.h"
#include "sys_conf.h"
#include "utilities_def.h"
#include SID_APP_VERSION_HEADER
#include <FreeRTOS.h>

/* SPI protocol definitions */
#include <comm_opcodes.h>

/* STM32 Utilities */
#include "sid_pal_log_like.h"
#include <sid_stm32_common_utils.h>
#if defined (LOW_POWER_DISABLE) && (LOW_POWER_DISABLE == 0)
#  include <stm32_lpm.h>
#endif /* LOW_POWER_DISABLE */
#include <stm32_timer.h>
#include <stm32_timer_us.h>

/* Platform definitions */
#include "radio_driver.h"

/* Private typedef -----------------------------------------------------------*/

/**
 * @brief Stores Rx Buffer Status as reported by SubGHz
 * @note This struct uses uint32 values for storage to speed up further processing
 */
typedef struct {
    uint32_t pld_len_in_bytes;      /*!< Number of bytes available in the buffer */
    uint32_t buffer_start_pointer;  /*!< Position of the first byte in the buffer */
} stm32wlxx_rx_buffer_status_t;

/**
 * @brief SubGHz LoRa packet status structure definition
 */
typedef __PACKED_STRUCT {
    int8_t rssi_pkt_in_dbm;         /*!< RSSI of the last packet */
    int8_t snr_pkt_in_db;           /*!< SNR of the last packet */
    int8_t signal_rssi_pkt_in_dbm;  /*!< Estimation of RSSI (after despreading) */
} stm32wlxx_subghz_pkt_status_lora_t;

/**
 * @brief RADIO FSK status enumeration definition
 */
typedef enum {
    STM32WLxx_RADIO_FSK_RX_DONE_STATUS_OK                  = 0,
    STM32WLxx_RADIO_FSK_RX_DONE_STATUS_INVALID_PARAMETER   = 1,
    STM32WLxx_RADIO_FSK_RX_DONE_STATUS_INVALID_LENGTH      = 2,
    STM32WLxx_RADIO_FSK_RX_DONE_STATUS_BAD_CRC             = 3,
    STM32WLxx_RADIO_FSK_RX_DONE_STATUS_TIMEOUT             = 4,
    STM32WLxx_RADIO_FSK_RX_DONE_STATUS_UNKNOWN_ERROR       = 5,
    STM32WLxx_RADIO_FSK_RX_DONE_STATUS_SW_MARK_NOT_PRESENT = 6,
    STM32WLxx_RADIO_FSK_RX_DONE_STATUS_UNDETERMINED        = 7,
} stm32wlxx_radio_fsk_rx_done_status_t;

/**
 * @brief SubGHz fallback modes enumeration definition
 */
typedef enum {
    STM32WLxx_RADIO_FALLBACK_STDBY_RC   = 0x20,
    STM32WLxx_RADIO_FALLBACK_STDBY_XOSC = 0x30,
    STM32WLxx_RADIO_FALLBACK_FS         = 0x40,
} stm32wlxx_subghz_fallback_modes_t;

typedef enum {
    STM32WLxx_RADIO_FRONTEND_MODE_OFF = 0,
    STM32WLxx_RADIO_FRONTEND_MODE_TX  = 1,
    STM32WLxx_RADIO_FRONTEND_MODE_RX  = 2,
} stm32wlxx_subghz_fe_mode_t;

typedef enum {
    STM32WLxx_RADIO_SLEEP_COLD_START = 0, /*!< No register retention in Sleep state */
    STM32WLxx_RADIO_SLEEP_WARM_START = 1, /*!< Start with registers values retained from last sleep */
} stm32wlxx_subghz_sleep_type_t;

/**
 * @brief SubGHz SetSleep command parameters
 *
 * @note This definition is valid for Little Endian architecture only
 */
typedef __PACKED_UNION {
    __PACKED_STRUCT {
        uint8_t                       rtc_wakeup_en: 1; /*!< 1: Get out of sleep mode if wakeup signal received from RTC; 0: RTC won't wake up the radio */
        uint8_t                                    : 1; /*!< Reserved */
        stm32wlxx_subghz_sleep_type_t sleep_type   : 1;
        uint8_t                                    : 5; /*!< Reserved */
    };
    uint8_t raw;
} stm32wlxx_subghz_sleep_params_t;

#if STM32WLXX_EXT_IFC_ENABLE_USER_DATA_TRANSFER
typedef struct {
    osThreadId_t                        task;
    osMessageQueueId_t                  outbound_msg_queue;
    volatile uint32_t                   udt_enabled;
    sid_host_comm_on_incoming_user_data on_user_data_rx;
    void *                              on_user_data_rx_user_arg;
    UTIL_TIMER_Object_t                 suspend_timer;
} sid_radio_udt_ctx_t;
#endif /* STM32WLXX_EXT_IFC_ENABLE_USER_DATA_TRANSFER */

/* Private defines -----------------------------------------------------------*/

/* Timeouts and retry limits */
#define SID_RADIO_SUBGHZ_RESET_ATTEMPTS                   (5u)
#define SID_RADIO_SUBGHZ_RESET_COOLDOWN_MS                (10u)

#define SID_RADIO_SUBGHZ_RESET_TOGGLE_DELAY_US            (100u)  /*!< Defines the delay time in microseconds for toggling the radio reset signal */
#define SID_RADIO_SUBGHZ_WAIT_FOR_RESET_TIMEOUT_MS        (5u)    /*!< Defines timeout in milliseconds for radio reset to finish */
#define SID_RADIO_SUBGHZ_WAIT_FOR_STARTUP_TIMEOUT_MS      (10u)   /*!< Defines timeout in milliseconds for radio busy signal to release */
#define SID_RADIO_SUBGHZ_WAIT_FOR_WAKEUP_TIMEOUT_MS       (5u)    /*!< Timeout in milliseconds for radio busy signal to be released when leaving Sleep mode */
#define SID_RADIO_HANDSHAKE_LPM_SUSPEND_TIME_MS           (1000u) /*!< LPM entry will be prohibited for this period of time after receiving a handshake request (either internal or external) */
#define SID_RADIO_LPM_RESUME_RETRY_PERIOD_MS              (25u)   /*!< If LPM resume fails for any reason the driver will retry to resume LPM with this period */

#define SID_RADIO_IRQ_PROCESSING_DELAY_STATIC_ERROR_NS    (3120u) /*!< Compensatory time for SubGHz IRQ reaction time */

#ifndef STM32WLxx_SUBGHZ_TXPWR_WORKAROUND
#  define STM32WLxx_SUBGHZ_TXPWR_WORKAROUND 1
#endif

#if STM32WLxx_SUBGHZ_TXPWR_WORKAROUND
#  define STM32WLxx_SUBGHZ_REG_LR_CFG_FREQ                (0x745u)
#  define STM32WLxx_SUBGHZ_BAND_EDGE_LIMIT_FREQ           (903000000u)
#  define STM32WLxx_SUBGHZ_REG_VAL_FREQ_LOW               (0x1Fu)
#  define STM32WLxx_SUBGHZ_REG_VAL_FREQ_HIGH              (0x18u)

#  define STM32WLxx_SUBGHZ_REG_OVP                        (0x08E6u)
#endif /* STM32WLxx_SUBGHZ_TXPWR_WORKAROUND */

#define STM32WLxx_SUBGHZ_REG_OCP_HPA_VAL                  (0x38u) /*!< Current max 160mA for the whole device when using HPA */
#define STM32WLxx_SUBGHZ_REG_OCP_LPA_VAL                  (0x18u) /*!< Current max 80mA for the whole device when using LPA */

/* SMPS clock detection defines */
#define STM32WLxx_SUBGHZ_REG_VAL_SMPSC0R_CLKDE            (0x40u) /*!< SMPS control 0 register, bit SMPS clock detection enable */

/**
 * @brief The address of the register holding the CRC configuration extracted from a received LoRa header
 */
#define STM32WL55xx_SUBGHZ_REG_LR_HEADER_CRC              (0x76Bu)
#define STM32WL55xx_SUBGHZ_REG_LR_HEADER_CRC_POS          (4u)
#define STM32WL55xx_SUBGHZ_REG_LR_HEADER_CRC_MASK         (1u << STM32WL55xx_SUBGHZ_REG_LR_HEADER_CRC_POS)

#define SID_RADIO_POLYNOMIAL_CRC16                        (0x1021u)
#define SID_RADIO_POLYNOMIAL_CRC32                        (0x04C11DB7u)

/** Sidewalk Phy Radio State - copy from sid_pal_radio_ifc.h */
#define SID_PAL_RADIO_UNKNOWN                             (0)
#define SID_PAL_RADIO_STANDBY                             (1)
#define SID_PAL_RADIO_SLEEP                               (2)
#define SID_PAL_RADIO_RX                                  (3)
#define SID_PAL_RADIO_TX                                  (4)
#define SID_PAL_RADIO_CAD                                 (5)
#define SID_PAL_RADIO_STANDBY_XOSC                        (6)
#define SID_PAL_RADIO_RX_DC                               (7)
#define SID_PAL_RADIO_BUSY                                (8)

