TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/common/stm32wl55x_radio/Sidewalk/sid_radio.c
#define STM32WLxx_SUBGHZ_STDBY_STATE_DELAY_US             (10u) /*!< Delay time to allow for any external PA/FEM turn ON/OFF */

#define SID_RADIO_FSK_WHITENING_SEED                      (0x01FFu)

#define SID_RADIO_RXTX_NO_TIMEOUT_VAL                     (0x000000u)
#define SID_RADIO_RX_CONTINUOUS_VAL                       (0xFFFFFFu)
#define SID_RADIO_INFINITE_TIME                           (0xFFFFFFFFu)

#define SID_RADIO_FSK_SYNC_WORD_VALID_MARKER              ((uint32_t)(0xABBACAFEu))
#define SID_RADIO_FSK_PACKET_TYPE_OFFSET                  (0u)
#define SID_RADIO_FSK_PACKET_LENGTH_OFFSET                (1u)
#define SID_RADIO_FSK_SYNC_WORD_VALID_MARKER_OFFSET       (2u)

#define SID_RADIO_SUBGHZ_XTAL_FREQ                        (HSE_VALUE)
#define SID_RADIO_SUBGHZ_PLL_STEP_POW2_MULT               (14u)         /*!< Used as a multiplier to calculate fractional parts in integer domain: (x << SID_RADIO_SUBGHZ_PLL_STEP_POW2_MULT) = x * 2^SID_RADIO_SUBGHZ_PLL_STEP_POW2_MULT */
#define SID_RADIO_SUBGHZ_PLL_STEP_MULTIPLIED              ((uint32_t)(SID_RADIO_SUBGHZ_XTAL_FREQ) >> (25u - SID_RADIO_SUBGHZ_PLL_STEP_POW2_MULT)) /*!< Single PLL step is (XTAL_FREQ / 2^25), this value is a single step multiplied by 2^SID_RADIO_SUBGHZ_PLL_STEP_POW2_MULT */

#define SID_RADIO_SUBGHZ_PA_SEL_HPA                       (0u) /*!< PaSel register value when High Power PA option is targeted */
#define SID_RADIO_SUBGHZ_PA_SEL_LPA                       (1u) /*!< PaSel register value when Low Power PA option is targeted */

#define SID_RADIO_SUBGHZ_HPA_TX_PWR_UPPER_LIMIT           (22)  /*!< Maximum achievable Tx power when High Power Amplifier (HPA) is used */
#define SID_RADIO_SUBGHZ_HPA_TX_PWR_LOWER_LIMIT           (-9)  /*!< Minimum achievable Tx power when High Power Amplifier (HPA) is used */
#define SID_RADIO_SUBGHZ_LPA_TX_PWR_UPPER_LIMIT           (14)  /*!< Maximum achievable Tx power when Low Power Amplifier (LPA) is used */
#define SID_RADIO_SUBGHZ_LPA_TX_PWR_LOWER_LIMIT           (-17) /*!< Minimum achievable Tx power when Low Power Amplifier (LPA) is used */

#define SID_RADIO_SUBGHZ_DEEP_SLEEP_DISABLE               (0u)  /*!< Radio not in Sleep. Mimics SUBGHZ_DEEP_SLEEP_DISABLE definition from HAL driver */

#define SID_RADIO_LORA_NUM_USED_BW                        (3u)  /* BW125, BW250, BW500 */
#define SID_RADIO_LORA_NUM_USED_SF                        (8u)  /* SF12~SF5 */

#define SID_RADIO_TX_BUFFER_BASE_OFFSET                   (0u)  /* The Tx buffer start offset is fixed to 0x00 to simplify Tx buffer uploading */
#define SID_RADIO_RX_BUFFER_BASE_OFFSET                   (0u)  /* The Rx buffer start offset is fixed to 0x00 to simplify readout */

#define SID_RADIO_FSK_GET_RX_BUFFER_STATUS_RETRIES        (2u)  /*!< Maximum number of retries for GetRxBufferStatus() command whenever workaround is applied */
#define SID_RADIO_LORA_GET_RX_BUFFER_STATUS_RETRIES       (2u)  /*!< Maximum number of retries for GetRxBufferStatus() command whenever workaround is applied */

#if STM32WLXX_EXT_IFC_ENABLE_USER_DATA_TRANSFER
#  define SID_RADIO_UDT_DRIVER_READY_FLAG                 (1u << 0)
#  define SID_RADIO_UDT_TRANSFER_ENABLED_FLAG             (1u << 1)

#  define SID_RADIO_UDT_TASK_STACK_SIZE                   (768u)
#  define SID_RADIO_UDT_TASK_PRIO                         ((osPriority_t) osPriorityRealtime7)
#  define SID_RADIO_UDT_OUT_MSG_QUEUE_LEN                 (10u)
#  define SID_RADIO_UDT_SUSPEND_RESERVED_TIME_US          (7500u) /*!< Amount of time (in us) reserved before the planned radio wakeup event - this safety gap is used to suspend UDT before waking up the radio */
#endif /* STM32WLXX_EXT_IFC_ENABLE_USER_DATA_TRANSFER */

#if HALO_ENABLE_DIAGNOSTICS
#  define STM32WLxx_SUBGHZ_MIN_CHANNEL_FREE_DELAY_US      (1u)
#  define STM32WLxx_SUBGHZ_MIN_CHANNEL_NOISE_DELAY_US     (30u)
#  define STM32WLxx_SUBGHZ_NOISE_SAMPLE_SIZE              (32u)
#endif /* HALO_ENABLE_DIAGNOSTICS */

/* Private macro -------------------------------------------------------------*/

#ifndef SID_RADIO_EXTRA_LOGGING
/* Set SID_RADIO_RADIO_EXTRA_LOGGING to 1 to enable extended logs */
#  define SID_RADIO_EXTRA_LOGGING                (0)
#endif /* SID_RADIO_EXTRA_LOGGING */

#if SID_RADIO_EXTRA_LOGGING
#  define SID_RADIO_LOG_ERROR(...)               SID_PAL_LOG_ERROR(__VA_ARGS__)
#  define SID_RADIO_LOG_WARNING(...)             SID_PAL_LOG_WARNING(__VA_ARGS__)
#  define SID_RADIO_LOG_INFO(...)                SID_PAL_LOG_INFO(__VA_ARGS__)
#  define SID_RADIO_LOG_DEBUG(...)               SID_PAL_LOG_DEBUG(__VA_ARGS__)
#  define SID_RADIO_LOG_TRACE(...)               SID_PAL_LOG_TRACE(__VA_ARGS__)
#else
#  define SID_RADIO_LOG_ERROR(...)               ((void)0u)
#  define SID_RADIO_LOG_WARNING(...)             ((void)0u)
#  define SID_RADIO_LOG_INFO(...)                ((void)0u)
#  define SID_RADIO_LOG_DEBUG(...)               ((void)0u)
#  define SID_RADIO_LOG_TRACE(...)               ((void)0u)
#endif

/**
 * @brief Convert frequency in Hz into the number of PLL steps
 */
#define SID_RADIO_FREQ_HZ_TO_PLL_STEP(hz, steps) do\
                                                 {\
                                                     register uint32_t steps_int;\
                                                     register uint32_t steps_frac;\
                                                     steps_int  = (hz) / SID_RADIO_SUBGHZ_PLL_STEP_MULTIPLIED;\
                                                     steps_frac = (hz) - (steps_int * SID_RADIO_SUBGHZ_PLL_STEP_MULTIPLIED);\
                                                     (steps) = (steps_int << SID_RADIO_SUBGHZ_PLL_STEP_POW2_MULT) +\
                                                     ( ( ( steps_frac << SID_RADIO_SUBGHZ_PLL_STEP_POW2_MULT ) + ( SID_RADIO_SUBGHZ_PLL_STEP_MULTIPLIED >> 2 ) ) / SID_RADIO_SUBGHZ_PLL_STEP_MULTIPLIED );\
                                                 } while(0)

/**
 * @brief Macro to reset the radio.
 *
 * This macro enables and disables the RF reset signal with a specified delay time.
 */
#define SID_RADIO_SUBGHZ_RESET_RADIO()           do\
                                                 {\
                                                     LL_RCC_RF_EnableReset();\
                                                     sid_pal_delay_us(SID_RADIO_SUBGHZ_RESET_TOGGLE_DELAY_US);\
                                                     LL_RCC_RF_DisableReset();\
                                                 } while(0)

/*!
 * @brief return the calibration band of the given frequency
 * @param [in] freq_hz Targeted frequency in Hz
 * @return calibration band for the frequency
 */
#define SID_RADIO_GET_FREQ_BAND(freq_hz)         ((freq_hz >= 900000000u) ? STM32WLxx_SUBGHZ_BAND_900M :\
                                                  (freq_hz >= 850000000u) ? STM32WLxx_SUBGHZ_BAND_850M :\
                                                  (freq_hz >= 770000000u) ? STM32WLxx_SUBGHZ_BAND_770M :\
                                                  (freq_hz >= 460000000u) ? STM32WLxx_SUBGHZ_BAND_460M :\
                                                  (freq_hz >= 430000000u) ? STM32WLxx_SUBGHZ_BAND_430M :\
                                                  STM32WLxx_SUBGHZ_BAND_INVALID)

#define SID_RADIO_GET_FREQ_BAND_STR(_band_)      (STM32WLxx_SUBGHZ_BAND_900M == (_band_) ? "902-928 MHz" : \
                                                  STM32WLxx_SUBGHZ_BAND_850M == (_band_) ? "863-870 MHz" :\
                                                  STM32WLxx_SUBGHZ_BAND_770M == (_band_) ? "779-787 MHz" :\
                                                  STM32WLxx_SUBGHZ_BAND_460M == (_band_) ? "470-510 MHz" :\
                                                  STM32WLxx_SUBGHZ_BAND_430M == (_band_) ? "430-440 MHz" :\
                                                  "<invalid>")

