TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/common/stm32wl55x_radio/Sidewalk/sid_radio.c
/* External variables --------------------------------------------------------*/

extern SUBGHZ_HandleTypeDef hsubghz;

/* Private variables ---------------------------------------------------------*/

/** Global WL55 radio setup used to minimize data for other commands */
static stm32wlxx_radio_phy_cfg_t         WL55_cfg = {0};
static volatile uint32_t                 valid_subghz_cfg_received = FALSE;

static uint32_t                          subghz_cold_start = TRUE;

/** current standby/sleeping/tx/rx mode */
static uint32_t                          current_radio_state = SID_PAL_RADIO_UNKNOWN;

/** current modem mode */
static stm32wlxx_pal_radio_modem_mode_t  current_modem_mode = STM32WLxx_SUBGHZ_RADIO_MODEM_MODE_UNDEFINED;

/** last frequency set in the radio phy */
static uint32_t                          current_radio_freq_hz = 0u;

/** Storage for IRQ reply follow-up data */
static stm32wlxx_rcp_set_subghz_rx_buf_t radio_irq_followup_frame;

static uint32_t                          radio_tx_buf_upload_offset = 0u;

static stm32wlxx_pal_radio_events_t      last_indicated_radio_event = STM32WLxx_PAL_RADIO_EVENT_UNKNOWN;
static uint32_t                          last_indicated_radio_event_data_len = 0u;
static uint32_t                          mod_params_upd_indication_pending = FALSE;

UTIL_TIMER_Object_t                      radio_timeout_mon;

#if defined (LOW_POWER_DISABLE) && (LOW_POWER_DISABLE == 0)
static UTIL_TIMER_Object_t               lpm_suspend_timer;
#endif /* LOW_POWER_DISABLE */

/* User data transfer handling */
#if STM32WLXX_EXT_IFC_ENABLE_USER_DATA_TRANSFER
static sid_radio_udt_ctx_t udt_ctx = {0u};

static const osThreadAttr_t wlxx_user_data_transfer_thread_attributes = {
    .name       = "WLxx_UDT",
    .priority   = SID_RADIO_UDT_TASK_PRIO,
    .stack_size = SID_RADIO_UDT_TASK_STACK_SIZE,
};

/** Storage for User Data IRQ follow-up data */
static stm32wlxx_rcp_user_data_irq_followup_t udt_irq_followup_frame;
#endif /* STM32WLXX_EXT_IFC_ENABLE_USER_DATA_TRANSFER */

/* Private constants ---------------------------------------------------------*/

/* LUT for LoRa symbol duration for various bandwidth and spreading factor combinations */
static const uint32_t radio_lora_symb_time[SID_RADIO_LORA_NUM_USED_BW][SID_RADIO_LORA_NUM_USED_SF] = {
                                                        { 32768u, 16384u, 8192u, 4096u, 2048u, 1024u, 512u, 256u }, /* 125 KHz, SF12~SF5 */
                                                        { 16384u,  8192u, 4096u, 2048u, 1024u,  512u, 256u, 128u }, /* 250 KHz, SF12~SF5 */
                                                        {  8192u,  4096u, 2048u, 1024u,  512u,  256u, 128u,  64u }, /* 500 KHz, SF12~SF5 */
                                                    };

/* Private function prototypes -----------------------------------------------*/

static inline sid_radio_error_t  _wait_for_subghz_reset_finish(const uint32_t timeout_ms);
static inline sid_radio_error_t  _wait_for_subghz_ready(const uint32_t timeout_ms);
static inline sid_radio_error_t  _subghz_reset(void);
static inline sid_radio_error_t  _sid_radio_indicate_request_processed(const uint16_t request_id, const uint16_t request_status, const stm32wlxx_req_completed_compact_data_t * const compact_data, const uint8_t * const extended_data, const uint32_t extended_data_len);
static inline sid_radio_error_t  _sid_radio_subghz_smps_clk_detect_en(void);
static inline sid_radio_error_t  _sid_radio_subghz_get_gfsk_pkt_status(stm32wlxx_pkt_status_gfsk_t * const pkt_status);
static inline sid_radio_error_t  _sid_radio_subghz_get_lora_pkt_status(stm32wlxx_rcp_lora_rx_packet_info_t * const lora_rx_packet_status);
static inline sid_radio_error_t  _sid_radio_subghz_get_rx_buffer_status(stm32wlxx_rx_buffer_status_t * const rx_buffer_status);
static inline sid_radio_error_t  _sid_radio_subghz_set_rx(const uint32_t timeout_tus);
static inline sid_radio_error_t  _sid_radio_subghz_set_rx_duty_cycle(const uint32_t rx_time_in_ms, const uint32_t sleep_time_in_ms);
static inline sid_radio_error_t  _sid_radio_subghz_stop_tmr_on_pbl(const uint32_t enable);
static inline sid_radio_error_t  _sid_radio_subghz_set_tx(const uint32_t timeout);
static inline sid_radio_error_t  _sid_radio_subghz_set_lora_symb_nb_timeout(const uint8_t nb_of_symbs);
static inline sid_radio_error_t  _sid_radio_subghz_set_gfsk_sync_word(const uint8_t * const sync_word, const uint8_t sync_word_len);
static inline sid_radio_error_t  _sid_radio_subghz_set_lora_sync_word(const uint16_t sync_word);
static inline sid_radio_error_t  _sid_radio_subghz_clear_irq_status(const uint16_t irq_mask);
static inline sid_radio_error_t  _sid_radio_subghz_clear_irq_status_all(void);
static inline sid_radio_error_t  _sid_radio_subghz_set_sleep(const stm32wlxx_subghz_sleep_params_t cfg);
static inline sid_radio_error_t  _sid_radio_subghz_wakeup(const uint32_t timeout_ms);
static inline sid_radio_error_t  _sid_radio_subghz_set_standby(const uint8_t cfg);
static inline sid_radio_error_t  _sid_radio_smps_set(const uint8_t level);
static inline sid_radio_error_t  _sid_radio_set_reg_mode(const uint8_t mode);
static inline sid_radio_error_t  _sid_radio_set_buffer_base_addr(const uint8_t tx_base_addr, const uint8_t rx_base_addr);
static inline sid_radio_error_t  _sid_radio_cfg_rx_boosted(const uint32_t enabled);
static inline sid_radio_error_t  _sid_radio_set_tcxo_mode(const RadioTcxoCtrlVoltage_t tcxo_voltage, const uint32_t timeout);
static inline sid_radio_error_t  _sid_radio_clear_subghz_errors(void);
static inline sid_radio_error_t  _sid_radio_get_subghz_errors(uint16_t * const errors);
static inline sid_radio_error_t  _sid_radio_calibrate(const uint8_t param);
static inline sid_radio_error_t  _sid_radio_set_pa_cfg(const stm32wlxx_radio_pa_setup_t * const pa_cfg);
static inline sid_radio_error_t  _sid_radio_set_tx_params(const stm32wlxx_radio_pa_setup_t * const pa_cfg);
static inline sid_radio_error_t  _sid_radio_set_dio_irq_params(const uint16_t irq_mask, const uint16_t dio1_mask, const uint16_t dio2_mask, const uint16_t dio3_mask);
static inline sid_radio_error_t  _sid_radio_set_pkt_type(const uint8_t pkt_type);
static inline sid_radio_error_t  _sid_radio_subghz_set_gfsk_pkt_params(const stm32wlxx_pal_radio_fsk_pkt_params_t * const params);
static inline sid_radio_error_t  _sid_radio_cal_img(const stm32wlxx_freq_cal_band_t freq_band);
static inline sid_radio_error_t  _sid_radio_set_rf_freq(const uint32_t freq_hz);
static inline sid_radio_error_t  _sid_radio_tx_modulation_workaround(const stm32wlxx_pkt_type_t pkt_type, const stm32wlxx_lora_bw_t bw);
static inline sid_radio_error_t  _sid_radio_subghz_set_lora_mod_params(const stm32wlxx_radio_lora_phy_mod_params_t * const params);
static inline sid_radio_error_t  _sid_radio_subghz_set_lora_pkt_params(const stm32wlxx_radio_lora_phy_pkt_params_t * const params);
static inline sid_radio_error_t  _sid_radio_subghz_set_cad_params(const stm32wlxx_lora_cad_params_t * const params);
static inline sid_radio_error_t  _sid_radio_subghz_set_xtal_trim(const uint8_t xta, const uint8_t xtb);
static inline sid_radio_error_t  _sid_radio_subghz_set_gfsk_mod_params(const stm32wlxx_radio_fsk_phy_mod_params_t * const params);
static inline sid_radio_error_t  _sid_radio_set_irq_mask(uint16_t irq_mask);
static inline uint32_t           _sid_radio_get_fsk_crc_len_in_bytes(const stm32wlxx_gfsk_crc_types_t crc_type);
static inline uint32_t           _sid_radio_get_fsk_time_on_air_ms(const stm32wlxx_radio_fsk_phy_mod_params_t * const mod_params, const stm32wlxx_pal_radio_fsk_pkt_params_t * const  packet_params, uint32_t packet_len);
static inline sid_radio_error_t  _sid_radio_fsk_process_sync_word_detected(uint8_t * const rx_storage, const uint32_t rx_completed);
static inline sid_radio_error_t  _sid_radio_enable_default_irqs(void);
static inline sid_radio_error_t  _sid_radio_set_modem_to_fsk(void);
static inline sid_radio_error_t  _sid_radio_set_modem_to_lora(void);
static inline uint8_t            _sid_radio_lora_low_data_rate_optimize(const stm32wlxx_lora_sf_t sf, const stm32wlxx_lora_bw_t bw);
static inline void               _sid_radio_convert_to_phy_lora_mod_params(stm32wlxx_mod_params_lora_t * const sx_m, const stm32wlxx_radio_lora_phy_mod_params_t * const in_mod_params);
static inline RBI_Switch_TypeDef _sid_radio_rbi_get_pa_selector(const uint32_t request_hpa);
static inline sid_radio_error_t  _sid_radio_subghz_set_radio_mode(const stm32wlxx_subghz_fe_mode_t frontend_mode);
static inline sid_radio_error_t  _sid_radio_subghz_sleep(const uint32_t sleep_duration_us);
static inline sid_radio_error_t  _sid_radio_subghz_standby(void);
static        sid_radio_error_t  _sid_radio_set_tx_power(const stm32wlxx_radio_pa_setup_t * const new_pa_cfg);
static inline sid_radio_error_t  _sid_radio_set_modem_mode(const stm32wlxx_rcp_set_modem_mode_req_t * const request);
static inline sid_radio_error_t  _sid_radio_subghz_get_payload(uint8_t * const buffer, const uint32_t buf_size, uint32_t * const actual_size);
static inline sid_radio_error_t  _sid_radio_lora_process_rx_done(stm32wlxx_rcp_lora_rx_packet_info_t * const lora_rx_packet_status, uint8_t * const rx_storage,
                                                                 const uint32_t rx_storage_size, uint32_t * const out_received_len);
static inline void               _sid_radio_fsk_perform_data_whitening(const uint16_t seed, const uint8_t * const buffer_in, uint8_t * const buffer_out, const uint32_t length);
static inline uint16_t           _sid_radio_compute_crc16(const uint8_t * const buffer, const uint32_t length);
static inline uint32_t           _sid_radio_compute_crc32(const uint8_t * const buffer, const uint32_t length);
static inline sid_radio_error_t  _sid_radio_fsk_process_rx_done(stm32wlxx_rcp_fsk_rx_packet_info_t * const fsk_rx_packet_status, uint8_t * const rx_storage,
                                                                const uint32_t rx_storage_size, uint32_t * const out_received_len,
                                                                stm32wlxx_radio_fsk_rx_done_status_t * const out_fsk_rx_done_status);
static inline void               _sid_radio_convert_fsk_packet_params(stm32wlxx_pkt_params_gfsk_t * const fsk_pp, const stm32wlxx_pal_radio_fsk_pkt_params_t * const pkt_params);
static inline sid_radio_error_t  _sid_radio_set_frequency(const stm32wlxx_rcp_set_frequency_req_t * const request);
static inline sid_radio_error_t  _sid_radio_set_sync_word(const stm32wlxx_rcp_set_sync_word_req_t * const request);
static inline sid_radio_error_t  _sid_radio_set_lora_symbol_timeout(const stm32wlxx_rcp_set_lora_symb_timeout_req_t * const request);
static inline uint32_t           _sid_radio_get_lora_symbol_timeout_us(const uint32_t number_of_symbol);
static inline sid_radio_error_t  _sid_radio_process_set_lora_mod_params_req(const stm32wlxx_rcp_set_lora_mod_params_req_t * const request);
static inline sid_radio_error_t  _sid_radio_set_lora_packet_params(const stm32wlxx_rcp_set_lora_pkt_params_req_t * const request);
static inline sid_radio_error_t  _sid_radio_set_lora_cad_params(const stm32wlxx_rcp_set_lora_cad_params_req_t * const request);
static inline sid_radio_error_t  _sid_radio_start_tx(const uint32_t timeout);
static inline sid_radio_error_t  _sid_radio_start_rx(const stm32wlxx_rcp_start_rx_req_t * const params);
static inline int32_t            _sid_radio_get_adjusted_rssi(const int32_t raw_rrsi);
static inline sid_radio_error_t  _sid_radio_subghz_get_rssi(int8_t * const out_rssi);
static        sid_radio_error_t  _sid_radio_irq_process(const uint32_t reported_irqs, const uint32_t irq_timestamp_s, const uint32_t irq_timestamp_us);
static        sid_radio_error_t  _sid_radio_report_event(const stm32wlxx_pal_radio_events_t radio_event, stm32wlxx_radio_comm_spi_frame_t * const spi_reply_frame, const uint32_t irq_timestamp_s, const uint32_t irq_timestamp_us);
static inline sid_radio_error_t  _sid_radio_process_set_fsk_mod_params_req(const stm32wlxx_rcp_set_fsk_mod_params_req_t * const request);
static inline sid_radio_error_t  _sid_radio_process_set_fsk_packet_params_req(const stm32wlxx_rcp_set_fsk_pkt_params_req_t * const request);
static inline sid_radio_error_t  _sid_radio_start_fsk_carrier_sense(const stm32wlxx_rcp_start_fsk_cs_req_t * const request);

