TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/common/stm32wl55x_radio/Sidewalk/sid_radio.c
#if STM32WLXX_EXT_IFC_ENABLE_USER_DATA_TRANSFER
static inline sid_radio_error_t  _sid_radio_process_user_data_upload(const uint8_t * const frame_data, const uint32_t available_frame_length, const uint32_t full_frame_length);
static        void               _user_data_transfer_thread(void * context);
static        void               _sid_radio_udt_suspend_timer_cb(void * context);
#endif /* STM32WLXX_EXT_IFC_ENABLE_USER_DATA_TRANSFER */

#if HALO_ENABLE_DIAGNOSTICS
static inline sid_radio_error_t  _sid_radio_subghz_set_cw_tx(void);
static inline sid_radio_error_t  _sid_radio_start_cw_tx(const stm32wlxx_rcp_start_cw_tx_req_t * const request);
static inline sid_radio_error_t  _sid_radio_start_infinite_preamble_tx(const stm32wlxx_rcp_start_inf_pbl_tx_req_t * const request);
static inline sid_radio_error_t  _sid_radio_start_continuous_rx(void);
static inline sid_radio_error_t  _sid_radio_start_rx_duty_cycle(const stm32wlxx_rcp_start_rx_dc_req_t * const request);
static inline sid_radio_error_t  _sid_radio_start_lora_cad(void);
static inline sid_radio_error_t  _sid_radio_get_live_rssi(void);
static inline sid_radio_error_t  _sid_radio_is_channel_free(const stm32wlxx_rcp_is_channel_free_req_t * const request);
static inline sid_radio_error_t  _sid_radio_get_channel_noise(const stm32wlxx_rcp_get_channel_noise_req_t * const request);
#endif /* HALO_ENABLE_DIAGNOSTICS */

static inline sid_radio_error_t  _sid_radio_process_irq_ack(void);
static inline sid_radio_error_t  _sid_radio_process_sunghz_reset_req(const stm32wlxx_rcp_reset_subghz_req_t * const request);
static inline sid_radio_error_t  _sid_radio_process_subghz_sleep_req(const stm32wlxx_rcp_radio_sleep_req_t * const request);
static inline sid_radio_error_t  _sid_radio_process_subghz_standby_req(void);
static inline sid_radio_error_t  _sid_radio_process_apply_cfg_req(const uint8_t * const frame_data, const uint32_t frame_length);
static inline sid_radio_error_t  _sid_radio_process_sunghz_base_init_req(const stm32wlxx_rcp_apply_base_hw_cfg_req_t * const request);
static inline sid_radio_error_t  _sid_radio_process_set_tx_power(const stm32wlxx_rcp_set_tx_power_req_t * const request);
static inline sid_radio_error_t  _sid_radio_process_set_subghz_tx_buf_req(const uint8_t * const frame_data, const uint32_t available_frame_length, const uint32_t full_frame_length);
static inline sid_radio_error_t  _sid_radio_process_start_tx_req(void);
static inline void               _sid_radio_log_mod_params_change(void);
static        void               _sid_radio_on_radio_timeout_event(void * context);
static inline sid_radio_error_t  _sid_radio_start_radio_timeout_mon(const uint32_t timeout_us);
#if defined (LOW_POWER_DISABLE) && (LOW_POWER_DISABLE == 0)
static        void               _sid_radio_lpm_suspend_timer_cb(void * context);
#endif /* LOW_POWER_DISABLE */
#if STM32WLXX_EXT_IFC_ENABLE_USER_DATA_TRANSFER
static inline sid_radio_error_t  _sid_radio_udt_init(void);
static inline sid_radio_error_t  _sid_radio_udt_setup_session(const uint32_t sleep_duration_us);
#endif /* STM32WLXX_EXT_IFC_ENABLE_USER_DATA_TRANSFER */

/* Private function definitions ----------------------------------------------*/

/**
 * @brief Waits for the RF module to finish the reset process.
 *
 * This function waits for the RF module to finish the reset process by checking
 * the status of the RF under reset flag. It returns a status code indicating the
 * success or failure of the operation within a specified timeout.
 *
 * @param [in] timeout_ms The timeout value in milliseconds for waiting.
 * @return     Status code indicating success or an error condition.
 */
SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _wait_for_subghz_reset_finish(const uint32_t timeout_ms)
{
    register const uint32_t tick_start = HAL_GetTick();
    __COMPILER_BARRIER();

    register const uint32_t timeout_ticks = timeout_ms != osWaitForever ? (timeout_ms / (uint32_t)HAL_GetTickFreq()) : HAL_MAX_DELAY;
    register uint32_t count = timeout_ticks * ((SystemCoreClock * 26U) >> 20U); /* Calculate timeout based on a software loop to avoid blocking issue if SysTick is disabled */
    sid_radio_error_t err = SID_RADIO_ERROR_NONE;

    /* Wait for any ongoing transactions to complete */
    while (LL_RCC_IsRFUnderReset() != 0u)
    {
        if (timeout_ticks != HAL_MAX_DELAY)
        {
            if (((HAL_GetTick() - tick_start) >= timeout_ticks) || (0u == count))
            {
                err = SID_RADIO_ERROR_TIMEOUT;
                break;
            }

            /* Count iterations to protect from the SysTick being disabled or not incremented */
            if (count != 0u)
            {
                count--;
            }
        }
    }

    return err;
}

/*----------------------------------------------------------------------------*/

/**
 * @brief Waits for the RF module's busy pin to be clear
 *
 * This function waits for the RF module's busy pin to be clear after reset by checking the
 * status of the RF busy flags. It returns a status code indicating the success
 * or failure of the operation within a specified timeout.
 *
 * @param [in] timeout_ms The timeout value in milliseconds for waiting.
 * @return     Status code indicating success or an error condition.
 */
SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _wait_for_subghz_ready(const uint32_t timeout_ms)
{
    register const uint32_t tick_start = HAL_GetTick();
    __COMPILER_BARRIER();

    register const uint32_t timeout_ticks = timeout_ms != osWaitForever ? (timeout_ms / (uint32_t)HAL_GetTickFreq()) : HAL_MAX_DELAY;
    register uint32_t count = timeout_ticks * ((SystemCoreClock * 26U) >> 20U); /* Calculate timeout based on a software loop to avoid blocking issue if SysTick is disabled */
    sid_radio_error_t err = SID_RADIO_ERROR_NONE;

    /* Wait for any ongoing transactions to complete */
    while (LL_PWR_IsActiveFlag_RFBUSYS() != 0u)
    {
        if (timeout_ticks != HAL_MAX_DELAY)
        {
            if (((HAL_GetTick() - tick_start) >= timeout_ticks) || (0u == count))
            {
                err = SID_RADIO_ERROR_TIMEOUT;
                break;
            }

            /* Count iterations to protect from the SysTick being disabled or not incremented */
            if (count != 0u)
            {
                count--;
            }
        }
    }

