TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/common/stm32wl55x_radio/Sidewalk/sid_radio.c
    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _subghz_reset(void)
{
    sid_radio_error_t err = SID_RADIO_ERROR_GENERIC;

    do
    {
        /* Toggle internal radio reset line and wait for the reset to complete */
        SID_RADIO_SUBGHZ_RESET_RADIO();
        err = _wait_for_subghz_reset_finish(SID_RADIO_SUBGHZ_WAIT_FOR_RESET_TIMEOUT_MS);
        if (err != SID_RADIO_ERROR_NONE)
        {
            break;
        }

        /* Wait for radio to leave the STARTUP state */
        err = _sid_radio_subghz_wakeup(SID_RADIO_SUBGHZ_WAIT_FOR_STARTUP_TIMEOUT_MS);
        if (err != SID_RADIO_ERROR_NONE)
        {
            break;
        }

        /* At this point the radio will enter STDBY_RC mode */

        /* Indicate to the HAL driver that the radio is not in Sleep any longer */
        hsubghz.DeepSleep = SID_RADIO_SUBGHZ_DEEP_SLEEP_DISABLE;

        /* Done */
        err = SID_RADIO_ERROR_NONE;
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_indicate_request_processed(const uint16_t request_id, const uint16_t request_status, const stm32wlxx_req_completed_compact_data_t * const compact_data, const uint8_t * const extended_data, const uint32_t extended_data_len)
{
    sid_radio_error_t err = SID_RADIO_ERROR_GENERIC;
    stm32wlxx_radio_comm_spi_frame_t indication_response = {
        .opcode = STM32WLxx_RADIO_COMM_OPCODE_IRQ_STATUS,
        .payload = {
            .irq_status = {
                .irq_flags = STM32WLxx_APP_IRQ_SPI_REQ_DONE,
                .followup_payload_len = 0u,
                .req_cmpltd_details = {
                    .request_id = request_id,
                    .status = request_status,
                },
            },
        },
    };

    UTILS_ENTER_CRITICAL_SECTION();

    if (compact_data != NULL)
    {
        SID_STM32_UTIL_fast_memcpy(&indication_response.payload.irq_status.req_cmpltd_details.additional_info, compact_data, sizeof(*compact_data));
    }

    do
    {
        if ((extended_data != NULL) && (extended_data_len > 0u))
        {
            if (extended_data_len > STM32WLxx_RADIO_COMM_MTU_SIZE)
            {
                SID_PAL_LOG_ERROR("Failed to set Request Processed payload - supplied data exceeds MTU size. Req: 0x%x, stat: %u, ext_len: %u", request_id, request_status, extended_data_len);
                err = SID_RADIO_ERROR_EXCEEDS_MTU;
                break;
            }
            else
            {
                indication_response.payload.irq_status.followup_payload_len = extended_data_len;
            }
        }

        sid_host_comm_error_t hc_err = sid_host_comm_enqueue_tx((void *)&indication_response, sizeof(indication_response));
        if (hc_err != SID_HOST_COMM_ERROR_NONE)
        {
            SID_RADIO_LOG_ERROR("Unable to enqueue Request Processed IRQ response. Host Comm error %u", (uint32_t)hc_err);
            err = SID_RADIO_ERROR_HARDWARE;
        }
        else
        {
            SID_RADIO_LOG_DEBUG("Successfully enqueued Request Processed IRQ response. Req: 0x%x, stat: %u", request_id, request_status);
            err = SID_RADIO_ERROR_NONE;
        }

        if ((extended_data != NULL) && (extended_data_len > 0u))
        {
            hc_err = sid_host_comm_enqueue_tx(extended_data, extended_data_len);
            if (hc_err != SID_HOST_COMM_ERROR_NONE)
            {
                SID_RADIO_LOG_ERROR("Unable to enqueue Request Processed IRQ follow-up data. Host Comm error %u", (uint32_t)hc_err);
                err = SID_RADIO_ERROR_HARDWARE;
            }
            else
            {
                SID_RADIO_LOG_DEBUG("Successfully enqueued Request Processed IRQ follow-up data");
                err = SID_RADIO_ERROR_NONE;
            }
        }
    } while (0);

    if (SID_RADIO_ERROR_NONE == err)
    {
        /* Set IRQ indication if everything is ok */
        SID_HOST_COMM_IRQ_DISABLE_TRIGGER(); /* Disable EXTI on IRQ falling edge since we are going to drive the line, otherwise GPIO Handshake will be triggered */
        __COMPILER_BARRIER();                /* Ensure EXTI trigger is deactivated before the next step */
        SID_HOST_COMM_IRQ_INDICATE_EVENT();  /* Drive the IRQ line to indicate pendingIRQ to the host MCU */
    }

    UTILS_EXIT_CRITICAL_SECTION();

    return err;
}

/*----------------------------------------------------------------------------*/

/**
 * @brief Enables SMPS clock detection feature to avoid electrical damages if HSE clock is frozen for any reason
 *
 * @returns Non-zero value in case of error
 */
SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_subghz_smps_clk_detect_en(void)
{
    sid_radio_error_t err;
    HAL_StatusTypeDef hal_err;
    uint8_t reg_value;
    uint8_t reg_value_readback;

    do
    {
        hal_err = HAL_SUBGHZ_ReadRegisters(&hsubghz, SUBGHZ_SMPSC0R, &reg_value, sizeof(reg_value));
        if (hal_err != HAL_OK)
        {
            SID_PAL_LOG_ERROR("Failed to read SubGHz reg. Reg: 0x%04X, HAL_SUBGHZ err: 0x%x", SUBGHZ_SMPSC0R, hal_err);
            err = SID_RADIO_ERROR_HARDWARE;
            break;
        }

        /* Enable SMPS clock detection feature in SUBGHZ peripheral */
        reg_value |= STM32WLxx_SUBGHZ_REG_VAL_SMPSC0R_CLKDE;

        hal_err = HAL_SUBGHZ_WriteRegisters(&hsubghz, SUBGHZ_SMPSC0R, &reg_value, sizeof(reg_value));
        if (hal_err != HAL_OK)
        {
            SID_PAL_LOG_ERROR("Failed to write SubGHz reg. Reg: 0x%04X, HAL_SUBGHZ err: 0x%x", SUBGHZ_SMPSC0R, hal_err);
            err = SID_RADIO_ERROR_HARDWARE;
            break;
        }

        /* Read back the register to ensure configuration is applied */
        hal_err = HAL_SUBGHZ_ReadRegisters(&hsubghz, SUBGHZ_SMPSC0R, &reg_value_readback, sizeof(reg_value_readback));
        if (hal_err != HAL_OK)
        {
            SID_PAL_LOG_ERROR("Failed to read SubGHz reg. Reg: 0x%04X, HAL_SUBGHZ err: 0x%x", SUBGHZ_SMPSC0R, hal_err);
            err = SID_RADIO_ERROR_HARDWARE;
            break;
        }

        if (reg_value != reg_value_readback)
        {
            /* This this a crticial error - improper configuration may lead to the permanent IC damage */
            SID_PAL_LOG_ERROR("Failed to enable SMPS clock detection. Applied config: 0x%02X, readback config: 0x%02X", reg_value, reg_value_readback);
            err = SID_RADIO_ERROR_INVALID_STATE;
            break;
        }

