TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/common/stm32wl55x_radio/Sidewalk/sid_radio.c
        err = SID_RADIO_ERROR_NONE;
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

/**
 * @brief Get the status of the last GFSK packet received
 *
 * @param [out] pkt_status Pointer to a structure to store the packet status
 *
 * @returns     Non-zero value in case of error
 */
SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_subghz_get_gfsk_pkt_status(stm32wlxx_pkt_status_gfsk_t * const pkt_status)
{
    sid_radio_error_t err;
    HAL_StatusTypeDef hal_err;
    uint8_t           read_buf[3];

    hal_err = HAL_SUBGHZ_ExecGetCmd(&hsubghz, RADIO_GET_PACKETSTATUS, read_buf, sizeof(read_buf));

    if (HAL_OK == hal_err)
    {
        pkt_status->rx_status = read_buf[0];
        pkt_status->rssi_sync = ( int8_t )( -read_buf[1] >> 1 );
        pkt_status->rssi_avg  = ( int8_t )( -read_buf[2] >> 1 );

        err = SID_RADIO_ERROR_NONE;
    }
    else
    {
        SID_PAL_LOG_ERROR("Failed to access SubGHz. HAL_SUBGHZ err: 0x%x", hal_err);
        err = SID_RADIO_ERROR_HARDWARE;
    }

    return err;
}

/*----------------------------------------------------------------------------*/

/**
 * @brief Get the status of the last LoRa packet received
 *
 * @param [out] pkt_status Pointer to a structure to store the packet status
 * @returns     Non-zero value in case of error
 */
SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_subghz_get_lora_pkt_status(stm32wlxx_rcp_lora_rx_packet_info_t * const lora_rx_packet_status)
{
    sid_radio_error_t                  err;
    HAL_StatusTypeDef                  hal_err;
    stm32wlxx_subghz_pkt_status_lora_t read_buf;

    /* Read raw data */
    hal_err = HAL_SUBGHZ_ExecGetCmd(&hsubghz, RADIO_GET_PACKETSTATUS, (uint8_t *)(void *)&read_buf, sizeof(read_buf));

    if (HAL_OK == hal_err)
    {
        /* Calculate actual values as per the datasheet */
        lora_rx_packet_status->rssi        = (int8_t)((-read_buf.rssi_pkt_in_dbm) >> 1);
        lora_rx_packet_status->snr         = (int8_t)((read_buf.snr_pkt_in_db + 2 ) >> 2);
        lora_rx_packet_status->signal_rssi = (int8_t)((-read_buf.signal_rssi_pkt_in_dbm) >> 1);

        /*
         * NOTE: By default STM32WLxx radio chip's rssi saturates at -106 dBm (or some cases -107 dBm)
         * After that the signal deterioration is reflected on the snr change.
         * to make the rssi carry more significance to the upper layer consumers, we need to figure out
         * a derived rssi value combining the rssi and snr in a meaningful way.
         *
         * Based on the empirical data, the formula is: <adjusted rssi = raw rssi + snr (when snr is negative)>.
         * This adjusted value is reported and used in all the ring products.
         */
        if(lora_rx_packet_status->snr < 0)
        {
            lora_rx_packet_status->rssi += lora_rx_packet_status->snr;
        }

        /* Apply adjustments */
        lora_rx_packet_status->rssi = (int8_t)_sid_radio_get_adjusted_rssi(lora_rx_packet_status->rssi);
        lora_rx_packet_status->signal_rssi  = (int8_t)_sid_radio_get_adjusted_rssi(lora_rx_packet_status->signal_rssi);

        err = SID_RADIO_ERROR_NONE;
    }
    else
    {
        SID_PAL_LOG_ERROR("Failed to access SubGHz. HAL_SUBGHZ err: 0x%x", hal_err);
        err = SID_RADIO_ERROR_HARDWARE;
    }

    return err;
}

/*----------------------------------------------------------------------------*/

/**
 * @brief Get the current Rx buffer status for both LoRa and GFSK Rx operations
 *
 * @details This function is used to get the length of the received payload and the start address to be used when
 * reading data from the Rx buffer.
 *
 * @param [out] rx_buffer_status Pointer to a structure to store the current status
 * @returns     Non-zero value in case of error
 */
SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_subghz_get_rx_buffer_status(stm32wlxx_rx_buffer_status_t * const rx_buffer_status)
{
    sid_radio_error_t err;
    HAL_StatusTypeDef hal_err;
    uint8_t           status_buf[2];

    hal_err = HAL_SUBGHZ_ExecGetCmd(&hsubghz, RADIO_GET_RXBUFFERSTATUS, status_buf, sizeof(status_buf));

    if (HAL_OK == hal_err)
    {
        rx_buffer_status->pld_len_in_bytes     = status_buf[0];
        rx_buffer_status->buffer_start_pointer = status_buf[1];

        err = SID_RADIO_ERROR_NONE;
    }
    else
    {
        SID_PAL_LOG_ERROR("Failed to access SubGHz. HAL_SUBGHZ err: 0x%x", hal_err);
        err = SID_RADIO_ERROR_HARDWARE;
    }

    return err;
}

/*----------------------------------------------------------------------------*/

/**
 * @brief Set the chip in reception mode
 *
 * @remark The packet type shall be configured with @ref _sid_radio_set_pkt_type before using this command.
 *
 * @remark By default, the chip returns automatically to standby RC mode as soon as a packet is received
 * or if no packet has been received before the timeout. This behavior can be altered by @ref
 * _sid_radio_subghz_set_rx_tx_fallback_mode.
 *
 * @remark The timeout duration is obtained by:
 * \f$ timeout\_duration\_ms = timeout \times \frac{1}{64} \f$
 *
 * @remark Maximal timeout value is 0xFFFFFF (i.e. 511 seconds).
 *
 * @remark The timeout argument can have the following special values:
 *
 * | Special values | Meaning                                                                                         |
 * | -----------    | ------------------------------------------------------------------------------------------------|
 * | 0x000000       | RX single: the chip stays in RX mode until a packet is received, then switch to standby RC mode |
 * | 0xFFFFFF       | RX continuous: the chip stays in RX mode even after reception of a packet                       |
 *
 * @param [in] timeout The timeout configuration for Rx operation
 * @returns    Non-zero value in case of error
 */
SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_subghz_set_rx(const uint32_t timeout_tus)
{
    sid_radio_error_t err;
    HAL_StatusTypeDef hal_err;
    uint8_t           buf[3];

    buf[0] = (uint8_t)(timeout_tus >> 16);
    buf[1] = (uint8_t)(timeout_tus >>  8);
    buf[2] = (uint8_t)(timeout_tus >>  0);

#if defined(DEBUG) && defined(NUCLEO_WL55_BOARD)
    /* Quick checks that antenna switch is configured properly - valid for the Nucleo board only */
    const GPIO_PinState ctrl3 = (RF_SW_CTRL3_GPIO_PORT->IDR & RF_SW_CTRL3_PIN) != 0u ? GPIO_PIN_SET : GPIO_PIN_RESET;
    const GPIO_PinState ctrl1 = (RF_SW_CTRL1_GPIO_PORT->IDR & RF_SW_CTRL1_PIN) != 0u ? GPIO_PIN_SET : GPIO_PIN_RESET;
    const GPIO_PinState ctrl2 = (RF_SW_CTRL2_GPIO_PORT->IDR & RF_SW_CTRL2_PIN) != 0u ? GPIO_PIN_SET : GPIO_PIN_RESET;

    if ((ctrl3 != GPIO_PIN_SET) || (ctrl1 != GPIO_PIN_SET) || (ctrl2 != GPIO_PIN_RESET))
    {
        SID_PAL_LOG_ERROR("Wrong antenna switch config for RX: ctrl1: %u, ctrl2: %u, ctrl3: %u", ctrl1, ctrl2, ctrl3);
    }
#endif /* DEBUG && NUCLEO_WL55_BOARD */

