TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/common/stm32wl55x_radio/Sidewalk/sid_radio.c
    hal_err = HAL_SUBGHZ_ExecSetCmd(&hsubghz, RADIO_SET_RX, buf, sizeof(buf));
    if (HAL_OK == hal_err)
    {
        err = SID_RADIO_ERROR_NONE;
    }
    else
    {
        SID_PAL_LOG_ERROR("Failed to execute SubGHz cmd. Cmd: 0x%02X, HAL_SUBGHZ err: 0x%x", RADIO_SET_RX, hal_err);
        err = SID_RADIO_ERROR_HARDWARE;
    }

    return err;
}

/*----------------------------------------------------------------------------*/

/**
 * @brief Set radio in duty cycle Rx mode
 * @param [in] rx_time_in_ms Time to spend in active Rx state
 * @param [in] sleep_time_in_ms Idle/sleep time between Rx
 * @returns    Non-zero value in case of error
 */
SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t  _sid_radio_subghz_set_rx_duty_cycle(const uint32_t rx_time_in_ms, const uint32_t sleep_time_in_ms)
{
    sid_radio_error_t err;
    HAL_StatusTypeDef hal_err;
    uint8_t           buf[6];

    const uint32_t rx_time_tus    = STM32WLxx_SUBGHZ_US_TO_SUBGHZ_TICKS(rx_time_in_ms * STM32WLxx_SUBGHZ_US_IN_MSEC);
    const uint32_t sleep_time_tus = STM32WLxx_SUBGHZ_US_TO_SUBGHZ_TICKS(sleep_time_in_ms * STM32WLxx_SUBGHZ_US_IN_MSEC);

    buf[0] = (uint8_t)(rx_time_tus >> 16);
    buf[0] = (uint8_t)(rx_time_tus >>  8);
    buf[0] = (uint8_t)(rx_time_tus >>  0);
    buf[0] = (uint8_t)(sleep_time_tus >> 16);
    buf[0] = (uint8_t)(sleep_time_tus >>  8);
    buf[0] = (uint8_t)(sleep_time_tus >>  0);

#if defined(DEBUG) && defined(NUCLEO_WL55_BOARD)
    /* Quick checks that antenna switch is configured properly - valid for the Nucleo board only */
    const GPIO_PinState ctrl3 = (RF_SW_CTRL3_GPIO_PORT->IDR & RF_SW_CTRL3_PIN) != 0u ? GPIO_PIN_SET : GPIO_PIN_RESET;
    const GPIO_PinState ctrl1 = (RF_SW_CTRL1_GPIO_PORT->IDR & RF_SW_CTRL1_PIN) != 0u ? GPIO_PIN_SET : GPIO_PIN_RESET;
    const GPIO_PinState ctrl2 = (RF_SW_CTRL2_GPIO_PORT->IDR & RF_SW_CTRL2_PIN) != 0u ? GPIO_PIN_SET : GPIO_PIN_RESET;

    if ((ctrl3 != GPIO_PIN_SET) || (ctrl1 != GPIO_PIN_SET) || (ctrl2 != GPIO_PIN_RESET))
    {
        SID_PAL_LOG_ERROR("Wrong antenna switch config for RX: ctrl1: %u, ctrl2: %u, ctrl3: %u", ctrl1, ctrl2, ctrl3);
    }
#endif /* DEBUG && NUCLEO_WL55_BOARD */

    hal_err = HAL_SUBGHZ_ExecSetCmd(&hsubghz, RADIO_SET_RXDUTYCYCLE, buf, sizeof(buf));
    if (HAL_OK == hal_err)
    {
        err = SID_RADIO_ERROR_NONE;
    }
    else
    {
        SID_PAL_LOG_ERROR("Failed to execute SubGHz cmd. Cmd: 0x%02X, HAL_SUBGHZ err: 0x%x", RADIO_SET_RX, hal_err);
        err = SID_RADIO_ERROR_HARDWARE;
    }

    return err;
}

/*----------------------------------------------------------------------------*/

/**
 * @brief Configure the event on which the Rx timeout is stopped
 *
 * @remark The two options are:
 *   - Syncword / Header detection (default)
 *   - Preamble detection
 *
 * @param [in] enable If true, the timer stops on Syncword / Header detection.
 * @returns    Non-zero value in case of error
 */
SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_subghz_stop_tmr_on_pbl(const uint32_t enable)
{
    sid_radio_error_t err;
    HAL_StatusTypeDef hal_err;
    uint8_t           buf = FALSE == enable ? 0 : 1u;

    hal_err = HAL_SUBGHZ_ExecSetCmd(&hsubghz, RADIO_SET_STOPRXTIMERONPREAMBLE, &buf, sizeof(buf));
    if (HAL_OK == hal_err)
    {
        err = SID_RADIO_ERROR_NONE;
    }
    else
    {
        SID_PAL_LOG_ERROR("Failed to execute SubGHz cmd. Cmd: 0x%02X, HAL_SUBGHZ err: 0x%x", RADIO_SET_STOPRXTIMERONPREAMBLE, hal_err);
        err = SID_RADIO_ERROR_HARDWARE;
    }

    return err;
}

/*----------------------------------------------------------------------------*/

/**
 * @brief Set the chip in transmission mode
 *
 * @remark The packet type shall be configured with @ref _sid_radio_set_pkt_type before using this command.
 *
 * @remark By default, the chip returns automatically to standby RC mode as soon as the packet is sent or if the packet
 * has not been completely transmitted before the timeout. This behavior can be altered by @ref
 * _sid_radio_subghz_set_rx_tx_fallback_mode.
 *
 * @remark The timeout duration can be computed with the formula:
 * \f$ timeout\_duration\_ms = timeout \times * \frac{1}{64} \f$
 *
 * @remark Maximal value is 0xFFFFFF (i.e. 511 seconds)
 *
 * @remark If the timeout argument is 0, then no timeout is used.
 *
 * @param [in] timeout The timeout configuration for Tx operation
 * @returns    Non-zero value in case of error
 */
SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_subghz_set_tx(const uint32_t timeout)
{
    sid_radio_error_t err;
    HAL_StatusTypeDef hal_err;
    uint8_t           buf[3] = {
                                   (uint8_t)(timeout >> 16),
                                   (uint8_t)(timeout >>  8),
                                   (uint8_t)(timeout >>  0),
                               };

#if defined(DEBUG) && defined(NUCLEO_WL55_BOARD)
    /* Quick checks that antenna switch is configured properly - valid for the Nucleo board only */
    const GPIO_PinState ctrl3 = (RF_SW_CTRL3_GPIO_PORT->IDR & RF_SW_CTRL3_PIN) != 0u ? GPIO_PIN_SET : GPIO_PIN_RESET;
    const GPIO_PinState ctrl1 = (RF_SW_CTRL1_GPIO_PORT->IDR & RF_SW_CTRL1_PIN) != 0u ? GPIO_PIN_SET : GPIO_PIN_RESET;
    const GPIO_PinState ctrl2 = (RF_SW_CTRL2_GPIO_PORT->IDR & RF_SW_CTRL2_PIN) != 0u ? GPIO_PIN_SET : GPIO_PIN_RESET;

    if ((ctrl3 != GPIO_PIN_SET) || (ctrl2 != GPIO_PIN_SET)) /* ctrl1 is don't care */
    {
        SID_PAL_LOG_ERROR("Wrong antenna switch config for TX: ctrl1: %u, ctrl2: %u, ctrl3: %u", ctrl1, ctrl2, ctrl3);
    }
#endif /* DEBUG && NUCLEO_WL55_BOARD */

    hal_err = HAL_SUBGHZ_ExecSetCmd(&hsubghz, RADIO_SET_TX, buf, sizeof(buf));
    if (HAL_OK == hal_err)
    {
        err = SID_RADIO_ERROR_NONE;
    }
    else
    {
        SID_PAL_LOG_ERROR("Failed to execute SubGHz cmd. Cmd: 0x%02X, HAL_SUBGHZ err: 0x%x", RADIO_SET_TX, hal_err);
        err = SID_RADIO_ERROR_HARDWARE;
    }

    return err;
}

/*----------------------------------------------------------------------------*/

/**
 * @brief Sets LoRa symbol timeout
 *
 * @param nb_of_symbs number of symbol intervals as timeout
 * @returns           Non-zero value in case of error
 */
SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_subghz_set_lora_symb_nb_timeout(const uint8_t nb_of_symbs)
{
    sid_radio_error_t err;
    HAL_StatusTypeDef hal_err;

    do
    {
        hal_err = HAL_SUBGHZ_ExecSetCmd(&hsubghz, RADIO_SET_LORASYMBTIMEOUT, (uint8_t *)&nb_of_symbs, sizeof(nb_of_symbs));
        if (hal_err != HAL_OK)
        {
            SID_PAL_LOG_ERROR("Failed to execute SubGHz cmd. Cmd: 0x%02X, HAL_SUBGHZ err: 0x%x", RADIO_SET_LORASYMBTIMEOUT, hal_err);
            err = SID_RADIO_ERROR_HARDWARE;
            break;
        }

