TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/common/stm32wl55x_radio/Sidewalk/sid_radio.c
        if (nb_of_symbs >= 64u)
        {
            uint8_t mant = nb_of_symbs >> 1;
            uint8_t exp  = 0u;
            uint8_t reg  = 0u;

            while (mant > 31u)
            {
                mant >>= 2;
                exp++;
            }

            reg = exp + (mant << 3);

            hal_err = HAL_SUBGHZ_WriteRegisters(&hsubghz, REG_LR_SYNCH_TIMEOUT, &reg, sizeof(reg));
            if (hal_err != HAL_OK)
            {
                SID_PAL_LOG_ERROR("Failed to write SubGHz reg. Reg: 0x%04X, HAL_SUBGHZ err: 0x%x", REG_LR_SYNCH_TIMEOUT, hal_err);
                err = SID_RADIO_ERROR_HARDWARE;
                break;
            }
        }

        err = SID_RADIO_ERROR_NONE;
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

/**
 * @brief Configure the sync word used in GFSK packet
 *
 * @param [in] sync_word Buffer holding the sync word to be configured
 * @param [in] sync_word_len Sync word length in byte
 *
 * @returns    Non-zero value in case of error
 */
SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_subghz_set_gfsk_sync_word(const uint8_t * const sync_word, const uint8_t sync_word_len)
{
    sid_radio_error_t err;
    HAL_StatusTypeDef hal_err;
    uint8_t           buf[8] = { 0 };

    do
    {
        if (sync_word_len > sizeof(buf))
        {
            SID_PAL_LOG_ERROR("Cannot apply FSK sync word -it's too long (%u vs %u)", sync_word_len, sizeof(buf));
            err = SID_RADIO_ERROR_WRONG_SIZE;
            break;
        }

        /* Copy to a tem buffer since we have to put zero to the unused sync word bytes */
        SID_STM32_UTIL_fast_memcpy(buf, sync_word, sync_word_len);

        hal_err = HAL_SUBGHZ_WriteRegisters(&hsubghz, REG_LR_SYNCWORDBASEADDRESS, buf, sizeof(buf));
        if (hal_err != HAL_OK)
        {
            SID_PAL_LOG_ERROR("Failed to write SubGHz reg. Reg: 0x%04X, HAL_SUBGHZ err: 0x%x", REG_LR_SYNCWORDBASEADDRESS, hal_err);
            err = SID_RADIO_ERROR_HARDWARE;
            break;
        }

        err = SID_RADIO_ERROR_NONE;
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

/**
 * @brief Configure the sync word used in LoRa packet
 *
 * @remark In the case of a LoRaWAN use case, the two following values are specified:
 *   - 0x12 for a private LoRaWAN network (default)
 *   - 0x34 for a public LoRaWAN network
 *
 * @param [in] sync_word Sync word to be configured
 *
 * @returns    Non-zero value in case of error
 */
SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_subghz_set_lora_sync_word(const uint16_t sync_word)
{
    sid_radio_error_t err;
    HAL_StatusTypeDef hal_err;
    uint8_t           buffer[2];

    buffer[0] = (uint8_t)(sync_word >> 8);
    buffer[1] = (uint8_t)(sync_word);

    hal_err = HAL_SUBGHZ_WriteRegisters(&hsubghz, REG_LR_SYNCWORD, buffer, sizeof(buffer));
    if (HAL_OK == hal_err)
    {
        err = SID_RADIO_ERROR_NONE;
    }
    else
    {
        SID_PAL_LOG_ERROR("Failed to write SubGHz reg. Reg: 0x%04X, HAL_SUBGHZ err: 0x%x", REG_LR_SYNCWORD, hal_err);
        err = SID_RADIO_ERROR_HARDWARE;
    }

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_subghz_clear_irq_status(const uint16_t irq_mask)
{
    sid_radio_error_t err;
    HAL_StatusTypeDef hal_err;
    uint8_t           buf[2];

    buf[0] = (uint8_t)(irq_mask >> 8);
    buf[1] = (uint8_t)(irq_mask);

    hal_err = HAL_SUBGHZ_ExecSetCmd(&hsubghz, RADIO_CLR_IRQSTATUS, buf, sizeof(buf));
    if (HAL_OK == hal_err)
    {
        err = SID_RADIO_ERROR_NONE;
    }
    else
    {
        SID_PAL_LOG_ERROR("Failed to execute SubGHz cmd. Cmd: 0x%02X, HAL_SUBGHZ err: 0x%x", RADIO_CLR_IRQSTATUS, hal_err);
        err = SID_RADIO_ERROR_HARDWARE;
    }

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_subghz_clear_irq_status_all(void)
{
    sid_radio_error_t err;

    err = _sid_radio_subghz_clear_irq_status(STM32WLxx_SUBGHZ_IRQ_ALL);
    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_subghz_set_sleep(const stm32wlxx_subghz_sleep_params_t cfg)
{
    sid_radio_error_t err;
    HAL_StatusTypeDef hal_err;

    hal_err = HAL_SUBGHZ_ExecSetCmd(&hsubghz, RADIO_SET_SLEEP, (uint8_t *)&cfg.raw, sizeof(cfg.raw));
    if (HAL_OK == hal_err)
    {
        err = SID_RADIO_ERROR_NONE;
    }
    else
    {
        SID_PAL_LOG_ERROR("Failed to execute SubGHz cmd. Cmd: 0x%02X, HAL_SUBGHZ err: 0x%x", RADIO_SET_SLEEP, hal_err);
        err = SID_RADIO_ERROR_HARDWARE;
    }

    return err;
}

/*----------------------------------------------------------------------------*/

/**
 * @brief Wakes up SubGHz radio from Sleep state
 *
 * @return Non-zero value in case of error
 */
SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_subghz_wakeup(const uint32_t timeout_ms)
{
    sid_radio_error_t err = SID_RADIO_ERROR_GENERIC;

    /* Drive NSS pin to wakeup the radio */
    LL_PWR_SelectSUBGHZSPI_NSS();

    /* Wait for the wakeup to be indicated by Radio Busy signal */
    err = _wait_for_subghz_ready(timeout_ms);

    /* Release NSS after wakeup is completed (regardless if it was successful or not) */
    LL_PWR_UnselectSUBGHZSPI_NSS();

    if (SID_RADIO_ERROR_NONE == err)
    {
        /* Indicate to the HAL driver that the radio is not in Sleep any longer */
        hsubghz.DeepSleep = SID_RADIO_SUBGHZ_DEEP_SLEEP_DISABLE;

        /* The SubGHz radio is in the STDBY_RC state from this point */
    }

    return err;
}

/*----------------------------------------------------------------------------*/

/**
 * @brief Set the chip in stand-by mode
 *
 * @param [in] cfg Stand-by mode configuration
 * @return     Non-zero value in case of error
 */
SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_subghz_set_standby(const uint8_t cfg)
{
    sid_radio_error_t err;
    HAL_StatusTypeDef hal_err;

