TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/common/stm32wl55x_radio/Sidewalk/sid_radio.c
    hal_err = HAL_SUBGHZ_ExecSetCmd(&hsubghz, RADIO_SET_STANDBY, (uint8_t *)&cfg, sizeof(cfg));
    if (HAL_OK == hal_err)
    {
        err = SID_RADIO_ERROR_NONE;
    }
    else
    {
        SID_PAL_LOG_ERROR("Failed to execute SubGHz cmd. Cmd: 0x%02X, HAL_SUBGHZ err: 0x%x", RADIO_SET_STANDBY, hal_err);
        err = SID_RADIO_ERROR_HARDWARE;
    }

    return err;
}

/*----------------------------------------------------------------------------*/

/** Analog of function from WL55_radio.c
 * @param [in] level of SMPS
 * @return     Non-zero value in case of error
 * */

SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_smps_set(const uint8_t level)
{
    sid_radio_error_t err;
    HAL_StatusTypeDef hal_err;
    uint8_t           reg_value = 0;

    do
    {
        hal_err = HAL_SUBGHZ_ReadRegisters(&hsubghz, SUBGHZ_SMPSC2R, &reg_value, sizeof(reg_value));
        if (hal_err != HAL_OK)
        {
            SID_PAL_LOG_ERROR("Failed to read SubGHz reg. Reg: 0x%04X, HAL_SUBGHZ err: 0x%x", SUBGHZ_SMPSC2R, hal_err);
            err = SID_RADIO_ERROR_HARDWARE;
            break;
        }

        reg_value &= (~SMPS_DRV_MASK);
        reg_value |= level;

        hal_err = HAL_SUBGHZ_WriteRegisters(&hsubghz, SUBGHZ_SMPSC2R, &reg_value, sizeof(reg_value));
        if (hal_err != HAL_OK)
        {
            SID_PAL_LOG_ERROR("Failed to write SubGHz reg. Reg: 0x%04X, HAL_SUBGHZ err: 0x%x", SUBGHZ_SMPSC2R, hal_err);
            err = SID_RADIO_ERROR_HARDWARE;
            break;
        }

        err = SID_RADIO_ERROR_NONE;
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

/**
 * @brief Configure the regulator mode to be used
 *
 * @remark This function shall be called to set the correct regulator mode, depending on the usage of LDO or DC/DC on
 * the PCB implementation.
 *
 * @param [in] mode Regulator mode configuration.
 *
 * @return     Non-zero value in case of error
 * */
SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_set_reg_mode(const uint8_t mode)
{
    sid_radio_error_t err;
    HAL_StatusTypeDef hal_err;

    hal_err = HAL_SUBGHZ_ExecSetCmd(&hsubghz, RADIO_SET_REGULATORMODE, (uint8_t *)&mode, sizeof(mode));
    if (HAL_OK == hal_err)
    {
        err = SID_RADIO_ERROR_NONE;
    }
    else
    {
        SID_PAL_LOG_ERROR("Failed to execute SubGHz cmd. Cmd: 0x%02X, HAL_SUBGHZ err: 0x%x", RADIO_SET_REGULATORMODE, hal_err);
        err = SID_RADIO_ERROR_HARDWARE;
    }

    return err;
}

/*----------------------------------------------------------------------------*/

/**
 * @brief Set buffer start addresses for both Tx and Rx operations
 *
 * @param [in] tx_base_addr The start address used for Tx operations
 * @param [in] rx_base_addr The start address used for Rx operations
 *
 * @return     Non-zero value in case of error
 */
SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_set_buffer_base_addr(const uint8_t tx_base_addr, const uint8_t rx_base_addr)
{
    sid_radio_error_t err;
    HAL_StatusTypeDef hal_err;
    uint8_t           buf[2] = {tx_base_addr, rx_base_addr};

    hal_err = HAL_SUBGHZ_ExecSetCmd(&hsubghz, RADIO_SET_BUFFERBASEADDRESS, buf, sizeof(buf));
    if (HAL_OK == hal_err)
    {
        err = SID_RADIO_ERROR_NONE;
    }
    else
    {
        SID_PAL_LOG_ERROR("Failed to execute SubGHz cmd. Cmd: 0x%02X, HAL_SUBGHZ err: 0x%x", RADIO_SET_BUFFERBASEADDRESS, hal_err);
        err = SID_RADIO_ERROR_HARDWARE;
    }

    return err;
}

/*----------------------------------------------------------------------------*/

/**
 * @brief Configure the boost mode in reception
 *
 * @remark This configuration is not kept in the retention memory. Rx boosted mode shall be enabled each time the chip
 * leaves sleep mode.
 *
 * @param [in] context Chip implementation context.
 * @param [in] state Boost mode activation
 *
 * @return     Non-zero value in case of error
 */
SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_cfg_rx_boosted(const uint32_t enabled)
{
    sid_radio_error_t err;
    HAL_StatusTypeDef hal_err;
    uint8_t           gain_val = enabled != FALSE ? 0x96u : 0x94u;

    hal_err = HAL_SUBGHZ_WriteRegisters(&hsubghz, REG_RX_GAIN, &gain_val, sizeof(gain_val));
    if (HAL_OK == hal_err)
    {
        err = SID_RADIO_ERROR_NONE;
    }
    else
    {
        SID_PAL_LOG_ERROR("Failed to write SubGHz reg. Reg: 0x%04X, HAL_SUBGHZ err: 0x%x", REG_RX_GAIN, hal_err);
        err = SID_RADIO_ERROR_HARDWARE;
    }

    return err;
}

/*----------------------------------------------------------------------------*/

/**
 * @brief Configure the embedded TCXO switch control
 *
 * @remark This function shall only be called in standby RC mode.
 *
 * @remark The chip will wait for the timeout to happen before starting any operation that requires the TCXO.
 *
 * @param [in] tcxo_voltage Voltage used to power the TCXO.
 * @param [in] timeout Time needed for the TCXO to be stable.
 *
 * @return     Non-zero value in case of error
 */
SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_set_tcxo_mode(const RadioTcxoCtrlVoltage_t tcxo_voltage, const uint32_t timeout)
{
    sid_radio_error_t err;
    HAL_StatusTypeDef hal_err;
    uint8_t           buf[4] = {
                                   (uint8_t)tcxo_voltage & 0x07u,
                                   (uint8_t)(timeout >> 16),
                                   (uint8_t)(timeout >> 8),
                                   (uint8_t)(timeout >> 0),
                               };

    hal_err = HAL_SUBGHZ_ExecSetCmd(&hsubghz, RADIO_SET_TCXOMODE, buf, sizeof(buf));
    if (HAL_OK == hal_err)
    {
        err = SID_RADIO_ERROR_NONE;
    }
    else
    {
        SID_PAL_LOG_ERROR("Failed to execute SubGHz cmd. Cmd: 0x%02X, HAL_SUBGHZ err: 0x%x", RADIO_SET_TCXOMODE, hal_err);
        err = SID_RADIO_ERROR_HARDWARE;
    }

    return err;
}

/*----------------------------------------------------------------------------*/

/**
 * @brief Clear all active errors
 *
 * @return     Non-zero value in case of error
 */
SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_clear_subghz_errors(void)
{
    sid_radio_error_t err;
    HAL_StatusTypeDef hal_err;
    uint8_t           buf[2] = { 0 };

    hal_err = HAL_SUBGHZ_ExecSetCmd(&hsubghz, RADIO_CLR_ERROR, buf, sizeof(buf));
    if (HAL_OK == hal_err)
    {
        err = SID_RADIO_ERROR_NONE;
    }
    else
    {
        SID_PAL_LOG_ERROR("Failed to execute SubGHz cmd. Cmd: 0x%02X, HAL_SUBGHZ err: 0x%x", RADIO_CLR_ERROR, hal_err);
        err = SID_RADIO_ERROR_HARDWARE;
    }

