TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/common/stm32wl55x_radio/Sidewalk/sid_radio.c
    return err;
}

/*----------------------------------------------------------------------------*/

/**
 * @brief Get the list of all active errors
 *
 * @param [out] errors Pointer to a variable to store the error list
 *
 * @return     Non-zero value in case of error
 */
SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_get_subghz_errors(uint16_t * const errors)
{
    sid_radio_error_t err;
    HAL_StatusTypeDef hal_err;
    uint8_t           errors_local[2];

    hal_err = HAL_SUBGHZ_ExecGetCmd(&hsubghz, RADIO_GET_ERROR , errors_local, sizeof(errors_local));

    if (HAL_OK == hal_err)
    {
        *errors = ( ( uint16_t ) errors_local[0] << 8 ) + ( ( uint16_t ) errors_local[1] << 0 );

        err = SID_RADIO_ERROR_NONE;
    }
    else
    {
        SID_PAL_LOG_ERROR("Failed to access SubGHz. HAL_SUBGHZ err: 0x%x", hal_err);
        err = SID_RADIO_ERROR_HARDWARE;
    }

    return err;
}

/*----------------------------------------------------------------------------*/

/**
 * @brief Perform the calibration of the requested blocks
 *
 * @remark This function shall only be called in stand-by RC mode
 *
 * @remark The chip will return to stand-by RC mode on exit. Potential calibration issues can be read out with @ref
 * _sid_radio_get_subghz_errors command.
 *
 * @param [in] param Mask holding the blocks to be calibrated
 *
 * @return     Non-zero value in case of error
 */
SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_calibrate(const uint8_t param)
{
    sid_radio_error_t err;
    HAL_StatusTypeDef hal_err;

    hal_err = HAL_SUBGHZ_ExecSetCmd(&hsubghz, RADIO_CALIBRATE, (uint8_t *)&param, sizeof(param));
    if (HAL_OK == hal_err)
    {
        err = SID_RADIO_ERROR_NONE;
    }
    else
    {
        SID_PAL_LOG_ERROR("Failed to execute SubGHz cmd. Cmd: 0x%02X, HAL_SUBGHZ err: 0x%x", RADIO_CALIBRATE, hal_err);
        err = SID_RADIO_ERROR_HARDWARE;
    }

    return err;
}

/*----------------------------------------------------------------------------*/

/**
 * @brief Configure the PA (Power Amplifier)
 *
 * @details This command is used to differentiate the SX1261 from the SX1262 / SX1268. When using this command, the user
 * selects the PA to be used by the device as well as its configuration.
 *
 *
 * @return     Non-zero value in case of error
 */
SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_set_pa_cfg(const stm32wlxx_radio_pa_setup_t * const pa_cfg)
{
    sid_radio_error_t err;
    HAL_StatusTypeDef hal_err;

    do
    {
        /* Check if the requested PA selection is compatibl with current board */
        const RBI_Switch_TypeDef rf_sw_cfg = _sid_radio_rbi_get_pa_selector(SID_RADIO_SUBGHZ_PA_SEL_HPA == pa_cfg->device_sel ? TRUE : FALSE);
        if (RBI_SWITCH_OFF == rf_sw_cfg)
        {
            /* Invalid PA type selection. Error logs are provided by the _sid_radio_rbi_get_pa_selector() */
            err = SID_RADIO_ERROR_NOT_SUPPORTED;
            break;
        }

        uint8_t buf[4] = {
                             pa_cfg->pa_duty_cycle,
                             pa_cfg->hp_max,
                             pa_cfg->device_sel,
                             pa_cfg->pa_lut,
                         };

        hal_err = HAL_SUBGHZ_ExecSetCmd(&hsubghz, RADIO_SET_PACONFIG, buf, sizeof(buf));
        if (hal_err != HAL_OK)
        {
            SID_PAL_LOG_ERROR("Failed to execute SubGHz cmd. Cmd: 0x%02X, HAL_SUBGHZ err: 0x%x", RADIO_SET_PACONFIG, hal_err);
            err = SID_RADIO_ERROR_HARDWARE;
            break;
        }

        err = SID_RADIO_ERROR_NONE;
    } while (0u);

    return err;
}

/*----------------------------------------------------------------------------*/

/**
 * @brief Set the parameters for TX power and power amplifier ramp time
 *
 * @param [in] context Chip implementation context.
 * @param [in] pwr_in_dbm The Tx output power in dBm
 * @param [in] ramp_time The ramping time configuration for the PA
 *
 * @return     Non-zero value in case of error
 */
SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_set_tx_params(const stm32wlxx_radio_pa_setup_t * const pa_cfg)
{
    sid_radio_error_t err;
    HAL_StatusTypeDef hal_err;

    /* Ensure the requested Tx power is aligned with the selected power amplifier */
    int32_t tx_pwr_reg = pa_cfg->tx_power_reg;
    if (SID_RADIO_SUBGHZ_PA_SEL_HPA == pa_cfg->device_sel)
    {
        /* HPA will be used */
        if (tx_pwr_reg > SID_RADIO_SUBGHZ_HPA_TX_PWR_UPPER_LIMIT)
        {
            /* Saturate to the highest possible value */
            tx_pwr_reg = SID_RADIO_SUBGHZ_HPA_TX_PWR_UPPER_LIMIT;
        }
        else if (tx_pwr_reg < SID_RADIO_SUBGHZ_HPA_TX_PWR_LOWER_LIMIT)
        {
            /* Saturate to the lowest possible value */
            tx_pwr_reg = SID_RADIO_SUBGHZ_HPA_TX_PWR_LOWER_LIMIT;
        }
        else
        {
            /* Within the range - keep as is */
        }
    }
    else
    {
        /* LPA will be used */
        if (tx_pwr_reg > SID_RADIO_SUBGHZ_LPA_TX_PWR_UPPER_LIMIT)
        {
            /* Saturate to the highest possible value */
            tx_pwr_reg = SID_RADIO_SUBGHZ_LPA_TX_PWR_UPPER_LIMIT;
        }
        else if (tx_pwr_reg < SID_RADIO_SUBGHZ_LPA_TX_PWR_LOWER_LIMIT)
        {
            /* Saturate to the lowest possible value */
            tx_pwr_reg = SID_RADIO_SUBGHZ_LPA_TX_PWR_LOWER_LIMIT;
        }
        else
        {
            /* Within the range - keep as is */
        }
    }

    if (tx_pwr_reg != pa_cfg->tx_power_reg)
    {
        SID_PAL_LOG_WARNING("Tx power saturated from %s%ddBm to %s%ddBm due to HW limitations",
                            pa_cfg->target_tx_power > 0 ? "+" : "", pa_cfg->target_tx_power,
                            pa_cfg->target_tx_power - (pa_cfg->tx_power_reg - tx_pwr_reg)  > 0 ? "+" : "", pa_cfg->target_tx_power - (pa_cfg->tx_power_reg - tx_pwr_reg));
    }

    /* Apply settings */
    uint8_t           buf[2] = {
                                   (uint8_t)tx_pwr_reg,
                                   (uint8_t)pa_cfg->ramp_time,
                               };

    hal_err = HAL_SUBGHZ_ExecSetCmd(&hsubghz, RADIO_SET_TXPARAMS, buf, sizeof(buf));
    if (HAL_OK == hal_err)
    {
        err = SID_RADIO_ERROR_NONE;
    }
    else
    {
        SID_PAL_LOG_ERROR("Failed to execute SubGHz cmd. Cmd: 0x%02X, HAL_SUBGHZ err: 0x%x", RADIO_SET_TXPARAMS, hal_err);
        err = SID_RADIO_ERROR_HARDWARE;
    }

