TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/common/stm32wl55x_radio/Sidewalk/sid_radio.c
    return err;
}

/*----------------------------------------------------------------------------*/

/**
 * @brief Set which interrupt signals are redirected to the dedicated DIO pin
 *
 * @remark By default, no interrupt signal is redirected.
 *
 * @remark An interrupt will not occur until it is enabled system-wide, even if it is redirected to a specific DIO.
 *
 * @remark The DIO pin will remain asserted until all redirected interrupt signals are cleared with a call to @ref
 * _sid_radio_subghz_clear_irq_status.
 *
 * @remark DIO2 and DIO3 are shared with other features.
 *
 * @param [in] context Chip implementation context.
 * @param [in] irq_mask Variable that holds the system interrupt mask
 * @param [in] dio1_mask Variable that holds the interrupt mask for dio1
 * @param [in] dio2_mask Variable that holds the interrupt mask for dio2
 * @param [in] dio3_mask Variable that holds the interrupt mask for dio3
 *
 * @return     Non-zero value in case of error
 *
 * @see _sid_radio_subghz_clear_irq_status, wl55_set_dio2_as_rf_sw_ctrl, _sid_radio_set_tcxo_mode
 */
SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_set_dio_irq_params(const uint16_t irq_mask, const uint16_t dio1_mask, const uint16_t dio2_mask, const uint16_t dio3_mask)
{
    sid_radio_error_t err;
    HAL_StatusTypeDef hal_err;
    uint8_t           buf[8];

    /* Global IRQ mask */
    buf[0] = (uint8_t)( irq_mask >> 8 );
    buf[1] = (uint8_t)( irq_mask >> 0 );

    /* IRQ indication assignments for DIO1 pin */
    buf[2] = (uint8_t)( dio1_mask >> 8 );
    buf[3] = (uint8_t)( dio1_mask >> 0 );

    /* IRQ indication assignments for DIO2 pin */
    buf[4] = (uint8_t)( dio2_mask >> 8 );
    buf[5] = (uint8_t)( dio2_mask >> 0 );

    /* IRQ indication assignments for DIO3 pin */
    buf[6] = (uint8_t)( dio3_mask >> 8 );
    buf[7] = (uint8_t)( dio3_mask >> 0 );

    hal_err = HAL_SUBGHZ_ExecSetCmd(&hsubghz, RADIO_CFG_DIOIRQ, buf, sizeof(buf));
    if (HAL_OK == hal_err)
    {
        err = SID_RADIO_ERROR_NONE;
    }
    else
    {
        SID_PAL_LOG_ERROR("Failed to execute SubGHz cmd. Cmd: 0x%02X, HAL_SUBGHZ err: 0x%x", RADIO_CFG_DIOIRQ, hal_err);
        err = SID_RADIO_ERROR_HARDWARE;
    }

    return err;
}

/*----------------------------------------------------------------------------*/

/**
 * @brief Set the packet type
 *
 * @param [in] pkt_type Packet type to set
 * @returns true in case of error
 */
SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_set_pkt_type(const uint8_t pkt_type)
{
    sid_radio_error_t err;
    HAL_StatusTypeDef hal_err;

    hal_err = HAL_SUBGHZ_ExecSetCmd(&hsubghz, RADIO_SET_PACKETTYPE, (uint8_t *)&pkt_type, sizeof(pkt_type));
    if (HAL_OK == hal_err)
    {
        err = SID_RADIO_ERROR_NONE;
    }
    else
    {
        SID_PAL_LOG_ERROR("Failed to execute SubGHz cmd. Cmd: 0x%02X, HAL_SUBGHZ err: 0x%x", RADIO_SET_PACKETTYPE, hal_err);
        err = SID_RADIO_ERROR_HARDWARE;
    }

    return err;
}

/*----------------------------------------------------------------------------*/

/**
 * @brief Set the packet parameters for GFSK packets
 *
 * @remark The command @ref _sid_radio_set_pkt_type must be called prior to this one.
 *
 * @param [in] params The structure of GFSK packet configuration
 * @return     Non-zero value in case of error
 */
SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_subghz_set_gfsk_pkt_params(const stm32wlxx_pal_radio_fsk_pkt_params_t * const params)
{
    sid_radio_error_t           err;
    HAL_StatusTypeDef           hal_err;
    uint8_t                     buf[9];
    stm32wlxx_pkt_params_gfsk_t fsk_pp;

    _sid_radio_convert_fsk_packet_params(&fsk_pp, params);

    buf[0] = (uint8_t)(fsk_pp.pbl_len_in_bits >> 8);
    buf[1] = (uint8_t)(fsk_pp.pbl_len_in_bits >> 0);
    buf[2] = (uint8_t)(fsk_pp.pbl_min_det);
    buf[3] = fsk_pp.sync_word_len_in_bits;
    buf[4] = (uint8_t)(fsk_pp.addr_cmp);
    buf[5] = (uint8_t)(fsk_pp.hdr_type);
    buf[6] = fsk_pp.pld_len_in_bytes;
    buf[7] = (uint8_t)(fsk_pp.crc_type);
    buf[8] = (uint8_t)(fsk_pp.dc_free);

    hal_err = HAL_SUBGHZ_ExecSetCmd(&hsubghz, RADIO_SET_PACKETPARAMS, buf, sizeof(buf));
    if (HAL_OK == hal_err)
    {
        err = SID_RADIO_ERROR_NONE;
    }
    else
    {
        SID_PAL_LOG_ERROR("Failed to execute SubGHz cmd. Cmd: 0x%02X, HAL_SUBGHZ err: 0x%x", RADIO_SET_PACKETPARAMS, hal_err);
        err = SID_RADIO_ERROR_HARDWARE;
    }

    return err;
}

/*----------------------------------------------------------------------------*/

/**
 * @brief Perform device operating frequency band image rejection calibration
 *
 * @param [in] freq_in_hz Frequency in Hz used for the image calibration
 * @return     Non-zero value in case of error
 */
SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_cal_img(const stm32wlxx_freq_cal_band_t freq_band)
{
    sid_radio_error_t err;
    HAL_StatusTypeDef hal_err;
    uint8_t           buf[2];

    switch (freq_band)
    {
        case STM32WLxx_SUBGHZ_BAND_900M:
            buf[0] = 0xE1u;
            buf[1] = 0xE9u;
            break;

        case STM32WLxx_SUBGHZ_BAND_850M:
            buf[0] = 0xD7u;
            buf[1] = 0xDBu;
            break;

        case STM32WLxx_SUBGHZ_BAND_770M:
            buf[0] = 0xC1u;
            buf[1] = 0xC5u;
            break;

        case STM32WLxx_SUBGHZ_BAND_460M:
            buf[0] = 0x75u;
            buf[1] = 0x81u;
            break;

        case STM32WLxx_SUBGHZ_BAND_430M:
            buf[0] = 0x6Bu;
            buf[1] = 0x6Fu;
            break;

        case STM32WLxx_SUBGHZ_BAND_INVALID:
        default:
            SID_PAL_LOG_ERROR("Invalid frequeny band specified: %u", (uint32_t)freq_band);
            return SID_RADIO_ERROR_INVALID_ARGS;
            break;
    }

    SID_PAL_LOG_DEBUG("Running SubGHz calibration");

    hal_err = HAL_SUBGHZ_ExecSetCmd(&hsubghz, RADIO_CALIBRATEIMAGE, buf, sizeof(buf));
    if (HAL_OK == hal_err)
    {
        err = SID_RADIO_ERROR_NONE;
    }
    else
    {
        SID_PAL_LOG_ERROR("Failed to execute SubGHz cmd. Cmd: 0x%02X, HAL_SUBGHZ err: 0x%x", RADIO_CALIBRATEIMAGE, hal_err);
        err = SID_RADIO_ERROR_HARDWARE;
    }

