TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/common/stm32wl55x_radio/Sidewalk/sid_radio.c
    return err;
}

/*----------------------------------------------------------------------------*/

/**
 * @brief Set the RF frequency for future radio operations.
 *
 * @remark This commands shall be called only after a packet type is selected.
 *
 * @param [in] freq_hz The frequency in Hz to set for radio operations
 * @return     Non-zero value in case of error
 */
SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_set_rf_freq(const uint32_t freq_hz)
{
    sid_radio_error_t err;
    HAL_StatusTypeDef hal_err;
    uint8_t           buf[sizeof(uint32_t)];
    uint32_t          freq_pll_step;

    SID_RADIO_FREQ_HZ_TO_PLL_STEP(freq_hz, freq_pll_step);

    buf[0] = (uint8_t)(freq_pll_step >> 24);
    buf[1] = (uint8_t)(freq_pll_step >> 16);
    buf[2] = (uint8_t)(freq_pll_step >>  8);
    buf[3] = (uint8_t)(freq_pll_step >>  0);

    hal_err = HAL_SUBGHZ_ExecSetCmd(&hsubghz, RADIO_SET_RFFREQUENCY, (uint8_t *)&buf, sizeof(buf));
    if (HAL_OK == hal_err)
    {
        err = SID_RADIO_ERROR_NONE;
    }
    else
    {
        SID_PAL_LOG_ERROR("Failed to execute SubGHz cmd. Cmd: 0x%02X, HAL_SUBGHZ err: 0x%x", RADIO_SET_RFFREQUENCY, hal_err);
        err = SID_RADIO_ERROR_HARDWARE;
    }

    return err;
}

/*----------------------------------------------------------------------------*/

/**
 * @brief 15.1.2 Workaround
 *
 * @remark Before any packet transmission, bit #2 of SUBGHZ_SDCFG0R shall be set to:
 * 0 if the LoRa BW = 500 kHz
 * 1 for any other LoRa BW
 * 1 for any (G)FSK configuration
 *
 * @param [in] pkt_type The modulation type (G)FSK/LoRa
 * @param [in] bw In case of LoRa modulation the bandwith must be specified
 * @return     Non-zero value in case of error
 */
SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_tx_modulation_workaround(const stm32wlxx_pkt_type_t pkt_type, const stm32wlxx_lora_bw_t bw)
{
    sid_radio_error_t err;
    HAL_StatusTypeDef hal_err;
    uint8_t           reg_value;

    do
    {
        hal_err = HAL_SUBGHZ_ReadRegisters(&hsubghz, SUBGHZ_SDCFG0R, &reg_value, sizeof(reg_value));
        if (hal_err != HAL_OK)
        {
            SID_PAL_LOG_ERROR("Failed to read SubGHz reg. Reg: 0x%04X, HAL_SUBGHZ err: 0x%x", SUBGHZ_SDCFG0R, hal_err);
            err = SID_RADIO_ERROR_HARDWARE;
            break;
        }

        if (pkt_type == STM32WLxx_PKT_TYPE_LORA)
        {
            if (bw == STM32WLxx_LORA_BW_500)
            {
                reg_value &= ~(1u << 2); /* Bit 2 set to 0 if the LoRa BW = 500 kHz */
            }
            else
            {
                reg_value |= (1u << 2); /* Bit 2 set to 1 for any other LoRa BW */
            }
        }
        else
        {
            (void)bw;
            reg_value |= (1u << 2); /* Bit 2 set to 1 for any (G)FSK configuration */
        }

        hal_err = HAL_SUBGHZ_WriteRegisters(&hsubghz, SUBGHZ_SDCFG0R, &reg_value, sizeof(reg_value));
        if (hal_err != HAL_OK)
        {
            SID_PAL_LOG_ERROR("Failed to write SubGHz reg. Reg: 0x%04X, HAL_SUBGHZ err: 0x%x", SUBGHZ_SDCFG0R, hal_err);
            err = SID_RADIO_ERROR_HARDWARE;
            break;
        }

        err = SID_RADIO_ERROR_NONE;
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

/**
 * @brief Set the modulation parameters for LoRa packets
 *
 * @remark The command @ref _sid_radio_set_pkt_type must be called prior to this one.
 *
 * @param [in] params The structure of LoRa modulation configuration
 * @returns    Non-zero value in case of error
 */
SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_subghz_set_lora_mod_params(const stm32wlxx_radio_lora_phy_mod_params_t * const params)
{
    sid_radio_error_t err = SID_RADIO_ERROR_GENERIC;

    do
    {
        HAL_StatusTypeDef           hal_err;
        uint8_t                     buf[4];
        stm32wlxx_mod_params_lora_t lora_phy_mod_params = {0};

        _sid_radio_convert_to_phy_lora_mod_params(&lora_phy_mod_params, params);

        if (lora_phy_mod_params.cr > STM32WLxx_LORA_CR_4_8)
        {
            SID_PAL_LOG_ERROR("_sid_radio_subghz_set_lora_mod_params: coding rate selectors higher than 0x4 are not supported, requested CR is 0x%x", (uint32_t)lora_phy_mod_params.cr);
            err = SID_RADIO_ERROR_NOT_SUPPORTED;
            break;
        }

        buf[0] = (uint8_t)(lora_phy_mod_params.sf);
        buf[1] = (uint8_t)(lora_phy_mod_params.bw);
        buf[2] = (uint8_t)(lora_phy_mod_params.cr);
        buf[3] = (uint8_t)(lora_phy_mod_params.ldro);

        SID_RADIO_LOG_DEBUG("LoRa mod: sf:0x%02x bw: %u, cr: %u, ldro: %u", lora_phy_mod_params.sf, lora_phy_mod_params.bw, lora_phy_mod_params.cr, lora_phy_mod_params.ldro);

        hal_err = HAL_SUBGHZ_ExecSetCmd(&hsubghz, RADIO_SET_MODULATIONPARAMS, (uint8_t *)&buf, sizeof(buf));
        if (hal_err != HAL_OK)
        {
            SID_PAL_LOG_ERROR("Failed to execute SubGHz cmd. Cmd: 0x%02X, HAL_SUBGHZ err: 0x%x", RADIO_SET_MODULATIONPARAMS, hal_err);
            err = SID_RADIO_ERROR_HARDWARE;
            break;
        }

        /* WORKAROUND - Modulation Quality with 500 kHz LoRa Bandwidth, see datasheet DS_SX1261-2_V1.2 §15.1 */
        err = _sid_radio_tx_modulation_workaround(STM32WLxx_PKT_TYPE_LORA, lora_phy_mod_params.bw);
        if (err != SID_RADIO_ERROR_NONE)
        {
            break;
        }
        /* WORKAROUND END */

        err = SID_RADIO_ERROR_NONE;
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

/**
 * @brief Set the packet parameters for LoRa packets
 *
 * @remark The command @ref _sid_radio_set_pkt_type must be called prior to this one.
 *
 * @param [in] params The structure of LoRa packet configuration
 * @return     Non-zero value in case of error
 */
SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_subghz_set_lora_pkt_params(const stm32wlxx_radio_lora_phy_pkt_params_t * const params)
{
    sid_radio_error_t err = SID_RADIO_ERROR_GENERIC;

    do
    {
        HAL_StatusTypeDef hal_err;
        uint8_t           buf[6] = { 0 };

        buf[0] = (uint8_t)(params->preamble_length >> 8);
        buf[1] = (uint8_t)(params->preamble_length >> 0);
        buf[2] = (uint8_t)(params->header_type);
        buf[3] = params->payload_length;
        buf[4] = (uint8_t)(params->crc_mode ? 1u : 0u);
        buf[5] = (uint8_t)(params->invert_IQ ? 1u : 0u);

        hal_err = HAL_SUBGHZ_ExecSetCmd(&hsubghz, RADIO_SET_PACKETPARAMS, (uint8_t *)&buf, sizeof(buf));
        if (hal_err != HAL_OK)
        {
            SID_PAL_LOG_ERROR("Failed to execute SubGHz cmd. Cmd: 0x%02X, HAL_SUBGHZ err: 0x%x", RADIO_SET_PACKETPARAMS, hal_err);
            err = SID_RADIO_ERROR_HARDWARE;
            break;
        }

        /* WORKAROUND - Optimizing the Inverted IQ Operation, see datasheet DS_SX1261-2_V1.2 §15.4 */
        {
            uint8_t reg_value;

