TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/common/stm32wl55x_radio/Sidewalk/sid_radio.c
            hal_err = HAL_SUBGHZ_ReadRegisters(&hsubghz, SUBGHZ_LIQPOLR, &reg_value, sizeof(reg_value));
            if (hal_err != HAL_OK)
            {
                SID_PAL_LOG_ERROR("Failed to read SubGHz reg. Reg: 0x%04X, HAL_SUBGHZ err: 0x%x", SUBGHZ_LIQPOLR, hal_err);
                err = SID_RADIO_ERROR_HARDWARE;
                break;
            }

            if (params->invert_IQ != 0u)
            {
                reg_value &= ~(1u << 2); /* Bit 2 set to 0 when using inverted IQ polarity */
            }
            else
            {
                reg_value |= (1u << 2);  /* Bit 2 set to 1 when using standard IQ polarity */
            }

            hal_err = HAL_SUBGHZ_WriteRegisters(&hsubghz, SUBGHZ_LIQPOLR, &reg_value, sizeof(reg_value));
            if (hal_err != HAL_OK)
            {
                SID_PAL_LOG_ERROR("Failed to write SubGHz reg. Reg: 0x%04X, HAL_SUBGHZ err: 0x%x", SUBGHZ_LIQPOLR, hal_err);
                err = SID_RADIO_ERROR_HARDWARE;
                break;
            }
        }
        /* WORKAROUND END */

        err = SID_RADIO_ERROR_NONE;
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

/**
 * @brief Set the parameters for CAD operation
 *
 * @remark The command @ref _sid_radio_set_pkt_type must be called prior to this one.
 *
 * @param [in] params The structure of CAD configuration
 * @return     Non-zero value in case of error
 */
SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_subghz_set_cad_params(const stm32wlxx_lora_cad_params_t * const params)
{
    sid_radio_error_t err;
    HAL_StatusTypeDef hal_err;
    uint8_t           buf[7];

    buf[0] = (uint8_t)params->cad_symb_nb;
    buf[1] = params->cad_det_peak;
    buf[2] = params->cad_det_min;
    buf[3] = (uint8_t)params->cad_exit_mode;
    buf[4] = (uint8_t)(params->cad_timeout >> 16);
    buf[5] = (uint8_t)(params->cad_timeout >>  8);
    buf[6] = (uint8_t)(params->cad_timeout >>  0);

    hal_err = HAL_SUBGHZ_ExecSetCmd(&hsubghz, RADIO_SET_CADPARAMS, buf, sizeof(buf));
    if (HAL_OK == hal_err)
    {
        err = SID_RADIO_ERROR_NONE;
    }
    else
    {
        SID_PAL_LOG_ERROR("Failed to execute SubGHz cmd. Cmd: 0x%02X, HAL_SUBGHZ err: 0x%x", RADIO_SET_CADPARAMS, hal_err);
        err = SID_RADIO_ERROR_HARDWARE;
    }

    return err;
}

/*----------------------------------------------------------------------------*/

/**  Sets trim values of oscillator
 * @param xta Trim value XTA
 * @param xtb Trim value XTB
 * @return    Non-zero value in case of error
 */
SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_subghz_set_xtal_trim(const uint8_t xta, const uint8_t xtb)
{
    sid_radio_error_t err;
    HAL_StatusTypeDef hal_err;
    uint8_t           buf[2] = {xta, xtb};

    hal_err = HAL_SUBGHZ_WriteRegisters(&hsubghz, REG_XTA_TRIM, buf, sizeof(buf));
    if (HAL_OK == hal_err)
    {
        err = SID_RADIO_ERROR_NONE;
    }
    else
    {
        SID_PAL_LOG_ERROR("Failed to write SubGHz reg. Reg: 0x%04X, HAL_SUBGHZ err: 0x%x", REG_XTA_TRIM, hal_err);
        err = SID_RADIO_ERROR_HARDWARE;
    }

    return err;
}

/*----------------------------------------------------------------------------*/

/**
 * @brief Set the modulation parameters for GFSK packets
 *
 * @remark The command @ref _sid_radio_set_pkt_type must be called prior to this one.
 *
 * @param [in] params The structure of GFSK modulation configuration
 * @return     Non-zero value in case of error
 */
SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_subghz_set_gfsk_mod_params(const stm32wlxx_radio_fsk_phy_mod_params_t * const params)
{
    sid_radio_error_t err = SID_RADIO_ERROR_GENERIC;
    HAL_StatusTypeDef hal_err;

    do
    {
        /* check for division by zero */
        if (0u == params->bit_rate)
        {
            err = SID_RADIO_ERROR_INVALID_ARGS;
            break;
        }

        uint8_t  buf[8];
        uint32_t bitrate = (uint32_t)((SID_RADIO_SUBGHZ_XTAL_FREQ << 5) / params->bit_rate);
        uint32_t fdev;

        SID_RADIO_FREQ_HZ_TO_PLL_STEP(params->freq_dev, fdev);

        buf[0] = (uint8_t)(bitrate >> 16);
        buf[1] = (uint8_t)(bitrate >>  8);
        buf[2] = (uint8_t)(bitrate >>  0);

        buf[3] = (uint8_t)(params->shaping);

        buf[4] = params->bandwidth;

        buf[5] = (uint8_t)(fdev >> 16);
        buf[6] = (uint8_t)(fdev >>  8);
        buf[7] = (uint8_t)(fdev >>  0);

        hal_err = HAL_SUBGHZ_ExecSetCmd(&hsubghz, RADIO_SET_MODULATIONPARAMS, buf, sizeof(buf));
        if (hal_err != HAL_OK)
        {
            SID_PAL_LOG_ERROR("Failed to execute SubGHz cmd. Cmd: 0x%02X, HAL_SUBGHZ err: 0x%x", RADIO_SET_MODULATIONPARAMS, hal_err);
            err = SID_RADIO_ERROR_HARDWARE;
            break;
        }

        /* WORKAROUND - Modulation Quality with 500 kHz LoRa Bandwidth, see DS_SX1261-2_V1.2 datasheet chapter 15.1 */
        err = _sid_radio_tx_modulation_workaround(STM32WLxx_PKT_TYPE_GFSK, 0u);
        if (err != SID_RADIO_ERROR_NONE)
        {
            break;
        }
        /* WORKAROUND END */

        err = SID_RADIO_ERROR_NONE;
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_set_irq_mask(uint16_t irq_mask)
{
    return _sid_radio_set_dio_irq_params(irq_mask, irq_mask, IRQ_RADIO_NONE, IRQ_RADIO_NONE);
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline uint32_t _sid_radio_get_fsk_crc_len_in_bytes(const stm32wlxx_gfsk_crc_types_t crc_type)
{
    uint32_t crc_len_bytes;

    switch (crc_type)
    {
        case STM32WLxx_GFSK_CRC_1_BYTE:
        case STM32WLxx_GFSK_CRC_1_BYTE_INV:
            crc_len_bytes = 1u;
            break;

        case STM32WLxx_GFSK_CRC_2_BYTES:
        case STM32WLxx_GFSK_CRC_2_BYTES_INV:
            crc_len_bytes = 2u;
            break;

        case STM32WLxx_GFSK_CRC_OFF:
        default:
            crc_len_bytes = 0u;
            break;
    }

    return crc_len_bytes;
}

