TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/common/stm32wl55x_radio/Sidewalk/sid_radio.c
/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline uint32_t _sid_radio_get_fsk_time_on_air_ms(const stm32wlxx_radio_fsk_phy_mod_params_t * const mod_params, const stm32wlxx_pal_radio_fsk_pkt_params_t * const  packet_params, uint32_t packet_len)
{
    uint32_t time_on_air_ms;
    uint32_t numerator = (packet_params->preamble_length + (STM32WLxx_GFSK_PKT_VAR_LEN == packet_params->header_type ? 8u : 0u) + packet_params->sync_word_length
                          + ((packet_params->payload_length + (STM32WLxx_GFSK_ADDR_CMP_FILT_OFF == packet_params->addr_comp ? 0u : 1u) + _sid_radio_get_fsk_crc_len_in_bytes(packet_params->crc_type)) << 3)
                         ) * 1000u;
    uint32_t denominator = mod_params->bit_rate;

    time_on_air_ms = (numerator + denominator - 1u) / denominator;

    return time_on_air_ms;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_fsk_process_sync_word_detected(uint8_t * const rx_storage, const uint32_t rx_completed)
{
    sid_radio_error_t            err = SID_RADIO_ERROR_GENERIC;
    HAL_StatusTypeDef            hal_err;
    stm32wlxx_rx_buffer_status_t rx_buffer_status;

    /* Block any interrupts since the reaction time here is critical */
    UTILS_ENTER_CRITICAL_SECTION();
    do
    {
        /* Wait for FSK Header reception */
        uint8_t rx_available_len;

        /* FSK modem has no 802.15.4 packet engine - wait till the 2-byte header is received and parse it here to reconfigure the radio */
        if (FALSE == rx_completed)
        {
            /* Rx is still ongoing, let's modify Rx length on the fly */
            uint32_t start_s, start_us;
            uint32_t elapsed_time_us;
            const uint32_t timeout_us = (1000u * _sid_radio_get_fsk_time_on_air_ms(&WL55_cfg.fsk_cfg.mod, &WL55_cfg.fsk_cfg.pkt, STM32WLxx_RADIO_COMM_FSK_PHY_HEADER_LENGTH)) * 2u;

            start_s = TIMER_IF_GetTimeUs(&start_us);

            do
            {
                /* Readout current Rx position from the radio */
                hal_err = HAL_SUBGHZ_ReadRegisters(&hsubghz, SUBGHZ_RXADRPTR, &rx_available_len, sizeof(rx_available_len));

                /* Compute the elapsed time */
                uint32_t now_s, now_us;
                now_s = TIMER_IF_GetTimeUs(&now_us);
                elapsed_time_us = ((now_s - start_s /* Intentional underflow */) * 1000000u) + (now_us - start_us /* Intentional underflow */);
            } while ((HAL_OK == hal_err) && (rx_available_len < STM32WLxx_RADIO_COMM_FSK_PHY_HEADER_LENGTH) && (elapsed_time_us <= timeout_us));

            if (hal_err != HAL_OK)
            {
                SID_PAL_LOG_ERROR("Failed to read SubGHz reg. Reg: 0x%04X, HAL_SUBGHZ err: 0x%x", SUBGHZ_RXADRPTR, hal_err);
                err = SID_RADIO_ERROR_HARDWARE;
                break;
            }
            else if (elapsed_time_us > timeout_us)
            {
                /* Failed to receive header in time, terminating */
                err = SID_RADIO_ERROR_TIMEOUT;
                break;
            }
            else
            {
                /* All good, proceed with processing */
            }
        }

        /* 802.15.4 header received - read it out */
#if HALO_ENABLE_DIAGNOSTICS
        /* Continuous Rx is enabled in diagnostics mode, meaning buffer start pointer may move - we have to read it out */
        err = _sid_radio_subghz_get_rx_buffer_status(&rx_buffer_status);
        if (err != SID_RADIO_ERROR_NONE)
        {
            break;
        }
#  else
        /* In the normal mode only the single Rx operations are allowed, meaning the Rx buffer start pointer is fixed and ther's no need to waste time on reading it out */
        rx_buffer_status.buffer_start_pointer = SID_RADIO_RX_BUFFER_BASE_OFFSET;
#  endif /* HALO_ENABLE_DIAGNOSTICS */

        /* Readout FSK packet header from the SubGHz buffer */
        hal_err = HAL_SUBGHZ_ReadBuffer(&hsubghz, rx_buffer_status.buffer_start_pointer, rx_storage, STM32WLxx_RADIO_COMM_FSK_PHY_HEADER_LENGTH);
        if (hal_err != HAL_OK)
        {
            SID_PAL_LOG_ERROR("Failed to read %u bytes from SubGHz buffer. HAL_SUBGHZ err: 0x%x", STM32WLxx_RADIO_COMM_FSK_PHY_HEADER_LENGTH, hal_err);
            err = SID_RADIO_ERROR_HARDWARE;
            break;
        }

        /* Calculate expected payload len from header */
        uint8_t expected_rx_len = (uint8_t)(rx_storage[SID_RADIO_FSK_PACKET_LENGTH_OFFSET] + STM32WLxx_RADIO_COMM_FSK_PHY_HEADER_LENGTH);

        /* Update the payload len to be received */
        if (FALSE == rx_completed)
        {
            hal_err = HAL_SUBGHZ_WriteRegisters(&hsubghz, SUBGHZ_GRTXPLDLEN, &expected_rx_len, sizeof(expected_rx_len));
            if (hal_err != HAL_OK)
            {
                SID_PAL_LOG_ERROR("Failed to write SubGHz reg. Reg: 0x%04X, HAL_SUBGHZ err: 0x%x", SUBGHZ_GRTXPLDLEN, hal_err);
                err = SID_RADIO_ERROR_HARDWARE;
                break;
            }
        }

        /* Ensure the Rx packet size is updated ASAP */
        __COMPILER_BARRIER();

        /* Now it is safe to proceed with local arrangements, FSK modem is reconfigured */

        /* Set validity markers */
        uint32_t * const validity_marker_ptr = (uint32_t *)(void *)&rx_storage[SID_RADIO_FSK_SYNC_WORD_VALID_MARKER_OFFSET];
        *validity_marker_ptr                 = SID_RADIO_FSK_SYNC_WORD_VALID_MARKER;

        err = SID_RADIO_ERROR_NONE;
    } while(0);
    UTILS_EXIT_CRITICAL_SECTION();

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_enable_default_irqs(void)
{
    sid_radio_error_t err;

    err = _sid_radio_set_dio_irq_params(WL55_cfg.drv_cfg.irq_mask, WL55_cfg.drv_cfg.irq_mask, STM32WLxx_SUBGHZ_IRQ_NONE, STM32WLxx_SUBGHZ_IRQ_NONE);
    if (err != SID_RADIO_ERROR_NONE)
    {
        SID_RADIO_LOG_ERROR("Failed to restore the deffault SubGHz IRQ mask after processing IRQ. Error %u", (uint32_t)err);
    }

