TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/common/stm32wl55x_radio/Sidewalk/sid_radio.c
    return err;
}

/*----------------------------------------------------------------------------*/

/**
 * @brief Sets modem to FSK mode
 *
 * @returns Non-zero value in case of error
 */
SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_set_modem_to_fsk(void)
{
    sid_radio_error_t err = SID_RADIO_ERROR_GENERIC;

    do
    {
        err = _sid_radio_set_pkt_type(PACKET_TYPE_GFSK);
        if (err != SID_RADIO_ERROR_NONE)
        {
            SID_RADIO_LOG_ERROR("Failed to set SubGHz paket type to FSK. Error %u", (uint32_t)err);
            break;
        }

        current_modem_mode = STM32WLxx_SUBGHZ_RADIO_MODEM_MODE_FSK;
        WL55_cfg.drv_cfg.irq_mask = STM32WLxx_RADIO_COMM_DEFAULT_FSK_IRQ_MASK;
        SID_RADIO_LOG_DEBUG("_sid_radio_set_modem_to_fsk: setting IRQ mask 0x%x", WL55_cfg.drv_cfg.irq_mask);

        err = _sid_radio_enable_default_irqs();
        if (err != SID_RADIO_ERROR_NONE)
        {
            /* Logs are provided by _sid_radio_enable_default_irqs() */
            break;
        }

        err = _sid_radio_subghz_set_gfsk_sync_word(WL55_cfg.fsk_cfg.sync_word, WL55_cfg.fsk_cfg.sync_word_len);
        if (err != SID_RADIO_ERROR_NONE)
        {
            /* Logs are provided by _sid_radio_subghz_set_gfsk_sync_word() */
            break;
        }

        err = _sid_radio_subghz_set_gfsk_mod_params(&WL55_cfg.fsk_cfg.mod);
        if (err != SID_RADIO_ERROR_NONE)
        {
            /* Logs are provided by _sid_radio_subghz_set_gfsk_mod_params() */
            break;
        }

        err = _sid_radio_subghz_set_gfsk_pkt_params(&WL55_cfg.fsk_cfg.pkt);
        if (err != SID_RADIO_ERROR_NONE)
        {
            break;
        }

        err = SID_RADIO_ERROR_NONE;
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

/**
 * @brief Sets modem to LoRa mode
 *
 * @returns Non-zero value in case of error
 */
SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_set_modem_to_lora(void)
{
    sid_radio_error_t err = SID_RADIO_ERROR_GENERIC;

    do
    {
        err = _sid_radio_set_pkt_type(PACKET_TYPE_LORA);
        if (err != SID_RADIO_ERROR_NONE)
        {
            SID_RADIO_LOG_ERROR("Failed to set SubGHz paket type to LoRa. Error %u", (uint32_t)err);
            break;
        }

        current_modem_mode = STM32WLxx_SUBGHZ_RADIO_MODEM_MODE_LORA;
        WL55_cfg.drv_cfg.irq_mask = STM32WLxx_RADIO_COMM_DEFAULT_LORA_IRQ_MASK;
        SID_RADIO_LOG_DEBUG("_sid_radio_set_modem_to_lora: setting IRQ mask 0x%x", WL55_cfg.drv_cfg.irq_mask);

        err = _sid_radio_enable_default_irqs();
        if (err != SID_RADIO_ERROR_NONE)
        {
            /* Logs are provided by _sid_radio_enable_default_irqs() */
            break;
        }

        err = _sid_radio_subghz_set_lora_sync_word(WL55_cfg.lora_cfg.sync_word);
        if (err != SID_RADIO_ERROR_NONE)
        {
            /* Logs are provided by _sid_radio_subghz_set_lora_sync_word() */
            break;
        }

        err = _sid_radio_subghz_set_lora_mod_params(&WL55_cfg.lora_cfg.mod);
        if (err != SID_RADIO_ERROR_NONE)
        {
            /* Logs are provided by _sid_radio_subghz_set_lora_mod_params() */
            break;
        }

        err = _sid_radio_subghz_set_lora_pkt_params(&WL55_cfg.lora_cfg.pkt);
        if (err != SID_RADIO_ERROR_NONE)
        {
            /* Logs are provided by _sid_radio_subghz_set_lora_pkt_params() */
            break;
        }

        //FIXME: set CAD params

         err = _sid_radio_subghz_set_lora_symb_nb_timeout(WL55_cfg.lora_cfg.symbol_timeout);
        if (err != SID_RADIO_ERROR_NONE)
        {
            /* Logs are provided by _sid_radio_subghz_set_lora_symb_nb_timeout() */
            break;
        }

        err = SID_RADIO_ERROR_NONE;
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline uint8_t _sid_radio_lora_low_data_rate_optimize(const stm32wlxx_lora_sf_t sf, const stm32wlxx_lora_bw_t bw)
{
    if (((bw == STM32WLxx_LORA_BW_125) && ((sf == STM32WLxx_LORA_SF11) || (sf == STM32WLxx_LORA_SF12)))
        || ((bw == STM32WLxx_LORA_BW_250) && (sf == STM32WLxx_LORA_SF12)))
    {
        return 1u; /* Low data rates optimizations shall be on */
    }
    else
    {
        return 0u; /* Low data rate optimizations are not required */
    }
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline void _sid_radio_convert_to_phy_lora_mod_params(stm32wlxx_mod_params_lora_t * const sx_m, const stm32wlxx_radio_lora_phy_mod_params_t * const in_mod_params)
{
    sx_m->sf   = (stm32wlxx_lora_sf_t)in_mod_params->spreading_factor;
    sx_m->bw   = (stm32wlxx_lora_bw_t)in_mod_params->bandwidth;
    sx_m->ldro = _sid_radio_lora_low_data_rate_optimize(sx_m->sf, sx_m->bw);

    /* unfortunately long interleaved mode is not supported by STM32WLxx, so changing it to modes without LI */
    switch (in_mod_params->coding_rate)
    {
        case STM32WLxx_LORA_CR_4_5:
        case STM32WLxx_LORA_CR_4_5_LI:
            sx_m->cr = STM32WLxx_LORA_CR_4_5;
            break;

        case STM32WLxx_LORA_CR_4_6:
        case STM32WLxx_LORA_CR_4_6_LI:
            sx_m->cr = STM32WLxx_LORA_CR_4_6;
            break;

        case STM32WLxx_LORA_CR_4_7:
            sx_m->cr = STM32WLxx_LORA_CR_4_7;
            break;

        case STM32WLxx_LORA_CR_4_8:
        case STM32WLxx_LORA_CR_4_8_LI:
            sx_m->cr = STM32WLxx_LORA_CR_4_8;
            break;

        default:
            SID_PAL_LOG_ERROR("_sid_radio_convert_to_phy_lora_mod_params: coding rate selector is not supported, requested CR is 0x%x", (uint32_t)in_mod_params->coding_rate);
            break;
    }
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline RBI_Switch_TypeDef _sid_radio_rbi_get_pa_selector(const uint32_t request_hpa)
{
    RBI_Switch_TypeDef pa_select;

