TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/common/stm32wl55x_radio/Sidewalk/sid_radio.c
    int32_t tx_config = RBI_GetTxConfig(); /* Get board capabilities */

    switch (tx_config)
    {
        case RBI_CONF_RFO_LP_HP:
            /* Board provides both external power amp and direct antenna connection - use the one that is requested */
            pa_select = (request_hpa != FALSE) ? RBI_SWITCH_RFO_HP : RBI_SWITCH_RFO_LP;
            break;

        case RBI_CONF_RFO_LP:
            /* The board has only a direct antenna connection */
            if (request_hpa != FALSE)
            {
                SID_PAL_LOG_ERROR("Requesting HPA for SubGHz Tx, but the board does not support it");
                pa_select = RBI_SWITCH_OFF;
            }
            else
            {
                pa_select = RBI_SWITCH_RFO_LP;
            }
            break;

        case RBI_CONF_RFO_HP:
            if (FALSE == request_hpa)
            {
                SID_PAL_LOG_ERROR("Requesting LPA for SubGHz Tx, but the board does not support it");
                pa_select = RBI_SWITCH_OFF;
            }
            else
            {
                pa_select = RBI_SWITCH_RFO_HP;
            }
            break;

        default:
            SID_PAL_LOG_ERROR("Unknown SubGHz RBI Tx capabilities (0x%X)");
            pa_select = RBI_SWITCH_OFF;
            break;
    }

    return pa_select;
}

/*----------------------------------------------------------------------------*/

/**
 * @brief Set Radio Mode
 *
 * @param [in] frontend_mode Desired radio frontend mode (e.g. Tx, Rx, Off)
 * @return     Non-zero value in case of error
 */
SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_subghz_set_radio_mode(const stm32wlxx_subghz_fe_mode_t frontend_mode)
{
    sid_radio_error_t  err;
    RBI_Switch_TypeDef rbi_switch_cfg;
    uint8_t smps_drive_lvl = SMPS_DRIVE_SETTING_DEFAULT;

    do
    {
        switch (frontend_mode)
        {
            case STM32WLxx_RADIO_FRONTEND_MODE_OFF:
                rbi_switch_cfg = RBI_SWITCH_OFF;
                break;

            case STM32WLxx_RADIO_FRONTEND_MODE_TX:
                if (SID_RADIO_SUBGHZ_PA_SEL_HPA == WL55_cfg.pa_cfg.device_sel)
                {
                    rbi_switch_cfg = RBI_SWITCH_RFO_HP;
                }
                else
                {
                    rbi_switch_cfg = RBI_SWITCH_RFO_LP;

                    /* If SMPS is used we need to increase its output power since LPA draws current from SMPS */
                    smps_drive_lvl = SMPS_DRIVE_SETTING_MAX;
                }
                break;

            case STM32WLxx_RADIO_FRONTEND_MODE_RX:
                rbi_switch_cfg = RBI_SWITCH_RX;
                break;

            default:
                SID_PAL_LOG_ERROR("Invalid FEM mode: %u", (uint32_t)frontend_mode);
                return SID_RADIO_ERROR_INVALID_ARGS;
        }

        /* Adjust SMPS settings if it is used */
        if (RBI_IsDCDC() != FALSE)
        {
            err = _sid_radio_smps_set(smps_drive_lvl);
            if (err != SID_RADIO_ERROR_NONE)
            {
                SID_RADIO_LOG_ERROR("Failed to set SMPS current drive to 0x%02X. Error %u", smps_drive_lvl, (uint32_t)err);
                break;
            }
        }

        /* Apply antenna switch config */
        const int32_t rbi_err = RBI_ConfigRFSwitch(rbi_switch_cfg);
        if (rbi_err != 0u)
        {
            SID_PAL_LOG_ERROR("Failed to configure SubGHz antenna switch. RBI error %d, switch cfg: %u", rbi_err, rbi_switch_cfg);
            err = SID_RADIO_ERROR_HARDWARE;
            break;
        }

        err = SID_RADIO_ERROR_NONE;
    } while (0);

    if (err != SID_RADIO_ERROR_NONE)
    {
        SID_PAL_LOG_ERROR("Failed to set SubGHz radio mode. Error %u", (uint32_t)err);
    }

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_subghz_sleep(const uint32_t sleep_duration_us)
{
    sid_radio_error_t err = SID_RADIO_ERROR_GENERIC;
    stm32wlxx_subghz_sleep_params_t sleep_cfg = {
        .raw = 0x00u,
    };
#if STM32WLXX_EXT_IFC_ENABLE_USER_DATA_TRANSFER
    sid_radio_error_t udt_err;
#endif /* STM32WLXX_EXT_IFC_ENABLE_USER_DATA_TRANSFER */

    do
    {
        /* Immediately stop software timer for Tx/Rx/CS/CAD timeout */
        (void)UTIL_TIMER_Stop(&radio_timeout_mon);
        __COMPILER_BARRIER();

        if (SID_PAL_RADIO_SLEEP == current_radio_state)
        {
            /* Already in Sleep, no actions required */
            err = SID_RADIO_ERROR_NONE;

#if STM32WLXX_EXT_IFC_ENABLE_USER_DATA_TRANSFER
            /* Reconfigure the UDT cut-off time based on the new expected sleep duration */
            udt_err = _sid_radio_udt_setup_session(sleep_duration_us);
            if (udt_err != SID_RADIO_ERROR_NONE)
            {
                /* UDT failure is not critical for Sidewalk operations - just inform about it and proceed normally */
                SID_PAL_LOG_WARNING("Failed to reconfigure UDT. Error %u", (uint32_t)udt_err);
            }
#endif /* STM32WLXX_EXT_IFC_ENABLE_USER_DATA_TRANSFER */

            break;
        }

        /* Sleep can be entered from the Standby states only, so ensure the radio is Standby.
         * This will also cancel any ongoing Tx/Rx operations, turn off the FEM, and configure SMPS to lower the power consumption.
         */
        err = _sid_radio_subghz_standby();
        if (err != SID_RADIO_ERROR_NONE)
        {
            SID_RADIO_LOG_ERROR("SubGHz radio Sleep failed, radio unable to enter Standby. Error %u", (uint32_t)err);
            break;
        }

        /* Configure the desired Sleep parameters - enable register retention for shorter wakeup time */
        sleep_cfg.sleep_type = STM32WLxx_RADIO_SLEEP_WARM_START;

        err = _sid_radio_subghz_set_sleep(sleep_cfg);
        if (err != SID_RADIO_ERROR_NONE)
        {
            SID_RADIO_LOG_ERROR("SubGHz Sleep request failed. Unable to send Sleep command to SubGHz. Error %u", (uint32_t)err);
            current_radio_state = SID_PAL_RADIO_UNKNOWN;
            break;
        }

