TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/common/stm32wl55x_radio/Sidewalk/sid_radio.c
        /* IMPORTANT: do not enable LPM here since radio sleep request may need to be acknowledged */

        current_radio_state = SID_PAL_RADIO_SLEEP;
        err = SID_RADIO_ERROR_NONE;

#if STM32WLXX_EXT_IFC_ENABLE_USER_DATA_TRANSFER
        udt_err = _sid_radio_udt_setup_session(sleep_duration_us);
        if (udt_err != SID_RADIO_ERROR_NONE)
        {
            /* UDT failure is not critical for Sidewalk operations - just inform about it and proceed normally */
            SID_PAL_LOG_WARNING("Failed to enable UDT. Error %u", (uint32_t)udt_err);
        }
#else
        (void)sleep_duration_us;
#endif /* STM32WLXX_EXT_IFC_ENABLE_USER_DATA_TRANSFER */
    } while (0);

    SID_RADIO_LOG_DEBUG("_sid_radio_subghz_sleep - done");

    return err;
}

/*----------------------------------------------------------------------------*/

/**
 * @brief Switch radio and SW to standby state
 *
 * @return Non-zero value in case of error
 */
SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_subghz_standby(void)
{
    sid_radio_error_t err = SID_RADIO_ERROR_GENERIC;

    do
    {
        /* Immediately stop software timer for Tx/Rx/CS/CAD timeout */
        (void)UTIL_TIMER_Stop(&radio_timeout_mon);
        __COMPILER_BARRIER();

#if defined (LOW_POWER_DISABLE) && (LOW_POWER_DISABLE == 0)
        /* Prohibit the system to enter Stop mode since SubGHz events should be processed ASAP from this point */
        (void)UTIL_TIMER_Stop(&lpm_suspend_timer);
        __COMPILER_BARRIER(); /* Esnure the timer is always processed before the UTIL_LPM_Set<X>Mode() calls */

        UTIL_LPM_SetStopMode((1u << CFG_LPM_HOST_COMM_RADIO), UTIL_LPM_DISABLE);
        UTIL_LPM_SetOffMode((1u << CFG_LPM_HOST_COMM_RADIO), UTIL_LPM_DISABLE);
#endif /* LOW_POWER_DISABLE */

#if STM32WLXX_EXT_IFC_ENABLE_USER_DATA_TRANSFER
        udt_ctx.udt_enabled = FALSE;
#endif /* STM32WLXX_EXT_IFC_ENABLE_USER_DATA_TRANSFER */

        if (SID_PAL_RADIO_STANDBY == current_radio_state)
        {
            /* Already in StandBy, no actions required */
            err = SID_RADIO_ERROR_NONE;
            break;
        }

        if ((SID_PAL_RADIO_SLEEP == current_radio_state) || (SID_PAL_RADIO_UNKNOWN == current_radio_state))
        {
            err = _sid_radio_subghz_wakeup(SID_RADIO_SUBGHZ_WAIT_FOR_WAKEUP_TIMEOUT_MS);
            if (err != SID_RADIO_ERROR_NONE)
            {
                SID_RADIO_LOG_ERROR("SubGHz Standby request failed. Unable to wake up SubGHz peripheral. Error %u", (uint32_t)err);
                current_radio_state = SID_PAL_RADIO_UNKNOWN;
                break;
            }

            /* Restore Rx Gain configuration since it is not part of the retained memory */
            err = _sid_radio_cfg_rx_boosted(WL55_cfg.drv_cfg.rx_boost);
            if (err != SID_RADIO_ERROR_NONE)
            {
                SID_RADIO_LOG_ERROR("Failed to set SubGHz Rx boost. Error %u", (uint32_t)err);
                current_radio_state = SID_PAL_RADIO_UNKNOWN;
                break;
            }
        }

        err = _sid_radio_subghz_set_radio_mode(STM32WLxx_RADIO_FRONTEND_MODE_OFF);
        if (err != SID_RADIO_ERROR_NONE)
        {
            break;
        }

        /* Use STDBY_XOSC as Standby-to-Tx/Rx transition time is critical for FSK */
        err = _sid_radio_subghz_set_standby(STDBY_XOSC);
        if (err != SID_RADIO_ERROR_NONE)
        {
            SID_RADIO_LOG_ERROR("SubGHz Standby request failed. Unable to send Standby command to SubGHz. Error %u", (uint32_t)err);
            current_radio_state = SID_PAL_RADIO_UNKNOWN;
            break;
        }
        sid_pal_delay_us(STM32WLxx_SUBGHZ_STDBY_STATE_DELAY_US);

        current_radio_state = SID_PAL_RADIO_STANDBY;
        err = SID_RADIO_ERROR_NONE;
    } while (0);

    SID_RADIO_LOG_DEBUG("_sid_radio_subghz_standby - done");

    return err;
}

/*----------------------------------------------------------------------------*/

/** @brief Set the radio transmit power.
 *
 * @param[in] power tx power in dB
 * @return    Non-zero value in case of error
 */
SID_STM32_SPEED_OPTIMIZED static sid_radio_error_t _sid_radio_set_tx_power(const stm32wlxx_radio_pa_setup_t * const new_pa_cfg)
{
    sid_radio_error_t err = SID_RADIO_ERROR_GENERIC;
    HAL_StatusTypeDef hal_err;

    do
    {
        /** Always send out PA config even if there's no change. Since dynamic Tx power adjustment was introduced in Sidewalk, Tx power updates may be frequent
         *  and we need to ensure RF timings consistency. To achieve this, it's better to always apply the PA config and account for SUBGHZ communication delay
         *  on every Tx, rather than dealing with the jitter caused by occasional PA config updates.
         */
        if (current_radio_state != SID_PAL_RADIO_STANDBY)
        {
            err = SID_RADIO_ERROR_INVALID_STATE;
            break;
        }

        err = _sid_radio_set_pa_cfg(new_pa_cfg);
        if (err != SID_RADIO_ERROR_NONE)
        {
            SID_RADIO_LOG_ERROR("Failed to set SubGHz PA config. Error %u", (uint32_t)err);
            break;
        }

        uint8_t ocp_reg = (SID_RADIO_SUBGHZ_PA_SEL_HPA == new_pa_cfg->device_sel) ? STM32WLxx_SUBGHZ_REG_OCP_HPA_VAL : STM32WLxx_SUBGHZ_REG_OCP_LPA_VAL;
        hal_err = HAL_SUBGHZ_WriteRegisters(&hsubghz, REG_OCP, &ocp_reg, sizeof(ocp_reg));
        if (hal_err != HAL_OK)
        {
            SID_PAL_LOG_ERROR("Failed to write SubGHz reg. Reg: 0x%04X, HAL_SUBGHZ err: 0x%x", REG_OCP, hal_err);
            err = SID_RADIO_ERROR_HARDWARE;
            break;
        }

#if STM32WLxx_SUBGHZ_TXPWR_WORKAROUND
        {
            uint8_t ovp_reg;

            hal_err = HAL_SUBGHZ_ReadRegisters(&hsubghz, STM32WLxx_SUBGHZ_REG_OVP, &ovp_reg, sizeof(ovp_reg));
            if (hal_err != HAL_OK)
            {
                SID_PAL_LOG_ERROR("Failed to read SubGHz reg. Reg: 0x%04X, HAL_SUBGHZ err: 0x%x", STM32WLxx_SUBGHZ_REG_OVP, hal_err);
                err = SID_RADIO_ERROR_HARDWARE;
                break;
            }

            ovp_reg &= 0xF9u; /* Set bits 1 and 2 to 0 */

            hal_err = HAL_SUBGHZ_WriteRegisters(&hsubghz, STM32WLxx_SUBGHZ_REG_OVP, &ovp_reg, sizeof(ovp_reg));
            if (hal_err != HAL_OK)
            {
                SID_PAL_LOG_ERROR("Failed to write SubGHz reg. Reg: 0x%04X, HAL_SUBGHZ err: 0x%x", STM32WLxx_SUBGHZ_REG_OVP, hal_err);
                err = SID_RADIO_ERROR_HARDWARE;
                break;
            }
        }
#endif /* STM32WLxx_SUBGHZ_TXPWR_WORKAROUND */

        err = _sid_radio_set_tx_params(new_pa_cfg);
        if (err != SID_RADIO_ERROR_NONE)
        {
            SID_RADIO_LOG_ERROR("Failed to set SubGHz Tx params. Error %u", (uint32_t)err);
            break;
        }

