TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/common/stm32wl55x_radio/Sidewalk/sid_radio.c
        const uint32_t cfg_memcmp = SID_STM32_UTIL_fast_memcmp(new_pa_cfg, &WL55_cfg.pa_cfg, sizeof(*new_pa_cfg));
        if ((new_pa_cfg != &WL55_cfg.pa_cfg) && (cfg_memcmp != 0u))
        {
            /* Store the applied settings if they were changed */
            SID_STM32_UTIL_fast_memcpy(&WL55_cfg.pa_cfg, new_pa_cfg, sizeof(WL55_cfg.pa_cfg));
        }
        if ((cfg_memcmp != 0u) || (new_pa_cfg == &WL55_cfg.pa_cfg))
        {
            /* Print out logs whenever PA config is either updated or restored from driver config */
            SID_PAL_LOG_INFO("SubGHz Tx power set to %s%ddB", WL55_cfg.pa_cfg.target_tx_power > 0 ? "+" : "", WL55_cfg.pa_cfg.target_tx_power); /* tiny_vsnprintf() may not support %+d */
        }

        err = SID_RADIO_ERROR_NONE;
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

/** @brief Set radio modem mode.
 *
 *  The driver should configure all the parameters
 *  to operate in the desired mode.
 *  Supported modem modes are LoRa and FSK
 *
 *  @param[in]   mode LoRa = 2 or FSK = 1
 *
 *  @return true in case of error
 */
SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_set_modem_mode(const stm32wlxx_rcp_set_modem_mode_req_t * const request)
{
    sid_radio_error_t err;
    const stm32wlxx_pal_radio_modem_mode_t desired_mode = (stm32wlxx_pal_radio_modem_mode_t)request->mode;
    const char * mode_str;

    do
    {
        if (desired_mode == current_modem_mode)
        {
            SID_RADIO_LOG_DEBUG("Set Modem Mode skipped - already in requested mode");
            err = SID_RADIO_ERROR_NONE;
            break;
        }

        if (FALSE == valid_subghz_cfg_received)
        {
            SID_PAL_LOG_WARNING("Attempt to set modem mode before SubGHz config is sent");
            err = SID_RADIO_ERROR_INVALID_STATE;
            break;
        }

        switch(desired_mode)
        {
            case STM32WLxx_SUBGHZ_RADIO_MODEM_MODE_LORA:
                err = _sid_radio_set_modem_to_lora();
                mode_str = "LoRa";
                break;

            case STM32WLxx_SUBGHZ_RADIO_MODEM_MODE_FSK:
                err = _sid_radio_set_modem_to_fsk();
                mode_str = "FSK";
                break;

            case STM32WLxx_SUBGHZ_RADIO_MODEM_MODE_UNDEFINED:
                /* Can get into this mode after a reset, but cannot set it explicitly upon request */
                err = SID_RADIO_ERROR_INVALID_ARGS;
                mode_str = "Undefined";
                break;

            default:
                err = SID_RADIO_ERROR_UNEXPECTED_DATA;
                SID_PAL_LOG_ERROR("Failed to set SubGHz modem mode. Unknown mode requersted (0x%x)", (uint32_t)desired_mode);
                mode_str = "unknown";
                break;
        }

        if (SID_RADIO_ERROR_NONE == err)
        {
            SID_PAL_LOG_INFO("SubGHz radio modem set to %s mode", mode_str);
        }
        else
        {
            SID_PAL_LOG_ERROR("Failed to set SubGHz radio modem to %s mode. Error: %u", mode_str, (uint32_t)err);
            break;
        }
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_subghz_get_payload(uint8_t * const buffer, const uint32_t buf_size, uint32_t * const actual_size)
{
    sid_radio_error_t            err = SID_RADIO_ERROR_GENERIC;
    HAL_StatusTypeDef            hal_err;
    stm32wlxx_rx_buffer_status_t rx_buffer_status;

    assert_param(buffer != NULL);
    assert_param(actual_size != NULL);

    do
    {
        *actual_size = 0u;

        /* Readout Rx packet status from SubGHz */
        err = _sid_radio_subghz_get_rx_buffer_status(&rx_buffer_status);
        if (err != SID_RADIO_ERROR_NONE)
        {
            break;
        }

        /* Workaround for sporadic invalid GetRxBufferStatus reports */
        uint32_t buffer_status_retry_counter = 0u;
        while ((0u == rx_buffer_status.pld_len_in_bytes) && (buffer_status_retry_counter < SID_RADIO_LORA_GET_RX_BUFFER_STATUS_RETRIES))
        {
            /* Readout Rx packet status from SX126x again to address internal race condition */
            err = _sid_radio_subghz_get_rx_buffer_status(&rx_buffer_status);
            if (err != SID_RADIO_ERROR_NONE)
            {
                break;
            }

            /* Increment retry counter on successful read */
            buffer_status_retry_counter++;
        }
        if (err != SID_RADIO_ERROR_NONE)
        {
            /* Terminate if a fatal error occurred while fetching Rx buffer status */
            break;
        }
        /* Proceed even if the retry limit is reached and the reported packet length is still zero - the generic packet length check below will react on that */

        /* Validate reported packet length */
        if ((0u == rx_buffer_status.pld_len_in_bytes) || (rx_buffer_status.pld_len_in_bytes > buf_size))
        {
            err = SID_RADIO_ERROR_WRONG_SIZE;
            break;
        }

        /* Read out received data from SubGHz */
        hal_err = HAL_SUBGHZ_ReadBuffer(&hsubghz, rx_buffer_status.buffer_start_pointer, buffer, rx_buffer_status.pld_len_in_bytes);
        if (hal_err != HAL_OK)
        {
            SID_PAL_LOG_ERROR("Failed to read %u bytes from SubGHz buffer. HAL_SUBGHZ err: 0x%x", rx_buffer_status.pld_len_in_bytes, hal_err);
            err = SID_RADIO_ERROR_HARDWARE;
            break;
        }

        *actual_size = (uint32_t)rx_buffer_status.pld_len_in_bytes;

        err = SID_RADIO_ERROR_NONE;
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_lora_process_rx_done(stm32wlxx_rcp_lora_rx_packet_info_t * const lora_rx_packet_status, uint8_t * const rx_storage, const uint32_t rx_storage_size, uint32_t * const out_received_len)
{
    sid_radio_error_t err = SID_RADIO_ERROR_GENERIC;
    HAL_StatusTypeDef hal_err;

    do
    {
        /* Read out received payload from SubGHz's internal RAM buffer */
        err = _sid_radio_subghz_get_payload(rx_storage, rx_storage_size, out_received_len);
        if (err != SID_RADIO_ERROR_NONE)
        {
            SID_PAL_LOG_ERROR("Failed to read SubGHz internal RAM buffer. Error %u", (uint32_t)err);
            break;
        }

        /* Collect LoRa packet info */
        err = _sid_radio_subghz_get_lora_pkt_status(lora_rx_packet_status);
        if (err != SID_RADIO_ERROR_NONE)
        {
            SID_PAL_LOG_ERROR("Failed to read SubGHz LoRa packet status. Error %u", (uint32_t)err);
            break;
        }

        /* Determine CRC status */
        uint8_t buffer_header_crc;
        hal_err = HAL_SUBGHZ_ReadRegisters(&hsubghz, STM32WL55xx_SUBGHZ_REG_LR_HEADER_CRC, &buffer_header_crc, sizeof(buffer_header_crc));
        if (HAL_OK != hal_err)
        {
            lora_rx_packet_status->is_crc_present = STM32WLxx_PAL_RADIO_CRC_PRESENT_INVALID;
            SID_PAL_LOG_ERROR("Failed to read SubGHz LoRa header CRC status. Hal error 0x%x", (uint32_t)hal_err);
            if (HAL_BUSY == hal_err)
            {
                err = SID_RADIO_ERROR_RESOURCE_BUSY;
            }
            else
            {
                err = SID_RADIO_ERROR_HARDWARE;
            }
            break;
        }

