TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/common/stm32wl55x_radio/Sidewalk/sid_radio.c
        lora_rx_packet_status->is_crc_present = ((buffer_header_crc & STM32WL55xx_SUBGHZ_REG_LR_HEADER_CRC_MASK) != 0u) ? STM32WLxx_PAL_RADIO_CRC_PRESENT_ON : STM32WLxx_PAL_RADIO_CRC_PRESENT_OFF;

        err = SID_RADIO_ERROR_NONE;
    } while(0);

    return err;
}

/*----------------------------------------------------------------------------*/

/**
 * perform data whitening
 *
 * @param [in] seed             whitening seed
 * @param [in] buffer_in        pointer to the buffer that needs to be updated
 * @param [in] buffer_out       pointer to the updated buffer
 * @param [in] length           length of the buffer to perform data whitnening
 *
 */
SID_STM32_SPEED_OPTIMIZED static inline void _sid_radio_fsk_perform_data_whitening(const uint16_t seed, const uint8_t * const buffer_in, uint8_t * const buffer_out, const uint32_t length)
{
    uint16_t lfsr    = seed;
    uint16_t xor_out = 0u;
    uint8_t  ret     = 0u;
    uint8_t  result  = 0u;

    for (uint32_t index = 0u; index < length; index++)
    {
        xor_out = 0u;
        ret     = 0u;
        result  = 0u;

        xor_out  = (uint16_t)( ( lfsr >> 5 ) & 0x0Fu ) ^ ( lfsr & 0x0Fu );
        lfsr     = (uint16_t)( lfsr >> 4 ) | ( xor_out << 5 );
        ret     |= (uint8_t) ( lfsr >> 5 ) & 0x0Fu;

        xor_out  = (uint16_t)( ( lfsr >> 5 ) & 0x0F ) ^ ( lfsr & 0x0F );
        lfsr     = (uint16_t)( lfsr >> 4 ) | ( xor_out << 5 );
        ret     |= (uint8_t) ( ( lfsr >> 1 ) & 0xF0u );

        result |= (uint8_t)( ret & 0x80u ) >> 7;
        result |= (uint8_t)( ret & 0x40u ) >> 5;
        result |= (uint8_t)( ret & 0x20u ) >> 3;
        result |= (uint8_t)( ret & 0x10u ) >> 1;
        result |= (uint8_t)( ret & 0x08u ) << 1;
        result |= (uint8_t)( ret & 0x04u ) << 3;
        result |= (uint8_t)( ret & 0x02u ) << 5;
        result |= (uint8_t)( ret & 0x01u ) << 7;

        buffer_out[index] = (uint8_t)(buffer_in[index] ^ result);
    }
}

/*----------------------------------------------------------------------------*/

/**
 * compute crc16
 *
 *
 * @param [in] buffer          buffer on which crc16 needed to be calculated
 * @param [in] length          length of the buffer that is passed
 *
 * @retval status     calculated crc16 value
 */
SID_STM32_SPEED_OPTIMIZED static inline uint16_t _sid_radio_compute_crc16(const uint8_t * const buffer, const uint32_t length)
{
    if ((NULL == buffer) || (0u == length))
    {
        return 0u;
    }

    register uint16_t crc16 = 0x0000u;

    for (uint32_t index_buffer = 0u; index_buffer < length; index_buffer++)
    {
        crc16 ^= ( ( uint16_t ) buffer[index_buffer] << 8 );

        for (uint32_t i = 0u; i < 8u; i++ )
        {
            crc16 = (uint16_t)(( crc16 & 0x8000u ) ? ( crc16 << 1 ) ^ SID_RADIO_POLYNOMIAL_CRC16 : ( crc16 << 1 ));
        }
    }

    return crc16;
}

/*----------------------------------------------------------------------------*/

/**
 * compute crc32
 *
 *
 * @param [in] buffer          buffer on which crc32 needed to be calculated
 * @param [in] length          length of the buffer that is passed
 *
 * @retval status     calculated crc32 value
 */
SID_STM32_SPEED_OPTIMIZED static inline uint32_t _sid_radio_compute_crc32(const uint8_t * const buffer, const uint32_t length)
{
    if ((NULL == buffer) || (0u == length))
    {
        return 0u;
    }

    uint8_t           temp_buffer[sizeof(uint32_t)] = {0};
    register uint32_t crc32                         = 0xFFFFFFFFu;
    const uint8_t *   buffer_local;
    uint32_t          length_local;

    if (length < sizeof(uint32_t))
    {
        SID_STM32_UTIL_fast_memcpy(temp_buffer, buffer, length);
        length_local = sizeof(uint32_t);
        buffer_local = temp_buffer;
    }
    else
    {
        length_local = length;
        buffer_local = buffer;
    }

    for (uint32_t index_buffer = 0u; index_buffer < length_local; index_buffer++)
    {
        crc32 ^= ( index_buffer < length ) ? ( ( uint32_t ) buffer_local[index_buffer] << 24 ) : 0x00000000u;

        for (uint32_t i = 0u; i < 8u; i++ )
        {
            crc32 = ( crc32 & 0x80000000u ) ? ( crc32 << 1 ) ^ SID_RADIO_POLYNOMIAL_CRC32 : ( crc32 << 1 );
        }
    }

    return ~crc32;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_fsk_process_rx_done(stm32wlxx_rcp_fsk_rx_packet_info_t * const fsk_rx_packet_status, uint8_t * const rx_storage, const uint32_t rx_storage_size, uint32_t * const out_received_len, stm32wlxx_radio_fsk_rx_done_status_t * const out_fsk_rx_done_status)
{
    sid_radio_error_t            err = SID_RADIO_ERROR_GENERIC;
    stm32wlxx_pal_radio_fsk_phy_hdr_t phy_hdr;
    stm32wlxx_pkt_status_gfsk_t  pkt_status;
    uint32_t                     fsk_payload_len;
    uint32_t                     crc;
    uint32_t                     crc_length;
    stm32wlxx_rx_buffer_status_t rx_buffer_status;
    HAL_StatusTypeDef            hal_err;

    do
    {
        *out_received_len       = 0u;
        *out_fsk_rx_done_status = STM32WLxx_RADIO_FSK_RX_DONE_STATUS_UNDETERMINED;

        /* Check the validity marker to determine if the packet header is stored in the buffer already */
        uint32_t * const validity_marker_ptr = (uint32_t *)(void *)&rx_storage[SID_RADIO_FSK_SYNC_WORD_VALID_MARKER_OFFSET];
        if (SID_RADIO_FSK_SYNC_WORD_VALID_MARKER != *validity_marker_ptr)
        {
            *out_fsk_rx_done_status = STM32WLxx_RADIO_FSK_RX_DONE_STATUS_SW_MARK_NOT_PRESENT;
            err = SID_RADIO_ERROR_UNEXPECTED_DATA;
            break;
        }

        /* Clear the validity marker */
        *validity_marker_ptr = 0u;

        /* Parse the header */
        phy_hdr.fcs_type = rx_storage[SID_RADIO_FSK_PACKET_TYPE_OFFSET] >> 4;
        phy_hdr.is_data_whitening_enabled = (rx_storage[SID_RADIO_FSK_PACKET_TYPE_OFFSET] & (1u << 3)) ? true : false;

        /* Determine the expected payload length from the FSK packet header */
        fsk_payload_len = rx_storage[SID_RADIO_FSK_PACKET_LENGTH_OFFSET];

        /* Esnure we have enough space to reedout the payload */
        assert_param((fsk_payload_len) <= rx_storage_size);

        /* Check that expected packet length at least covers the CRC part + 1 byte */
        if ( ((STM32WLxx_RADIO_FSK_FCS_TYPE_0 == phy_hdr.fcs_type) && (fsk_payload_len <= sizeof(uint32_t)))
          || ((STM32WLxx_RADIO_FSK_FCS_TYPE_1 == phy_hdr.fcs_type) && (fsk_payload_len <= sizeof(uint16_t))))
        {
            *out_fsk_rx_done_status = STM32WLxx_RADIO_FSK_RX_DONE_STATUS_BAD_CRC;
            err = SID_RADIO_ERROR_CORRUPTED_DATA;
            break;
        }

        /* Readout Rx packet status from the SubGHz peripheral */
        err = _sid_radio_subghz_get_rx_buffer_status(&rx_buffer_status);
        if (err != SID_RADIO_ERROR_NONE)
        {
            break;
        }

        /* Workaround for sporadic invalid GetRxBufferStatus reports */
        uint32_t buffer_status_retry_counter = 0u;
        while ((0u == rx_buffer_status.pld_len_in_bytes) && (buffer_status_retry_counter < SID_RADIO_FSK_GET_RX_BUFFER_STATUS_RETRIES))
        {
            /* Readout Rx packet status from SX126x again to address internal race condition */
            err = _sid_radio_subghz_get_rx_buffer_status(&rx_buffer_status);
            if (err != SID_RADIO_ERROR_NONE)
            {
                break;
            }

            /* Increment retry counter on successful read */
            buffer_status_retry_counter++;
        }
        if (err != SID_RADIO_ERROR_NONE)
        {
            /* Terminate if a fatal error occurred while fetching Rx buffer status */
            break;
        }
        /* Proceed even if the retry limit is reached and the reported packet length is still zero - the generic packet length check below will react on that */

