TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/common/stm32wl55x_radio/Sidewalk/sid_radio.c
        /* Validity check: actually received data length should match the info from the header */
        if (rx_buffer_status.pld_len_in_bytes != (STM32WLxx_RADIO_COMM_FSK_PHY_HEADER_LENGTH + fsk_payload_len))
        {
            *out_fsk_rx_done_status = STM32WLxx_RADIO_FSK_RX_DONE_STATUS_INVALID_LENGTH;
            err = SID_RADIO_ERROR_WRONG_SIZE;
            break;
        }

        /* Readout FSK payload only, we don't need the header anymore */
        hal_err = HAL_SUBGHZ_ReadBuffer(&hsubghz, (rx_buffer_status.buffer_start_pointer + STM32WLxx_RADIO_COMM_FSK_PHY_HEADER_LENGTH), rx_storage, fsk_payload_len);
        if (hal_err != HAL_OK)
        {
            SID_PAL_LOG_ERROR("Failed to read %u bytes from SubGHz buffer. HAL_SUBGHZ err: 0x%x", fsk_payload_len, hal_err);
            err = SID_RADIO_ERROR_HARDWARE;
            break;
        }

        /* Do data unwhitening if required */
        if (phy_hdr.is_data_whitening_enabled != false)
        {
            _sid_radio_fsk_perform_data_whitening(SID_RADIO_FSK_WHITENING_SEED, rx_storage, rx_storage, fsk_payload_len);
        }

        /* Compute CRC of the received payload */
        switch (phy_hdr.fcs_type)
        {
            case STM32WLxx_RADIO_FSK_FCS_TYPE_0:
                crc_length = sizeof(uint32_t);
                crc        = _sid_radio_compute_crc32(rx_storage, fsk_payload_len - crc_length);
                break;

            case STM32WLxx_RADIO_FSK_FCS_TYPE_1:
                crc_length = sizeof(uint16_t);
                crc        = _sid_radio_compute_crc16(rx_storage, fsk_payload_len - crc_length);
                break;

            default:
                *out_received_len       = 0u;
                *out_fsk_rx_done_status = STM32WLxx_RADIO_FSK_RX_DONE_STATUS_UNKNOWN_ERROR;
                err                     = SID_RADIO_ERROR_UNEXPECTED_DATA;
                break;
        }

        /* Jump out of loop if switch() ended with an error */
        if (err != SID_RADIO_ERROR_NONE)
        {
            break;
        }

        /* Store the amount of the payload we've got without the CRC part */
        *out_received_len = (uint16_t)(fsk_payload_len - crc_length);

        /* Verify CRC */
        for (uint32_t i = 0u; i < crc_length; i++)
        {
            if (rx_storage[*out_received_len + i] != (uint8_t)(crc >> (8*(crc_length - i - 1 ))))
            {
                *out_fsk_rx_done_status = STM32WLxx_RADIO_FSK_RX_DONE_STATUS_BAD_CRC;
                err                     = SID_RADIO_ERROR_CORRUPTED_DATA;
                break;
            }
        }
        /* Jump out if CRC error detected */
        if (err != SID_RADIO_ERROR_NONE)
        {
            break;
        }

        err = _sid_radio_subghz_get_gfsk_pkt_status(&pkt_status);
        if (err != SID_RADIO_ERROR_NONE)
        {
            *out_fsk_rx_done_status = STM32WLxx_RADIO_FSK_RX_DONE_STATUS_TIMEOUT;
            break;
        }

        fsk_rx_packet_status->rssi_sync = (int8_t)_sid_radio_get_adjusted_rssi(pkt_status.rssi_sync);
        fsk_rx_packet_status->rssi_avg  = (int8_t)_sid_radio_get_adjusted_rssi(pkt_status.rssi_avg);
        fsk_rx_packet_status->snr       = 0; /* Measurement is not available */

        err = SID_RADIO_ERROR_NONE;
    } while(0);

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline void _sid_radio_convert_fsk_packet_params(stm32wlxx_pkt_params_gfsk_t * const fsk_pp, const stm32wlxx_pal_radio_fsk_pkt_params_t * const pkt_params)
{
    if (pkt_params->preamble_length > 1u)
    {
        fsk_pp->pbl_len_in_bits   = (pkt_params->preamble_length - 1u) << 3;
    }
    else
    {
        fsk_pp->pbl_len_in_bits   = 0u;
    }
    fsk_pp->pbl_min_det           = (stm32wlxx_gfsk_pbl_det_t)pkt_params->preamble_min_detect;
    fsk_pp->sync_word_len_in_bits = pkt_params->sync_word_length << 3;
    fsk_pp->addr_cmp              = (stm32wlxx_gfsk_addr_cmp_t)pkt_params->addr_comp;
    fsk_pp->hdr_type              = (stm32wlxx_gfsk_pkt_len_modes_t)pkt_params->header_type;
    fsk_pp->pld_len_in_bytes      = pkt_params->payload_length;
    fsk_pp->crc_type              = (stm32wlxx_gfsk_crc_types_t)pkt_params->crc_type;
    fsk_pp->dc_free               = (stm32wlxx_gfsk_dc_free_t)pkt_params->radio_whitening_mode;
}

/*----------------------------------------------------------------------------*/

/** @brief Set the frequency for the radio.
 *
 *  @param[in] request Request payload with the settings
 *  @retval    Non-zero value in case of error
 */
SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_set_frequency(const stm32wlxx_rcp_set_frequency_req_t * const request)
{
    sid_radio_error_t err = SID_RADIO_ERROR_GENERIC;

    do
    {
        if (request->frequency == current_radio_freq_hz)
        {
            SID_RADIO_LOG_DEBUG("Radio frequency is already set to %u - skipping Set Frequency request", current_radio_freq_hz);
            err = SID_RADIO_ERROR_NONE;
            break;
        }

        if (current_radio_state != SID_PAL_RADIO_STANDBY)
        {
           SID_RADIO_LOG_ERROR("Cannot set radio freq to %u, radio is not in standby", request->frequency);
           err = SID_RADIO_ERROR_INVALID_STATE;
           break;
        }

        /* Check if we are going to switch the frequency bands and if calibration is needed due to this */
        const stm32wlxx_freq_cal_band_t current_freq_band = SID_RADIO_GET_FREQ_BAND(current_radio_freq_hz);
        const stm32wlxx_freq_cal_band_t desired_freq_band = SID_RADIO_GET_FREQ_BAND(request->frequency);
        if (current_freq_band != desired_freq_band)
        {
            err = _sid_radio_cal_img(desired_freq_band);
            if (SID_RADIO_ERROR_NONE == err)
            {
                SID_PAL_LOG_INFO("SubGHz frequency band set to %s", SID_RADIO_GET_FREQ_BAND_STR(desired_freq_band));
            }
            else
            {
                /* Logs provided by _sid_radio_cal_img() */
                break;
            }
        }

#if STM32WLxx_SUBGHZ_TXPWR_WORKAROUND
        if (STM32WLxx_SUBGHZ_BAND_900M == desired_freq_band)
        {
            HAL_StatusTypeDef hal_err;
            uint8_t           reg_val = (request->frequency <= STM32WLxx_SUBGHZ_BAND_EDGE_LIMIT_FREQ) ? STM32WLxx_SUBGHZ_REG_VAL_FREQ_LOW : STM32WLxx_SUBGHZ_REG_VAL_FREQ_HIGH;

