TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/common/stm32wl55x_radio/Sidewalk/sid_radio.c
            hal_err = HAL_SUBGHZ_WriteRegisters(&hsubghz, STM32WLxx_SUBGHZ_REG_LR_CFG_FREQ, &reg_val, sizeof(reg_val));
            if (hal_err != HAL_OK)
            {
                SID_PAL_LOG_ERROR("Failed to write SubGHz reg. Reg: 0x%04X, HAL_SUBGHZ err: 0x%x", STM32WLxx_SUBGHZ_REG_LR_CFG_FREQ, hal_err);
                err = SID_RADIO_ERROR_HARDWARE;
                break;
            }
        }
#endif /* STM32WLxx_SUBGHZ_TXPWR_WORKAROUND */

        err = _sid_radio_set_rf_freq(request->frequency);
        if (err != SID_RADIO_ERROR_NONE)
        {
            /* Logs provided by _sid_radio_set_rf_freq() */
            break;
        }

        /* Store the newly applied frequency */
        current_radio_freq_hz = request->frequency;

        err = SID_RADIO_ERROR_NONE;
    } while (0);

    if (err != SID_RADIO_ERROR_NONE)
    {
        SID_PAL_LOG_ERROR("Failed to set SubGHz frequency to %u. Error %u", request->frequency, err);
    }

    return err;
}

/*----------------------------------------------------------------------------*/

/** @brief Set sync word
 *
 *  @retval Non-zero value in case of error
 */
SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_set_sync_word(const stm32wlxx_rcp_set_sync_word_req_t * const request)
{
    sid_radio_error_t err = SID_RADIO_ERROR_GENERIC;

    do
    {
        if (FALSE == valid_subghz_cfg_received)
        {
            SID_PAL_LOG_WARNING("Attempt to set modem sync word before SubGHz config is sent");
            err = SID_RADIO_ERROR_INVALID_STATE;
            break;
        }

        if (STM32WLxx_SUBGHZ_RADIO_MODEM_MODE_FSK == request->modem)
        {
            if ((request->fsk_sync_word.data_len == WL55_cfg.fsk_cfg.sync_word_len)
              && (SID_STM32_UTIL_fast_memcmp(WL55_cfg.fsk_cfg.sync_word, request->fsk_sync_word.data, WL55_cfg.fsk_cfg.sync_word_len) == 0u))
            {
                SID_RADIO_LOG_DEBUG("Set FSK sync word - skipped, no changes");
                err = SID_RADIO_ERROR_NONE;
                break;
            }

            /* Apply immediately if the modem is currently in FSK mode */
            if (STM32WLxx_SUBGHZ_RADIO_MODEM_MODE_FSK == current_modem_mode)
            {
                err = _sid_radio_subghz_set_gfsk_sync_word(request->fsk_sync_word.data, request->fsk_sync_word.data_len);
                if (err != SID_RADIO_ERROR_NONE)
                {
                    break;
                }
            }

            /* Everything is fine, store the update */
            SID_STM32_UTIL_fast_memcpy(WL55_cfg.fsk_cfg.sync_word, request->fsk_sync_word.data, request->fsk_sync_word.data_len);
            WL55_cfg.fsk_cfg.sync_word_len = request->fsk_sync_word.data_len;
            SID_PAL_LOG_DEBUG("FSK sync word set to 0x%02X%02X%02X, len: %u", WL55_cfg.fsk_cfg.sync_word[0], WL55_cfg.fsk_cfg.sync_word[1], WL55_cfg.fsk_cfg.sync_word[2], WL55_cfg.fsk_cfg.sync_word_len);
            err = SID_RADIO_ERROR_NONE;
        }
        else if (STM32WLxx_SUBGHZ_RADIO_MODEM_MODE_LORA == request->modem)
        {
            if (request->lora_sync_word == WL55_cfg.lora_cfg.sync_word)
            {
                SID_RADIO_LOG_DEBUG("Set LoRa sync word - skipped, no changes");
                err = SID_RADIO_ERROR_NONE;
                break;
            }

            /* Apply immediately if the modem is currently in LoRa mode */
            if (STM32WLxx_SUBGHZ_RADIO_MODEM_MODE_LORA == current_modem_mode)
            {
                err = _sid_radio_subghz_set_lora_sync_word(request->lora_sync_word);
                if (err != SID_RADIO_ERROR_NONE)
                {
                    break;
                }
            }

            /* Everything is fine, store the update */
            WL55_cfg.lora_cfg.sync_word = request->lora_sync_word;
            SID_PAL_LOG_DEBUG("LoRa sync word set to 0x%04X", request->lora_sync_word);
            err = SID_RADIO_ERROR_NONE;
        }
        else
        {
            SID_PAL_LOG_WARNING("Invalid modem specified for Set Sync Word cmd: %u", request->modem);
            err = SID_RADIO_ERROR_UNEXPECTED_DATA;
            break;
        }
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

/** @brief Set LoRa symbol timeout.
 *
 *  @param[in] request Request payload from the host MCU
 *  @retval Non-zero value in case of error
 */
SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_set_lora_symbol_timeout(const stm32wlxx_rcp_set_lora_symb_timeout_req_t * const request)
{
    sid_radio_error_t err = SID_RADIO_ERROR_GENERIC;

    do
    {
        if (FALSE == valid_subghz_cfg_received)
        {
            SID_PAL_LOG_WARNING("Attempt to set LoRa symbol timeout before SubGHz config is sent");
            err = SID_RADIO_ERROR_INVALID_STATE;
            break;
        }

        if (request->symbol_timeout == WL55_cfg.lora_cfg.symbol_timeout)
        {
            SID_RADIO_LOG_DEBUG("Set LoRa symbol timeout - skipped, no changes");
            err = SID_RADIO_ERROR_NONE;
            break;
        }

        /* This drvier uses software timer to control Tx/Rx timeouts to avoid the radio falling back to STDBY_RC state on timeout. STDBY_XOSC is used instead */

        /* Everything is fine, store the update */
        WL55_cfg.lora_cfg.symbol_timeout = request->symbol_timeout;
        SID_RADIO_LOG_DEBUG("LoRa symbol timeout set to %u", request->symbol_timeout);
        err = SID_RADIO_ERROR_NONE;
    } while (0);

    if (err != SID_RADIO_ERROR_NONE)
    {
        SID_PAL_LOG_ERROR("Failed to apply LoRa symbol timeout setting. Error %u", (uint32_t)err);
    }

    return err;
}

/*----------------------------------------------------------------------------*/

/**
 * @brief Calculates the lora symbol timeout in us.
 *
 * In the case of an error, 0 is returned.
 *
 *  @param[in] mod_params Current modulation parameters that phy uses. If null, zero will be returned.
 *  @param[in] number_of_symbol Input number of symbol .
 *  @return lora symbol timeout in us
 *
 */
SID_STM32_SPEED_OPTIMIZED static inline uint32_t _sid_radio_get_lora_symbol_timeout_us(const uint32_t number_of_symbol)
{
    uint32_t symbol_timeout;

    if (valid_subghz_cfg_received != FALSE)
    {
        assert_param(STM32WLxx_LORA_BW_125 == 0x04u);
        assert_param(WL55_cfg.lora_cfg.mod.bandwidth >= STM32WLxx_LORA_BW_125);

        assert_param(STM32WLxx_LORA_SF12 == 0x0Cu);
        assert_param(WL55_cfg.lora_cfg.mod.spreading_factor <= STM32WLxx_LORA_SF12);

        const uint32_t bw_idx = WL55_cfg.lora_cfg.mod.bandwidth - STM32WLxx_LORA_BW_125;
        const uint32_t sf_idx = STM32WLxx_LORA_SF12 - WL55_cfg.lora_cfg.mod.spreading_factor;

