TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/common/stm32wl55x_radio/Sidewalk/sid_radio.c
        assert_param(bw_idx < SID_STM32_UTIL_ARRAY_SIZE(radio_lora_symb_time));
        assert_param(sf_idx < SID_STM32_UTIL_ARRAY_SIZE(radio_lora_symb_time[0]));

        /* Compute generic symbol duration */
        symbol_timeout = radio_lora_symb_time[bw_idx][sf_idx] * number_of_symbol;
    }
    else
    {
        symbol_timeout = 0u;
    }

    return symbol_timeout;
}

/*----------------------------------------------------------------------------*/

/** @brief Set LoRa modulation parameters.
 *
 *  @retval Non-zero value in case of error
 */
SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_process_set_lora_mod_params_req(const stm32wlxx_rcp_set_lora_mod_params_req_t * const request)
{
    sid_radio_error_t err = SID_RADIO_ERROR_GENERIC;

    do
    {
        if (FALSE == valid_subghz_cfg_received)
        {
            SID_PAL_LOG_WARNING("Attempt to set LoRa modulation params before SubGHz config is sent");
            err = SID_RADIO_ERROR_INVALID_STATE;
            break;
        }

        if (SID_STM32_UTIL_fast_memcmp(&WL55_cfg.lora_cfg.mod, &request->mod_params, sizeof(WL55_cfg.lora_cfg.mod)) == 0u)
        {
            SID_RADIO_LOG_DEBUG("Set LoRa modulation params - skipped, no changes");
            err = SID_RADIO_ERROR_NONE;
            break;
        }

        err = _sid_radio_subghz_set_lora_mod_params(&request->mod_params);
        if (err != SID_RADIO_ERROR_NONE)
        {
            break;
        }

        /* Everything is fine, store the update */
        SID_STM32_UTIL_fast_memcpy(&WL55_cfg.lora_cfg.mod, &request->mod_params, sizeof(WL55_cfg.lora_cfg.mod));
        mod_params_upd_indication_pending = TRUE; /* Schedule logging for a later timer */
        err = SID_RADIO_ERROR_NONE;
    } while (0);

    if (err != SID_RADIO_ERROR_NONE)
    {
        SID_PAL_LOG_ERROR("Failed to apply LoRa modulation params. Error %u", (uint32_t)err);
    }

    return err;
}

/*----------------------------------------------------------------------------*/

/** @brief Set LoRa packet parameters.
 *
 *  @param[in] packet_params pointer to Sidewalk LoRa packet params.
 *  @retval    Non-zero value in case of error
 */
SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_set_lora_packet_params(const stm32wlxx_rcp_set_lora_pkt_params_req_t * const request)
{
    sid_radio_error_t err = SID_RADIO_ERROR_GENERIC;

    do
    {
        if (FALSE == valid_subghz_cfg_received)
        {
            SID_PAL_LOG_WARNING("Attempt to set LoRa packet params before SubGHz config is sent");
            err = SID_RADIO_ERROR_INVALID_STATE;
            break;
        }

        if (SID_STM32_UTIL_fast_memcmp(&WL55_cfg.lora_cfg.pkt, &request->packet_params, sizeof(WL55_cfg.lora_cfg.pkt)) == 0u)
        {
            SID_RADIO_LOG_DEBUG("Set LoRa packet params - skipped, no changes");
            err = SID_RADIO_ERROR_NONE;
            break;
        }

        err = _sid_radio_subghz_set_lora_pkt_params(&request->packet_params);
        if (err != SID_RADIO_ERROR_NONE)
        {
            break;
        }

        /* Everything is fine, store the update */
        SID_STM32_UTIL_fast_memcpy(&WL55_cfg.lora_cfg.pkt, &request->packet_params, sizeof(WL55_cfg.lora_cfg.pkt));
        SID_RADIO_LOG_DEBUG("LoRa pkt params updated. crc_mod:0x%02X hdr_typ:0x%02X inv_iq:%u pload_len:%u preamb_len%u",
                            request->packet_params.crc_mode, request->packet_params.header_type, request->packet_params.invert_IQ,
                            request->packet_params.payload_length, request->packet_params.preamble_length);
        err = SID_RADIO_ERROR_NONE;
    } while (0);

    if (err != SID_RADIO_ERROR_NONE)
    {
        SID_PAL_LOG_ERROR("Failed to apply LoRa packet params. Error %u", (uint32_t)err);
    }

    return err;
}

/*----------------------------------------------------------------------------*/

/** @brief Set LoRa CAD parameters.
 *
 *  @param[in] request pointer to Sidewalk CAD params.
 *  @retval   Non-zero value in case of error
 */
SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_set_lora_cad_params(const stm32wlxx_rcp_set_lora_cad_params_req_t * const request)
{
    sid_radio_error_t err = SID_RADIO_ERROR_GENERIC;
    stm32wlxx_lora_cad_params_t lora_cad_params;

    do
    {
        if (current_modem_mode != STM32WLxx_SUBGHZ_RADIO_MODEM_MODE_LORA)
        {
            err = SID_RADIO_ERROR_INVALID_STATE;
            break;
        }

        if (FALSE == valid_subghz_cfg_received)
        {
            SID_PAL_LOG_WARNING("Attempt to set LoRa CAD params before SubGHz config is sent");
            err = SID_RADIO_ERROR_INVALID_STATE;
            break;
        }

        /* Extract CAD parameters from the request */
        lora_cad_params.cad_symb_nb  = request->symbol_num;
        lora_cad_params.cad_det_peak = request->detect_peak;
        lora_cad_params.cad_det_min  = request->detect_min;
        lora_cad_params.cad_timeout  = request->timeout;

        /* Decode CAD exit mode */
        WL55_cfg.drv_cfg.cad_exit_mode = STM32WLxx_SUBGHZ_UNZIP_CAD_EXIT_MODE(request->exit_mode);
        switch (WL55_cfg.drv_cfg.cad_exit_mode)
        {
            case STM32WLxx_RADIO_CAD_EXIT_MODE_CS_ONLY:
                lora_cad_params.cad_exit_mode = STM32WLxx_LORA_CAD_ONLY;
                err = SID_RADIO_ERROR_NONE;
                break;

            case STM32WLxx_RADIO_CAD_EXIT_MODE_CS_RX:
                lora_cad_params.cad_exit_mode = STM32WLxx_LORA_CAD_RX;
                err = SID_RADIO_ERROR_NONE;
                break;

            case STM32WLxx_RADIO_CAD_EXIT_MODE_CS_LBT:
                lora_cad_params.cad_exit_mode = STM32WLxx_LORA_CAD_LBT;
                err = SID_RADIO_ERROR_NONE;
                break;

            default:
                err = SID_RADIO_ERROR_UNEXPECTED_DATA;
                break;
        }

        if (err != SID_RADIO_ERROR_NONE)
        {
            break;
        }

        /* Apply LoRa CAD configuration to the radio */
        err = _sid_radio_subghz_set_cad_params(&lora_cad_params);
        if (err != SID_RADIO_ERROR_NONE)
        {
            break;
        }

