TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/common/stm32wl55x_radio/Sidewalk/sid_radio.c
        err = SID_RADIO_ERROR_NONE;
    } while (0);

    if (err != SID_RADIO_ERROR_NONE)
    {
        SID_PAL_LOG_ERROR("Failed to apply LoRa CAD params. Error %u", (uint32_t)err);
    }

    return err;
}

/*----------------------------------------------------------------------------*/

/** @brief Start packet transmission
 *
 *  Starts the packet transmission. This needs to be invoked after all
 *  the radio configuration viz modulation params, packet params, freq,
 *  power, payload and payload length are set atleast once.
 *  The radio should be able to transmit the packet within the timeout
 *  specfied through this API. If it fails to transmit the packet within
 *  the stipulated timeout value, the radio driver should generate a
 *  interrupt with tx timeout as the reason
 *
 *  @param [in] timeout for transmission
 *  @retval     Non-zero value in case of error
 */
SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_start_tx(const uint32_t timeout_us)
{
    sid_radio_error_t err = SID_RADIO_ERROR_GENERIC;

    do
    {
        /* Configure antenna switch */
        err = _sid_radio_subghz_set_radio_mode(STM32WLxx_RADIO_FRONTEND_MODE_TX);
        if (err != SID_RADIO_ERROR_NONE)
        {
            break;
        }

        current_radio_state = SID_PAL_RADIO_TX;
        __COMPILER_BARRIER();

        err = _sid_radio_subghz_set_tx(SID_RADIO_RXTX_NO_TIMEOUT_VAL); /* We use a software timer to avoid the radio falling back to STDBY_RC mode on Tx timeout */
        if (err != SID_RADIO_ERROR_NONE)
        {
            /* Something went wrong, we don't know if the radio has actually started Tx or remained in Standby */
            current_radio_state = SID_PAL_RADIO_UNKNOWN;
            break;
        }
#if SID_HOST_COMM_PROCESSING_DELAY_PROFILING
        /* Indicate Tx start immediately for more precise results */
        SID_PDP_HOST_COMM_ACTIVITY_GPIO_Port->BRR = SID_PDP_HOST_COMM_ACTIVITY_Pin;
#endif /* SID_HOST_COMM_PROCESSING_DELAY_PROFILING */

        /* Start the software timer if needed */
        err = _sid_radio_start_radio_timeout_mon(timeout_us);
        if (err != SID_RADIO_ERROR_NONE)
        {
            SID_RADIO_LOG_ERROR("Failed to start Tx timeout timer. Error %d", err);
            break;
        }
        __COMPILER_BARRIER();

        err = SID_RADIO_ERROR_NONE;
        SID_RADIO_LOG_DEBUG("Started Tx with timeout %uus", timeout_us);
    } while (0);

    if (err != SID_RADIO_ERROR_NONE)
    {
        SID_PAL_LOG_ERROR("Failed to start SubGHz Tx. Error %u", (uint32_t)err);
    }

    return err;
}

/*----------------------------------------------------------------------------*/

/** @brief Set the radio in receive mode
 *
 *  @param[in]  params: timeout in microseconds for how long radio is in receive mode.
 *  @retval  true in case of error
 */
SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_start_rx(const stm32wlxx_rcp_start_rx_req_t * const params)
{
    sid_radio_error_t err = SID_RADIO_ERROR_GENERIC;
    uint32_t timeout = params->timeout_us;

    do
    {
        if (FALSE == valid_subghz_cfg_received)
        {
            SID_PAL_LOG_WARNING("Attempt to start Rx before SubGHz config is sent");
            err = SID_RADIO_ERROR_INVALID_STATE;
            break;
        }

        /* Ensure CS/CAD exit mode is clear */
        WL55_cfg.drv_cfg.cad_exit_mode = STM32WLxx_RADIO_CAD_EXIT_MODE_NONE;

        /* Take into account LoRa symbol timeout if it is set */
        if ((STM32WLxx_SUBGHZ_RADIO_MODEM_MODE_LORA == current_modem_mode) && (WL55_cfg.lora_cfg.symbol_timeout > 0u))
        {
            const uint32_t lora_sync_timeout_us = _sid_radio_get_lora_symbol_timeout_us(WL55_cfg.lora_cfg.symbol_timeout);
            if ((lora_sync_timeout_us < timeout) || (0u == timeout)) /* If symbol time is shorter than Rx timeout or Rx timeout is disabled */
            {
                timeout = lora_sync_timeout_us;
            }
        }

        if  (STM32WLxx_SUBGHZ_RADIO_MODEM_MODE_FSK == current_modem_mode)
        {
            /* Set expected Rx length to maximum as we don't known the actual length and software may not be fast enough to react on header reception */
            uint8_t expected_rx_len = STM32WLxx_RADIO_COMM_SUBGHZ_RX_MAX_SIZE;
            HAL_StatusTypeDef hal_err;

            hal_err = HAL_SUBGHZ_WriteRegisters(&hsubghz, SUBGHZ_GRTXPLDLEN, &expected_rx_len, sizeof(expected_rx_len));
            if (hal_err != HAL_OK)
            {
                SID_PAL_LOG_ERROR("Failed to write SubGHz reg. Reg: 0x%04X, HAL_SUBGHZ err: 0x%x", SUBGHZ_GRTXPLDLEN, hal_err);
                err = SID_RADIO_ERROR_HARDWARE;
                break;
            }
        }

        /* Configure antenna switch */
        err = _sid_radio_subghz_set_radio_mode(STM32WLxx_RADIO_FRONTEND_MODE_RX);
        if (err != SID_RADIO_ERROR_NONE)
        {
            break;
        }

        /* Go-go-go */
        current_radio_state = SID_PAL_RADIO_RX;
        __COMPILER_BARRIER();

        err = _sid_radio_subghz_set_rx(SID_RADIO_INFINITE_TIME == timeout ? SID_RADIO_RX_CONTINUOUS_VAL : SID_RADIO_RXTX_NO_TIMEOUT_VAL); /* We use a software timer to avoid the radio falling back to STDBY_RC mode on Rx timeout */
        if (err != SID_RADIO_ERROR_NONE)
        {
            /* Something went wrong, we don't know if the radio has actually started Rx or remained in Standby */
            current_radio_state = SID_PAL_RADIO_UNKNOWN;
            break;
        }
#if SID_HOST_COMM_PROCESSING_DELAY_PROFILING
        /* Indicate Rx start immediately for more precise results */
        SID_PDP_HOST_COMM_ACTIVITY_GPIO_Port->BRR = SID_PDP_HOST_COMM_ACTIVITY_Pin;
#endif /* SID_HOST_COMM_PROCESSING_DELAY_PROFILING */

        /* Start the software timer if needed */
        err = _sid_radio_start_radio_timeout_mon(timeout);
        if (err != SID_RADIO_ERROR_NONE)
        {
            break;
        }

        err = SID_RADIO_ERROR_NONE;
    } while(0);

    /* As the timings are not critical anymore provide some postponed logs */
    _sid_radio_log_mod_params_change();

    if (err != SID_RADIO_ERROR_NONE)
    {
        SID_PAL_LOG_ERROR("Failed to start SubGHz Rx. Error %u", (uint32_t)err);
    }

