TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/common/stm32wl55x_radio/Sidewalk/sid_radio.c
    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline int32_t _sid_radio_get_adjusted_rssi(const int32_t raw_rrsi)
{
    register int32_t adjusted_rssi = raw_rrsi;

    if (valid_subghz_cfg_received != FALSE)
    {
        adjusted_rssi -= (int32_t)WL55_cfg.drv_cfg.lna_gain;
    }

    if (adjusted_rssi < INT8_MIN)
    {
        adjusted_rssi = INT8_MIN;
    }

    return adjusted_rssi;
}

/*----------------------------------------------------------------------------*/

/** @brief Get RSSI at radio's current configured frequency
 *
 *  The frequency on which RSSI needs to be measured needs to be set before
 *  calling this API.
 *
 *  @retval  signed integer indicating RSSI in dBm
 */
SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_subghz_get_rssi(int8_t * const out_rssi)
{
    sid_radio_error_t err;
    HAL_StatusTypeDef hal_err;
    uint8_t           rssi_reg;
    int32_t           rssi;

    assert_param(out_rssi != NULL);

    hal_err = HAL_SUBGHZ_ExecGetCmd(&hsubghz, RADIO_GET_RSSIINST, &rssi_reg, sizeof(rssi_reg));

    if (HAL_OK == hal_err)
    {
        /* Compute physical value from the raw register value */
        rssi = ((-(int32_t)rssi_reg) >> 1);

        /* Adjust by LNA gain and Rx boost gain */
        rssi = _sid_radio_get_adjusted_rssi(rssi);

        *out_rssi = (int8_t)rssi;

        err = SID_RADIO_ERROR_NONE;
    }
    else
    {
        SID_PAL_LOG_ERROR("Failed to access SubGHz. HAL_SUBGHZ err: 0x%x", hal_err);
        err = SID_RADIO_ERROR_HARDWARE;
    }

    return err;
}

/*----------------------------------------------------------------------------*/

/** @brief Radio irq processing.
 *
 *  The function reads the irq status register and reports radio event to the
 *  phy layer through the callback routine registered as part of sid_pal_radio_init.
 *  The protocol after being notified on receiving a radio interrupt switches
 *  from hardware isr to software isr context to continue with bottom half
 *  processing of the radio interrupt.
 *  _sid_radio_irq_process should determine the cause of interrupt and notify the
 *  protocol of the phy event through the event handler registered as part of
 *  sid_pal_radio_init.
 *  On packet reception, this API has to copy the received packet from radio
 *  buffers to the rx packet registered as part of sid_pal_radio_init
 *
 *  @retval  true in case of error
 */
SID_STM32_SPEED_OPTIMIZED static sid_radio_error_t _sid_radio_irq_process(const uint32_t reported_irqs, const uint32_t irq_timestamp_s, const uint32_t irq_timestamp_us)
{
    sid_radio_error_t                      err                  = SID_RADIO_ERROR_GENERIC;
    stm32wlxx_pal_radio_events_t           radio_event          = STM32WLxx_PAL_RADIO_EVENT_UNKNOWN;
    uint32_t                               remaining_irqs       = reported_irqs;
    stm32wlxx_radio_comm_spi_frame_t       spi_reply_frame;
    stm32wlxx_rcp_irq_status_t * const     irq_status_reply     = &spi_reply_frame.payload.irq_status;
    stm32wlxx_subghz_irq_details_t * const irq_details          = &irq_status_reply->subghz_irq_details;
    uint32_t                               rx_done_received_len = 0u;

    /* Set default follow-up data length to zero */
    irq_status_reply->followup_payload_len = 0u;

    do
    {
        if ((SID_PAL_RADIO_SLEEP == current_radio_state) || (SID_PAL_RADIO_STANDBY == current_radio_state))
        {
            /* This may happen if radio IRQ was pre-empted by timeout monitoring software timer */
            SID_RADIO_LOG_DEBUG("Radio IRQ detected while SubGHz is in Sleep/Standby - ignored");
            remaining_irqs = STM32WLxx_SUBGHZ_IRQ_NONE;
            err = SID_RADIO_ERROR_NONE;
            break;
        }

        /* Handle Tx Done IRQ --------------------------------------------------------*/
        if ((reported_irqs & STM32WLxx_SUBGHZ_IRQ_TX_DONE) != STM32WLxx_SUBGHZ_IRQ_NONE)
        {
            SID_RADIO_LOG_DEBUG("STM32WLxx_SUBGHZ_IRQ_TX_DONE");

            /* Radio automatically enters Standby state after Tx/Rx completion or error (e.g. timeout) */
            current_radio_state = SID_PAL_RADIO_STANDBY;
            /* Turn off FEM as we don't need it any longer */
            (void)_sid_radio_subghz_set_radio_mode(STM32WLxx_RADIO_FRONTEND_MODE_OFF);

            /* Tx Done IRQ is processed successfully */
            remaining_irqs &= ~STM32WLxx_SUBGHZ_IRQ_TX_DONE;
            radio_event = STM32WLxx_PAL_RADIO_EVENT_TX_DONE;
            err = SID_RADIO_ERROR_NONE;
            break;
        }
        /*----------------------------------------------------------------------------*/

        /* Sync Word Valid IRQ -------------------------------------------------------*/
        if ((reported_irqs & STM32WLxx_SUBGHZ_IRQ_SYNC_WORD_VALID) != STM32WLxx_SUBGHZ_IRQ_NONE)
        {
            SID_RADIO_LOG_DEBUG("STM32WLxx_SUBGHZ_IRQ_SYNC_WORD_VALID");

            const uint32_t rx_done = (reported_irqs & STM32WLxx_SUBGHZ_IRQ_RX_DONE) != STM32WLxx_SUBGHZ_IRQ_NONE ? TRUE : FALSE;

            if (STM32WLxx_SUBGHZ_RADIO_MODEM_MODE_FSK == current_modem_mode)
            {
                err = _sid_radio_fsk_process_sync_word_detected(radio_irq_followup_frame.subghz_rx_buf, rx_done);
                if (err != SID_RADIO_ERROR_NONE)
                {
                    /* Logs provided by _sid_radio_fsk_process_sync_word_detected() */
                    break;
                }
            }
            else
            {
                /* No actions required for LoRa */
                err = SID_RADIO_ERROR_NONE;
            }

            /* Sync Word Valid IRQ is processed successfully */
            remaining_irqs &= ~STM32WLxx_SUBGHZ_IRQ_SYNC_WORD_VALID;

            /* Terminate IRQ processing if no more IRQs are indicated, otherwise proceed (e.g. with Preamble Detected, Rx Done, etc.) */
            if (STM32WLxx_SUBGHZ_IRQ_NONE == remaining_irqs)
            {
                break;
            }
        }
        /*----------------------------------------------------------------------------*/

