TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/common/stm32wl55x_radio/Sidewalk/sid_radio.c
        /* Preamble Detect IRQ -------------------------------------------------------*/
        if ((reported_irqs & STM32WLxx_SUBGHZ_IRQ_PBL_DET) != STM32WLxx_SUBGHZ_IRQ_NONE)
        {
            SID_RADIO_LOG_DEBUG("STM32WLxx_SUBGHZ_IRQ_PBL_DET");

            if (STM32WLxx_SUBGHZ_RADIO_MODEM_MODE_FSK == current_modem_mode)
            {
                const stm32wlxx_pal_radio_cad_param_exit_mode_t cad_exit_mode_on_entry = WL55_cfg.drv_cfg.cad_exit_mode;

                if (STM32WLxx_RADIO_CAD_EXIT_MODE_CS_LBT == cad_exit_mode_on_entry)
                {
                    /* Carrier sense detected a signal - collision on the channel, cannot transmit */
                    radio_event = STM32WLxx_PAL_RADIO_EVENT_CS_DONE;
                    WL55_cfg.drv_cfg.cad_exit_mode = STM32WLxx_RADIO_CAD_EXIT_MODE_NONE;

                    /* Obtain RSSI of the detected carrier */
                    err = _sid_radio_subghz_get_rssi(&irq_details->received_packet_info.fsk_rx_packet_status.rssi_sync);
                    if (err != SID_RADIO_ERROR_NONE)
                    {
                        SID_RADIO_LOG_ERROR("Failed to get SubGHz RSSI. Error %u", (uint32_t)err);
                        break;
                    }

                    /* Append RSSI debug info to the unsued MSB of the Tx payload length */
                    last_indicated_radio_event_data_len = (last_indicated_radio_event_data_len & 0x00FFFFFFu) |  ((uint32_t)irq_details->received_packet_info.fsk_rx_packet_status.rssi_sync << 24);

                    /* Put radio into Standby */
                    err = _sid_radio_subghz_standby();
                    if (err != SID_RADIO_ERROR_NONE)
                    {
                        /* Logs provided by _sid_radio_subghz_standby() */
                        break;
                    }

                    /* Restore the default IRQ mask since it was modifed for FSK Carrier Sense */
                    err = _sid_radio_enable_default_irqs();
                    if (err != SID_RADIO_ERROR_NONE)
                    {
                        /* Logs are provided by _sid_radio_enable_default_irqs() */
                        break;
                    }
                }
                else
                {
                    err = SID_RADIO_ERROR_NONE;
                }

                /* Restore the default IRQ mask for FSK */
                if (cad_exit_mode_on_entry != STM32WLxx_RADIO_CAD_EXIT_MODE_NONE)
                {
                    err = _sid_radio_enable_default_irqs();
                    if (err != SID_RADIO_ERROR_NONE)
                    {
                        /* Logs are provided by _sid_radio_enable_default_irqs() */
                        break;
                    }
                }
            }
            else
            {
                /* This IRQ is used to stop timeout timer only */
                err = SID_RADIO_ERROR_NONE;
            }

            /* Preamble Detect IRQ is processed successfully */
            remaining_irqs &= ~STM32WLxx_SUBGHZ_IRQ_PBL_DET;

            /* Terminate IRQ processing if no more IRQs are indicated, otherwise proceed (e.g. with Rx Done, etc.) */
            if (STM32WLxx_SUBGHZ_IRQ_NONE == remaining_irqs)
            {
                break;
            }
        }
        /*----------------------------------------------------------------------------*/

        /* CAD Done IRQ --------------------------------------------------------------*/
        if ((reported_irqs & STM32WLxx_SUBGHZ_IRQ_CAD_DONE) != STM32WLxx_SUBGHZ_IRQ_NONE)
        {
            SID_RADIO_LOG_DEBUG("STM32WLxx_SUBGHZ_IRQ_CAD_DONE");

            if (STM32WLxx_SUBGHZ_RADIO_MODEM_MODE_LORA == current_modem_mode)
            {
                err = SID_RADIO_ERROR_NONE;
#if HALO_ENABLE_DIAGNOSTICS
                radio_event = ((reported_irqs & STM32WLxx_SUBGHZ_IRQ_CAD_DET) != STM32WLxx_SUBGHZ_IRQ_NONE) ? STM32WLxx_PAL_RADIO_EVENT_CAD_DONE : STM32WLxx_PAL_RADIO_EVENT_CAD_TIMEOUT;

                /* Restore the default IRQ mask for FSK after any type of Carrier Sense */
                err = _sid_radio_enable_default_irqs();
                if (err != SID_RADIO_ERROR_NONE)
                {
                    SID_RADIO_LOG_ERROR("Failed to set IRQ mask for LoRa mode");
                }

                if ((STM32WLxx_RADIO_CAD_EXIT_MODE_CS_LBT == WL55_cfg.drv_cfg.cad_exit_mode) && (STM32WLxx_PAL_RADIO_EVENT_CAD_TIMEOUT == radio_event))
                {
                    /* Start Tx in CAD-LBT mode */
                    radio_event = STM32WLxx_PAL_RADIO_EVENT_UNKNOWN;
                    current_radio_state = SID_PAL_RADIO_TX;

                }
                else if ((STM32WLxx_RADIO_CAD_EXIT_MODE_CS_RX == WL55_cfg.drv_cfg.cad_exit_mode) && (STM32WLxx_PAL_RADIO_EVENT_CAD_DONE == radio_event))
                {
                    /* Proceed with waiting for Rx result */
                    radio_event = STM32WLxx_PAL_RADIO_EVENT_UNKNOWN;
                    current_radio_state = SID_PAL_RADIO_RX;
                }
                else
                {
                    /* For the other modes report CAD Done/ CAD Timeout event */

                    /* Put the radio to Standby - by default CAD moves out to STDBY_RC, but the driver uses STDBY_XOSC */
                    err = _sid_radio_subghz_standby();
                    if (err != SID_RADIO_ERROR_NONE)
                    {
                        SID_RADIO_LOG_ERROR("Failed to put radio to Standby after CAD. Error %d", err);
                        break;
                    }
                }

                WL55_cfg.drv_cfg.cad_exit_mode = STM32WLxx_RADIO_CAD_EXIT_MODE_NONE;
                if (err != SID_RADIO_ERROR_NONE)
                {
                    break;
                }
#endif /* HALO_ENABLE_DIAGNOSTICS */
            }
            else
            {
                SID_RADIO_LOG_ERROR("CAD Done IRQ is expected only for LoRa mode, but modem is in %u mode", (uint32_t)current_modem_mode);
                err = SID_RADIO_ERROR_INVALID_STATE;
                break;
            }

            /* CAD Done IRQ is processed successfully */
            remaining_irqs &= ~(STM32WLxx_SUBGHZ_IRQ_CAD_DONE | STM32WLxx_SUBGHZ_IRQ_CAD_DET);
            break;
        }
        /*----------------------------------------------------------------------------*/

        /* CRC Error IRQ -------------------------------------------------------------*/
        if ((reported_irqs & STM32WLxx_SUBGHZ_IRQ_CRC_ERROR) != STM32WLxx_SUBGHZ_IRQ_NONE)
        {
            SID_RADIO_LOG_DEBUG("STM32WLxx_SUBGHZ_IRQ_CRC_ERROR");
            err = SID_RADIO_ERROR_NONE;
            radio_event = STM32WLxx_PAL_RADIO_EVENT_RX_ERROR;
            remaining_irqs &= ~(STM32WLxx_SUBGHZ_IRQ_CRC_ERROR | STM32WLxx_SUBGHZ_IRQ_RX_DONE);
            break;
        }
        /*----------------------------------------------------------------------------*/

        /* Header Error IRQ ----------------------------------------------------------*/
        if ((reported_irqs & STM32WLxx_SUBGHZ_IRQ_HEADER_ERROR) != STM32WLxx_SUBGHZ_IRQ_NONE)
        {
            SID_RADIO_LOG_DEBUG("STM32WLxx_SUBGHZ_IRQ_HEADER_ERROR");
            err = SID_RADIO_ERROR_NONE;
            radio_event = STM32WLxx_PAL_RADIO_EVENT_HEADER_ERROR;
            remaining_irqs &= ~STM32WLxx_SUBGHZ_IRQ_HEADER_ERROR;
            break;
        }
        /*----------------------------------------------------------------------------*/

        /* Rx Done IRQ ---------------------------------------------------------------*/
        if ((reported_irqs & STM32WLxx_SUBGHZ_IRQ_RX_DONE) != STM32WLxx_SUBGHZ_IRQ_NONE)
        {
            /* There's no need to check for CRC and other errors here since all error IRQs are handled before we get here */
            SID_RADIO_LOG_DEBUG("STM32WLxx_SUBGHZ_IRQ_RX_DONE");

            /* Radio automatically enters Standby state after Tx/Rx completion or error (e.g. timeout) */
            current_radio_state = SID_PAL_RADIO_STANDBY;
            /* Turn off FEM as we don't need it any longer */
            (void)_sid_radio_subghz_set_radio_mode(STM32WLxx_RADIO_FRONTEND_MODE_OFF);

