TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/common/stm32wl55x_radio/Sidewalk/sid_radio.c
            /* Process FSK first as it's more time sensitive */
            if (STM32WLxx_SUBGHZ_RADIO_MODEM_MODE_FSK == current_modem_mode)
            {
                stm32wlxx_radio_fsk_rx_done_status_t fsk_rx_done_status;

                err = _sid_radio_fsk_process_rx_done(&irq_details->received_packet_info.fsk_rx_packet_status, radio_irq_followup_frame.subghz_rx_buf,
                                                     sizeof(radio_irq_followup_frame.subghz_rx_buf), &rx_done_received_len, &fsk_rx_done_status);
                if (err != SID_RADIO_ERROR_NONE)
                {
                    SID_RADIO_LOG_DEBUG("FSK Rx completed with error. Error: %u, rx status: %u", (uint32_t)err, (uint32_t)fsk_rx_done_status);
                    radio_event = STM32WLxx_PAL_RADIO_EVENT_RX_ERROR;
                    last_indicated_radio_event_data_len = 0u;
                    err = SID_RADIO_ERROR_NONE;
                }
                else
                {
                    radio_event = STM32WLxx_PAL_RADIO_EVENT_RX_DONE;
                    last_indicated_radio_event_data_len = rx_done_received_len;
                    radio_irq_followup_frame.opcode = STM32WLxx_RADIO_COMM_OPCODE_RAW_DATA;

                    /* Calculate the actual length of the follow-up data */
                    irq_status_reply->followup_payload_len = (sizeof(radio_irq_followup_frame) - sizeof(radio_irq_followup_frame.subghz_rx_buf)) + rx_done_received_len;
                }
            }
            else if (STM32WLxx_SUBGHZ_RADIO_MODEM_MODE_LORA == current_modem_mode)
            {
                err = _sid_radio_lora_process_rx_done(&irq_details->received_packet_info.lora_rx_packet_status, radio_irq_followup_frame.subghz_rx_buf,
                                                      sizeof(radio_irq_followup_frame.subghz_rx_buf), &rx_done_received_len);
                if (err != SID_RADIO_ERROR_NONE)
                {
                    SID_RADIO_LOG_DEBUG("LoRa Rx completed with error %u", (uint32_t)err);
                    radio_event = STM32WLxx_PAL_RADIO_EVENT_RX_ERROR;
                    last_indicated_radio_event_data_len = 0u;
                    err = SID_RADIO_ERROR_NONE;
                }
                else
                {
                    radio_event = STM32WLxx_PAL_RADIO_EVENT_RX_DONE;
                    last_indicated_radio_event_data_len = rx_done_received_len;
                    radio_irq_followup_frame.opcode = STM32WLxx_RADIO_COMM_OPCODE_RAW_DATA;

                    /* Calculate the actual length of the follow-up data */
                    irq_status_reply->followup_payload_len = (sizeof(radio_irq_followup_frame) - sizeof(radio_irq_followup_frame.subghz_rx_buf)) + rx_done_received_len;
                }
            }
            else
            {
                SID_PAL_LOG_ERROR("Received SubGHz Rx Done IRQ, but active modem mode (%u) is invalid", (uint32_t)current_modem_mode);
                err = SID_RADIO_ERROR_INVALID_STATE;
                break;
            }

            /* Ensure the indicated received length is valid */
            if ((STM32WLxx_PAL_RADIO_EVENT_RX_DONE == radio_event) && (0u == rx_done_received_len))
            {
                SID_RADIO_LOG_DEBUG("Rx completed with zero received length");
                radio_event = STM32WLxx_PAL_RADIO_EVENT_RX_ERROR;
                last_indicated_radio_event_data_len = 0u;
                irq_status_reply->followup_payload_len = 0u;
                err = SID_RADIO_ERROR_NONE;
            }

            /* Rx Done IRQ is processed successfully */
            remaining_irqs &= ~STM32WLxx_SUBGHZ_IRQ_RX_DONE;
            break;
        }

        /* If we've got here it means none of the above blocks took care of the IRQ. Not an error, but... */
        SID_PAL_LOG_WARNING("Unexpected SubGHz IRQ detected: 0x%04X. No handlers assigned to it. All reported: 0x%04X", remaining_irqs, reported_irqs);
        err = SID_RADIO_ERROR_NONE;
    } while(0);
    /*----------------------------------------------------------------------------*/

    /* Indicate the IRQ to the host MCU if needed --------------------------------*/
    if (SID_RADIO_ERROR_NONE == err)
    {
        if (remaining_irqs != STM32WLxx_SUBGHZ_IRQ_NONE)
        {
            SID_PAL_LOG_WARNING("Unhandled SubGHz IRQs identified. Reported: 0x%04x, unhandled: 0x%04x", reported_irqs, remaining_irqs);
        }

        last_indicated_radio_event = radio_event;

        if (STM32WLxx_PAL_RADIO_EVENT_UNKNOWN != radio_event)
        {
            /* Report the event to the host MCU */
            err = _sid_radio_report_event(radio_event, &spi_reply_frame, irq_timestamp_s, irq_timestamp_us);
        }
        else
        {
            SID_RADIO_LOG_DEBUG("SubGHz IRQ report to host MCU skipped");
        }
    }
    else
    {
        SID_RADIO_LOG_ERROR("SubGHz IRQ processing failed. Error %u, irqs: 0x%x, unhandled: 0x%x", (uint32_t)err, reported_irqs, remaining_irqs);
    }

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static sid_radio_error_t _sid_radio_report_event(const stm32wlxx_pal_radio_events_t radio_event, stm32wlxx_radio_comm_spi_frame_t * const spi_reply_frame, const uint32_t irq_timestamp_s, const uint32_t irq_timestamp_us)
{
    sid_radio_error_t                      err                  = SID_RADIO_ERROR_GENERIC;
    stm32wlxx_rcp_irq_status_t * const     irq_status_reply     = &spi_reply_frame->payload.irq_status;
    stm32wlxx_subghz_irq_details_t * const irq_details          = &irq_status_reply->subghz_irq_details;
    sid_host_comm_error_t hc_err;

    do
    {
        /* Report the event to the host MCU */
        spi_reply_frame->opcode      = STM32WLxx_RADIO_COMM_OPCODE_IRQ_STATUS;
        irq_status_reply->irq_flags  = STM32WLxx_APP_IRQ_SUBGHZ;

        irq_details->radio_event     = radio_event;
        irq_details->cad_exit_mode   = STM32WLxx_SUBGHZ_ZIP_CAD_EXIT_MODE(WL55_cfg.drv_cfg.cad_exit_mode);
        irq_details->radio_state     = current_radio_state;

        /* Store the location of the SPI Tx buffer to put timestamp to it later */
        stm32wlxx_radio_comm_spi_frame_t * const reply_frame_in_fifo = (stm32wlxx_radio_comm_spi_frame_t *)serial_bus_spi_get_current_enqueue_ptr();

        hc_err = sid_host_comm_enqueue_tx((uint8_t *)(void *)spi_reply_frame, sizeof(*spi_reply_frame));
        if (hc_err != SID_HOST_COMM_ERROR_NONE)
        {
            SID_PAL_LOG_ERROR("Failed to enqueue SubGHz IRQ status SPI frame. HC error %u", (uint32_t)hc_err);
            err = SID_RADIO_ERROR_HARDWARE;
            break;
        }

