TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/common/stm32wl55x_radio/Sidewalk/sid_radio.c
        if (irq_status_reply->followup_payload_len != 0u)
        {
            hc_err = sid_host_comm_enqueue_tx((uint8_t *)(void *)&radio_irq_followup_frame, irq_status_reply->followup_payload_len);
            if (hc_err != SID_HOST_COMM_ERROR_NONE)
            {
                SID_PAL_LOG_ERROR("Failed to enqueue SubGHz IRQ follow-up data. HC error %u", (uint32_t)hc_err);
                err = SID_RADIO_ERROR_HARDWARE;
                break;
            }
        }

        /* Disable all interrupts to calculate IRQ processing time */
        const register uint32_t primask_bit = __get_PRIMASK();
        __disable_irq();
        __COMPILER_BARRIER();

        /* Compute the elapsed time */
        uint32_t now_s, now_us;
        now_s = TIMER_IF_GetTimeUs(&now_us);
        const uint32_t elapsed_time_us = ((now_s - irq_timestamp_s /* Intentional underflow */) * 1000000u) + (now_us - irq_timestamp_us /* Intentional underflow */);

        assert_param(STM32WLxx_RADIO_COMM_OPCODE_IRQ_STATUS == reply_frame_in_fifo->opcode);
        assert_param(STM32WLxx_APP_IRQ_SUBGHZ               == reply_frame_in_fifo->payload.irq_status.irq_flags);
        assert_param(radio_event                            == reply_frame_in_fifo->payload.irq_status.subghz_irq_details.radio_event);

        /* Convert elapsed time to ns and write directlyto the SPI buffer */
        reply_frame_in_fifo->payload.irq_status.subghz_irq_details.compensatory_ns = (elapsed_time_us * 1000u) + SID_RADIO_IRQ_PROCESSING_DELAY_STATIC_ERROR_NS;
        __COMPILER_BARRIER();

        /* If everything is ok indicate the IRQ to the host MCU - this will start SPI transfers */
        SID_HOST_COMM_IRQ_DISABLE_TRIGGER(); /* Avoid self-triggering of the Handshake IRQ */
        __COMPILER_BARRIER();
        SID_HOST_COMM_IRQ_INDICATE_EVENT();

        /* Restore interrupt settings */
        __set_PRIMASK(primask_bit);
        __COMPILER_BARRIER();

#if SID_HOST_COMM_PROCESSING_DELAY_PROFILING
        /* Clear the actual radio IRQ event indication for profiling after the radio IRQ is processed */
        SID_PDP_RADIO_IRQ_ACTIVITY_GPIO_Port->BRR = SID_PDP_RADIO_IRQ_ACTIVITY_Pin;
#endif /* SID_HOST_COMM_PROCESSING_DELAY_PROFILING */

        err = SID_RADIO_ERROR_NONE;
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

/** @brief Set fsk modulation parameters.
 *
 *  @retval Non-zero value in case of error
 */
SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_process_set_fsk_mod_params_req(const stm32wlxx_rcp_set_fsk_mod_params_req_t * const request)
{
    sid_radio_error_t err = SID_RADIO_ERROR_GENERIC;

    do
    {
        if (FALSE == valid_subghz_cfg_received)
        {
            SID_PAL_LOG_WARNING("Attempt to FSK modulation params before SubGHz config is sent");
            err = SID_RADIO_ERROR_INVALID_STATE;
            break;
        }

        if (SID_STM32_UTIL_fast_memcmp(&WL55_cfg.fsk_cfg.mod, &request->mod_params, sizeof(WL55_cfg.fsk_cfg.mod)) == 0u)
        {
            SID_RADIO_LOG_DEBUG("Set FSK modulation params - skipped, no changes");
            err = SID_RADIO_ERROR_NONE;
            break;
        }

        err = _sid_radio_subghz_set_gfsk_mod_params(&request->mod_params);
        if (err != SID_RADIO_ERROR_NONE)
        {
            break;
        }

        /* Everything is fine, store the update */
        SID_STM32_UTIL_fast_memcpy(&WL55_cfg.fsk_cfg.mod, &request->mod_params, sizeof(WL55_cfg.fsk_cfg.mod));
        mod_params_upd_indication_pending = TRUE; /* Schedule logs for later time */
        err = SID_RADIO_ERROR_NONE;
    } while (0);

    if (err != SID_RADIO_ERROR_NONE)
    {
        SID_PAL_LOG_ERROR("Failed to apply FSK modulation params. Error %u", (uint32_t)err);
    }

    return err;
}

/*----------------------------------------------------------------------------*/

/** @brief Set LoRa packet parameters.
 *
 *  @param[in] packet_params pointer to Sidewalk FSK packet params.
 *  @retval    Non-zero value in case of error
 */
SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_process_set_fsk_packet_params_req(const stm32wlxx_rcp_set_fsk_pkt_params_req_t * const request)
{
    sid_radio_error_t err = SID_RADIO_ERROR_GENERIC;

    do
    {
        if (FALSE == valid_subghz_cfg_received)
        {
            SID_PAL_LOG_WARNING("Attempt to set FSK packet params before SubGHz config is sent");
            err = SID_RADIO_ERROR_INVALID_STATE;
            break;
        }

        if (SID_STM32_UTIL_fast_memcmp(&WL55_cfg.fsk_cfg.pkt, &request->packet_params, sizeof(WL55_cfg.fsk_cfg.pkt)) == 0u)
        {
            SID_RADIO_LOG_DEBUG("Set FSK packet params - skipped, no changes");
            err = SID_RADIO_ERROR_NONE;
            break;
        }

        err = _sid_radio_subghz_set_gfsk_pkt_params(&request->packet_params);
        if (err != SID_RADIO_ERROR_NONE)
        {
            break;
        }

        /* Everything is fine, store the update */
        SID_STM32_UTIL_fast_memcpy(&WL55_cfg.fsk_cfg.pkt, &request->packet_params, sizeof(WL55_cfg.fsk_cfg.pkt));
        SID_RADIO_LOG_DEBUG("FSK pkt params updated. crc_t:0x%02X hdr_typ:0x%02X sw:%u wht:0x%02X pload:%u preamb_len%u pream_min_det:%u",
                            request->packet_params.crc_type, request->packet_params.header_type, request->packet_params.sync_word_length,
                            request->packet_params.radio_whitening_mode, request->packet_params.payload_length,
                            request->packet_params.preamble_length, request->packet_params.preamble_min_detect);
        err = SID_RADIO_ERROR_NONE;
    } while (0);

    if (err != SID_RADIO_ERROR_NONE)
    {
        SID_PAL_LOG_ERROR("Failed to apply FSK packet params. Error %u", (uint32_t)err);
    }

    return err;
}

/*----------------------------------------------------------------------------*/

/** @brief Set the radio in preamble detect mode
 *
 *  @param[in] request pointer to the FSK Carrier Sense parameters.
 *  @retval Non-zero value in case of error
 */
SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_start_fsk_carrier_sense(const stm32wlxx_rcp_start_fsk_cs_req_t * const request)
{
    sid_radio_error_t err = SID_RADIO_ERROR_GENERIC;

    do
    {
        if (current_modem_mode != STM32WLxx_SUBGHZ_RADIO_MODEM_MODE_FSK)
        {
            err = SID_RADIO_ERROR_INVALID_STATE;
            break;
        }

