TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/common/stm32wl55x_radio/Sidewalk/sid_radio.c
        if (FALSE == valid_subghz_cfg_received)
        {
            SID_PAL_LOG_WARNING("Attempt to start FSK carrier sense before SubGHz config is sent");
            err = SID_RADIO_ERROR_INVALID_STATE;
            break;
        }

        /* Extract CAD exit mode for this request and check if it is supported */
        WL55_cfg.drv_cfg.cad_exit_mode = STM32WLxx_SUBGHZ_UNZIP_CAD_EXIT_MODE(request->exit_mode);
        if (WL55_cfg.drv_cfg.cad_exit_mode != STM32WLxx_RADIO_CAD_EXIT_MODE_CS_LBT)
        {
            SID_PAL_LOG_ERROR("FSK CS exit mode 0x%X is not supported", WL55_cfg.drv_cfg.cad_exit_mode);
            err = SID_RADIO_ERROR_NOT_SUPPORTED;
            break;
        }

        /* Configure FEM for Rx */
        err = _sid_radio_subghz_set_radio_mode(STM32WLxx_RADIO_FRONTEND_MODE_RX);
        if (err != SID_RADIO_ERROR_NONE)
        {
            break;
        }

        /* Enable IRQs relevant to CS */
        err = _sid_radio_set_irq_mask(STM32WLxx_RADIO_COMM_FSK_CARRIER_SENSE_IRQ_MASK);
        if (err != SID_RADIO_ERROR_NONE)
        {
            break;
        }

        /* Update status in the driver */
        current_radio_state = SID_PAL_RADIO_RX;
        __COMPILER_BARRIER();

        /* Start Rx to check for radio channel availability */
        err = _sid_radio_subghz_set_rx(SID_RADIO_RXTX_NO_TIMEOUT_VAL); /* We use a software timer to avoid the radio falling back to STDBY_RC mode on Rx timeout */
        if (err != SID_RADIO_ERROR_NONE)
        {
            current_radio_state = SID_PAL_RADIO_UNKNOWN;
            break;
        }

        /* Start the software timer for FSK if needed */
        err = _sid_radio_start_radio_timeout_mon(request->duration_us);
        if (err != SID_RADIO_ERROR_NONE)
        {
            break;
        }

        err = SID_RADIO_ERROR_NONE;
     } while(0);

    if (err != SID_RADIO_ERROR_NONE)
    {
        SID_PAL_LOG_ERROR("Failed to start Carrier Sense. Error %u", (uint32_t)err);
    }

    return err;
}

/*----------------------------------------------------------------------------*/

#if STM32WLXX_EXT_IFC_ENABLE_USER_DATA_TRANSFER
SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_process_user_data_upload(const uint8_t * const frame_data, const uint32_t available_frame_length, const uint32_t full_frame_length)
{
    /* Check for systematic failures */
    assert_param(frame_data != NULL);
    const stm32wlxx_rcp_user_data_t * const user_data_frame = (stm32wlxx_rcp_user_data_t *)(void *)frame_data;
#if DEBUG
    uint32_t calculated_full_frame_length = user_data_frame->data_length + sizeof(user_data_frame->opcode) + sizeof(user_data_frame->data_length);
    if (calculated_full_frame_length < sizeof(stm32wlxx_radio_comm_spi_frame_t))
    {
        calculated_full_frame_length = sizeof(stm32wlxx_radio_comm_spi_frame_t);
    }
    assert_param(full_frame_length == calculated_full_frame_length);
#endif

    if (available_frame_length == full_frame_length)
    {
        sid_host_comm_on_incoming_user_data cb_func;
        void *                              cb_user_arg;

        /* All the user data has arrived, trigger the user callback */
        SID_RADIO_LOG_DEBUG("Received %u bytes of user data", user_data_frame->data_length);

        /* Make a local copy of the callback pointer */
        UTILS_ENTER_CRITICAL_SECTION();
        cb_func     = udt_ctx.on_user_data_rx;
        cb_user_arg = udt_ctx.on_user_data_rx_user_arg;
        UTILS_EXIT_CRITICAL_SECTION();

        if (cb_func != NULL)
        {
            /* Invoke the user callback */
            cb_func(user_data_frame->data, user_data_frame->data_length, cb_user_arg);
        }
    }
    else
    {
        /* Not enough data to upload, keep waiting for addiiotnal incoming data */
    }

    return SID_RADIO_ERROR_NONE;
}
#endif /* STM32WLXX_EXT_IFC_ENABLE_USER_DATA_TRANSFER */

/*----------------------------------------------------------------------------*/

#if STM32WLXX_EXT_IFC_ENABLE_USER_DATA_TRANSFER
SID_STM32_SPEED_OPTIMIZED static void _user_data_transfer_thread(void * context)
{
    osStatus_t os_err;

    (void)context;

    do
    {
        assert_param(udt_ctx.outbound_msg_queue != NULL);

        /* Wait for any user app requests to send out data to the STM32WLxx side */
        sid_host_comm_out_udt_msg_desc_t msg_desc;
        os_err = osMessageQueueGet(udt_ctx.outbound_msg_queue, &msg_desc, NULL, osWaitForever);

        if (osOK == os_err)
        {
            if ((msg_desc.data_ptr != NULL) && (msg_desc.data_len > 0u))
            {
                sid_radio_error_t err = SID_RADIO_ERROR_GENERIC;

                stm32wlxx_radio_comm_spi_frame_t udt_irq_frame = {
                    .opcode = STM32WLxx_RADIO_COMM_OPCODE_IRQ_STATUS,
                    .payload = {
                        .irq_status = {
                            .irq_flags = STM32WLxx_APP_IRQ_USER_DATA,
                            .followup_payload_len =  (sizeof(udt_irq_followup_frame) - sizeof(udt_irq_followup_frame.data)) + msg_desc.data_len,
                        },
                    },
                };

                /* Prepare IRQ follow-up frame with User Data */
                udt_irq_followup_frame.opcode = STM32WLxx_RADIO_COMM_OPCODE_USER_DATA;
                SID_STM32_UTIL_fast_memcpy(udt_irq_followup_frame.data, msg_desc.data_ptr, msg_desc.data_len);

                /* Automatically free the buffer after processing is done (if requested) */
                if (msg_desc.auto_free != FALSE)
                {
                    vPortFree(msg_desc.data_ptr);
                }

                /* Ensure the radio is fully initialized before any further actions */
                {
                    UTILS_ENTER_CRITICAL_SECTION();
                    const uint32_t local_valid_subghz_cfg_received = valid_subghz_cfg_received;
                    UTILS_EXIT_CRITICAL_SECTION();

                    if (FALSE == local_valid_subghz_cfg_received)
                    {
                        /* Driver is not ready to accept user messages - wait for readiness */
                        const uint32_t event_flags = osThreadFlagsWait(SID_RADIO_UDT_DRIVER_READY_FLAG, osFlagsWaitAny, osWaitForever);
                        if ((event_flags & osFlagsError) != 0u)
                        {
                            /* Unable to send - drop the data and proceed */
                            SID_PAL_LOG_ERROR("UDT - error while waiting driver readiness. Error flags 0x%08X", event_flags);
                            continue;
                        }
                    }
                }

                /* Wait until UDT is allowed */
                {
                    UTILS_ENTER_CRITICAL_SECTION();
                    const uint32_t local_udt_enabled = udt_ctx.udt_enabled;
                    UTILS_EXIT_CRITICAL_SECTION();

                    if (FALSE == local_udt_enabled)
                    {
                        /* UDT is prohibited at the moment -wait for it to get enabled */
                        const uint32_t event_flags = osThreadFlagsWait(SID_RADIO_UDT_TRANSFER_ENABLED_FLAG, osFlagsWaitAny, osWaitForever);
                        if ((event_flags & osFlagsError) != 0u)
                        {
                            /* Unable to send - drop the data and proceed */
                            SID_PAL_LOG_ERROR("UDT - error while waiting UDT enablement. Error flags 0x%08X", event_flags);
                            continue;
                        }
                    }
                }

                UTILS_ENTER_CRITICAL_SECTION();
                do
                {
                    sid_host_comm_error_t hc_err = sid_host_comm_enqueue_tx((void *)&udt_irq_frame, sizeof(udt_irq_frame));
                    if (hc_err != SID_HOST_COMM_ERROR_NONE)
                    {
                        SID_RADIO_LOG_ERROR("Unable to enqueue User Data IRQ frame. Host Comm error %u", (uint32_t)hc_err);
                        err = SID_RADIO_ERROR_HARDWARE;
                        break;
                    }

                    hc_err = sid_host_comm_enqueue_tx((void *)&udt_irq_followup_frame, udt_irq_frame.payload.irq_status.followup_payload_len);
                    if (hc_err != SID_HOST_COMM_ERROR_NONE)
                    {
                        SID_RADIO_LOG_ERROR("Unable to enqueue User Data IRQ follow-up data. Host Comm error %u", (uint32_t)hc_err);
                        err = SID_RADIO_ERROR_HARDWARE;
                        break;
                    }

                    SID_RADIO_LOG_DEBUG("Successfully enqueued User Data IRQ frames");
                    err = SID_RADIO_ERROR_NONE;
                } while (0);

                if (SID_RADIO_ERROR_NONE == err)
                {
                    /* Set IRQ indication if everything is ok */
                    SID_HOST_COMM_IRQ_DISABLE_TRIGGER(); /* Disable EXTI on IRQ falling edge since we are going to drive the line, otherwise GPIO Handshake will be triggered */
                    __COMPILER_BARRIER();                /* Ensure EXTI trigger is deactivated before the next step */
                    SID_HOST_COMM_IRQ_INDICATE_EVENT();  /* Drive the IRQ line to indicate pendingIRQ to the host MCU */
                }
                else
                {
                    SID_PAL_LOG_ERROR("Failed to send UDT message. Error %u", (uint32_t)err);
                }
                UTILS_EXIT_CRITICAL_SECTION();
            }
            else
            {
                SID_PAL_LOG_WARNING("UDT transfer skipped - empty data provided");
            }
        }
        else
        {
            /* Some unexpected CMSIS/OS error occurred */
            SID_PAL_LOG_ERROR("Unexpected error while accessing UDT queue. OS error 0x%08x", (uint32_t)os_err);
        }
    } while (TRUE);

    /* Terminate the thread properly if the code ever gets here */
    SID_PAL_LOG_WARNING("UDT thread terminated");
    osThreadExit();
}
#endif /* STM32WLXX_EXT_IFC_ENABLE_USER_DATA_TRANSFER */

