TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/common/stm32wl55x_radio/Sidewalk/sid_radio.c
/*----------------------------------------------------------------------------*/

#if STM32WLXX_EXT_IFC_ENABLE_USER_DATA_TRANSFER
SID_STM32_SPEED_OPTIMIZED static void _sid_radio_udt_suspend_timer_cb(void * context)
{
    (void)context;

    /* Radio is about to wake up, suspend UDT operations */
    udt_ctx.udt_enabled = FALSE;
}
#endif /* STM32WLXX_EXT_IFC_ENABLE_USER_DATA_TRANSFER */

/*----------------------------------------------------------------------------*/

#if HALO_ENABLE_DIAGNOSTICS
SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_subghz_set_cw_tx(void)
{
    sid_radio_error_t err;
    HAL_StatusTypeDef hal_err;

#if defined(DEBUG) && defined(NUCLEO_WL55_BOARD)
    /* Quick checks that antenna switch is configured properly - valid for the Nucleo board only */
    const GPIO_PinState ctrl3 = (RF_SW_CTRL3_GPIO_PORT->IDR & RF_SW_CTRL3_PIN) != 0u ? GPIO_PIN_SET : GPIO_PIN_RESET;
    const GPIO_PinState ctrl1 = (RF_SW_CTRL1_GPIO_PORT->IDR & RF_SW_CTRL1_PIN) != 0u ? GPIO_PIN_SET : GPIO_PIN_RESET;
    const GPIO_PinState ctrl2 = (RF_SW_CTRL2_GPIO_PORT->IDR & RF_SW_CTRL2_PIN) != 0u ? GPIO_PIN_SET : GPIO_PIN_RESET;

    if ((ctrl3 != GPIO_PIN_SET) || (ctrl2 != GPIO_PIN_SET)) /* ctrl1 is don't care */
    {
        SID_PAL_LOG_ERROR("Wrong antenna switch config for TX: ctrl1: %u, ctrl2: %u, ctrl3: %u", ctrl1, ctrl2, ctrl3);
    }
#endif /* DEBUG && NUCLEO_WL55_BOARD */

    hal_err = HAL_SUBGHZ_ExecSetCmd(&hsubghz, RADIO_SET_TXCONTINUOUSWAVE, NULL, 0u);
    if (HAL_OK == hal_err)
    {
        err = SID_RADIO_ERROR_NONE;
    }
    else
    {
        SID_PAL_LOG_ERROR("Failed to execute SubGHz cmd. Cmd: 0x%02X, HAL_SUBGHZ err: 0x%x", RADIO_SET_TXCONTINUOUSWAVE, hal_err);
        err = SID_RADIO_ERROR_HARDWARE;
    }

    return err;
}
#endif /* HALO_ENABLE_DIAGNOSTICS */

/*----------------------------------------------------------------------------*/

#if HALO_ENABLE_DIAGNOSTICS
SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_subghz_set_infinite_preamble_tx(void)
{
    sid_radio_error_t err;
    HAL_StatusTypeDef hal_err;

#if defined(DEBUG) && defined(NUCLEO_WL55_BOARD)
    /* Quick checks that antenna switch is configured properly - valid for the Nucleo board only */
    const GPIO_PinState ctrl3 = (RF_SW_CTRL3_GPIO_PORT->IDR & RF_SW_CTRL3_PIN) != 0u ? GPIO_PIN_SET : GPIO_PIN_RESET;
    const GPIO_PinState ctrl1 = (RF_SW_CTRL1_GPIO_PORT->IDR & RF_SW_CTRL1_PIN) != 0u ? GPIO_PIN_SET : GPIO_PIN_RESET;
    const GPIO_PinState ctrl2 = (RF_SW_CTRL2_GPIO_PORT->IDR & RF_SW_CTRL2_PIN) != 0u ? GPIO_PIN_SET : GPIO_PIN_RESET;

    if ((ctrl3 != GPIO_PIN_SET) || (ctrl2 != GPIO_PIN_SET)) /* ctrl1 is don't care */
    {
        SID_PAL_LOG_ERROR("Wrong antenna switch config for TX: ctrl1: %u, ctrl2: %u, ctrl3: %u", ctrl1, ctrl2, ctrl3);
    }
#endif /* DEBUG && NUCLEO_WL55_BOARD */

    hal_err = HAL_SUBGHZ_ExecSetCmd(&hsubghz, RADIO_SET_TXCONTINUOUSPREAMBLE, NULL, 0u);
    if (HAL_OK == hal_err)
    {
        err = SID_RADIO_ERROR_NONE;
    }
    else
    {
        SID_PAL_LOG_ERROR("Failed to execute SubGHz cmd. Cmd: 0x%02X, HAL_SUBGHZ err: 0x%x", RADIO_SET_TXCONTINUOUSPREAMBLE, hal_err);
        err = SID_RADIO_ERROR_HARDWARE;
    }

    return err;
}
#endif /* HALO_ENABLE_DIAGNOSTICS */

/*----------------------------------------------------------------------------*/

#if HALO_ENABLE_DIAGNOSTICS
/**
 * @brief Set the radio to continuous wave transmit
 *
 * @param [in] request CW Tx request data
 * @retval Non-zero value in case of error
 */
SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_start_cw_tx(const stm32wlxx_rcp_start_cw_tx_req_t * const request)
{
    sid_radio_error_t err = SID_RADIO_ERROR_GENERIC;

    do
    {
        /* Set the desired radio frequency */
        stm32wlxx_rcp_set_frequency_req_t set_freq_req = {
            .frequency = request->frequency,
        };
        err = _sid_radio_set_frequency(&set_freq_req);
        if (err != SID_RADIO_ERROR_NONE)
        {
            /* Logs are provided by _sid_radio_set_frequency() */
            break;
        }

        /* Configure antenna switch */
        err = _sid_radio_subghz_set_radio_mode(STM32WLxx_RADIO_FRONTEND_MODE_TX);
        if (err != SID_RADIO_ERROR_NONE)
        {
            break;
        }

        current_radio_state = SID_PAL_RADIO_TX;
        __COMPILER_BARRIER();

        err = _sid_radio_subghz_set_cw_tx();
        if (err != SID_RADIO_ERROR_NONE)
        {
            /* Something went wrong, we don't know if the radio has actually started Tx or remained in Standby */
            current_radio_state = SID_PAL_RADIO_UNKNOWN;
            break;
        }

        err = SID_RADIO_ERROR_NONE;
        SID_PAL_LOG_DEBUG("Started CW Tx at %u.%uMHz, %s%ddBm", request->frequency / 1000u, request->frequency % 1000u, WL55_cfg.pa_cfg.target_tx_power > 0 ? "+" : "", WL55_cfg.pa_cfg.target_tx_power);
    } while (0);

    if (err != SID_RADIO_ERROR_NONE)
    {
        SID_PAL_LOG_ERROR("Failed to start SubGHz CW Tx. Error %u", (uint32_t)err);
    }

    return err;
}
#endif /* HALO_ENABLE_DIAGNOSTICS */

/*----------------------------------------------------------------------------*/

#if HALO_ENABLE_DIAGNOSTICS
/**
 * @brief Set the radio to infinite preamble transmit
 *
 * @param [in] request Infinite preamble Tx request data
 * @retval Non-zero value in case of error
 */
SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_start_infinite_preamble_tx(const stm32wlxx_rcp_start_inf_pbl_tx_req_t * const request)
{
    sid_radio_error_t err = SID_RADIO_ERROR_GENERIC;

    do
    {
        /* Set the desired radio frequency */
        stm32wlxx_rcp_set_frequency_req_t set_freq_req = {
            .frequency = request->frequency,
        };
        err = _sid_radio_set_frequency(&set_freq_req);
        if (err != SID_RADIO_ERROR_NONE)
        {
            /* Logs are provided by _sid_radio_set_frequency() */
            break;
        }

        /* Configure antenna switch */
        err = _sid_radio_subghz_set_radio_mode(STM32WLxx_RADIO_FRONTEND_MODE_TX);
        if (err != SID_RADIO_ERROR_NONE)
        {
            break;
        }

        current_radio_state = SID_PAL_RADIO_TX;
        __COMPILER_BARRIER();

