TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/common/stm32wl55x_radio/Sidewalk/sid_radio.c
        err = _sid_radio_subghz_set_cw_tx();
        if (err != SID_RADIO_ERROR_NONE)
        {
            /* Something went wrong, we don't know if the radio has actually started Tx or remained in Standby */
            current_radio_state = SID_PAL_RADIO_UNKNOWN;
            break;
        }

        err = SID_RADIO_ERROR_NONE;
        SID_PAL_LOG_DEBUG("Started CW Tx at %u.%uMHz, %s%ddBm", request->frequency / 1000u, request->frequency % 1000u, WL55_cfg.pa_cfg.target_tx_power > 0 ? "+" : "", WL55_cfg.pa_cfg.target_tx_power);
    } while (0);

    if (err != SID_RADIO_ERROR_NONE)
    {
        SID_PAL_LOG_ERROR("Failed to start SubGHz CW Tx. Error %u", (uint32_t)err);
    }

    return err;
}
#endif /* HALO_ENABLE_DIAGNOSTICS */

/*----------------------------------------------------------------------------*/

#if HALO_ENABLE_DIAGNOSTICS
/**
 * @brief Set the radio to continuous receive
 *
 * @retval Non-zero value in case of error
 */
SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_start_continuous_rx(void)
{
    sid_radio_error_t err = SID_RADIO_ERROR_GENERIC;

    do
    {
        if (FALSE == valid_subghz_cfg_received)
        {
            SID_PAL_LOG_WARNING("Attempt to start continuous Rx before SubGHz config is sent");
            err = SID_RADIO_ERROR_INVALID_STATE;
            break;
        }

        const uint32_t pbl_det_timer = (STM32WLxx_SUBGHZ_RADIO_MODEM_MODE_FSK == current_modem_mode) ? TRUE: FALSE;

        err = _sid_radio_subghz_stop_tmr_on_pbl(pbl_det_timer);
        if (err != SID_RADIO_ERROR_NONE)
        {
            break;
        }

        err = _sid_radio_subghz_set_radio_mode(STM32WLxx_RADIO_FRONTEND_MODE_RX);
        if (err != SID_RADIO_ERROR_NONE)
        {
            break;
        }

        current_radio_state = SID_PAL_RADIO_RX;
        __COMPILER_BARRIER();

        err = _sid_radio_subghz_set_rx(SID_RADIO_RX_CONTINUOUS_VAL);
        if (err != SID_RADIO_ERROR_NONE)
        {
            current_radio_state = SID_PAL_RADIO_UNKNOWN;
            break;
        }

        err = SID_RADIO_ERROR_NONE;
     } while(0);

    /* As the timings are not critical anymore provide some postponed logs */
    _sid_radio_log_mod_params_change();

    if (err != SID_RADIO_ERROR_NONE)
    {
        SID_PAL_LOG_ERROR("Failed to start continuous Rx. Error %u", (uint32_t)err);
    }

    return err;
}
#endif /* HALO_ENABLE_DIAGNOSTICS */

/*----------------------------------------------------------------------------*/

#if HALO_ENABLE_DIAGNOSTICS
/**
 * @brief Set the radio to continuous receive
 *
 * @retval Non-zero value in case of error
 */
SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_start_rx_duty_cycle(const stm32wlxx_rcp_start_rx_dc_req_t * const request)
{
    sid_radio_error_t err = SID_RADIO_ERROR_GENERIC;

    do
    {
        if (FALSE == valid_subghz_cfg_received)
        {
            SID_PAL_LOG_WARNING("Attempt to start Rx DC before SubGHz config is sent");
            err = SID_RADIO_ERROR_INVALID_STATE;
            break;
        }

        err = _sid_radio_subghz_set_radio_mode(STM32WLxx_RADIO_FRONTEND_MODE_RX);
        if (err != SID_RADIO_ERROR_NONE)
        {
            break;
        }

        current_radio_state = SID_PAL_RADIO_RX;
        __COMPILER_BARRIER();

        err = _sid_radio_subghz_set_rx(SID_RADIO_RX_CONTINUOUS_VAL);
        if (err != SID_RADIO_ERROR_NONE)
        {
            current_radio_state = SID_PAL_RADIO_UNKNOWN;
            break;
        }

        err = SID_RADIO_ERROR_NONE;
     } while(0);

    /* As the timings are not critical anymore provide some postponed logs */
    _sid_radio_log_mod_params_change();

    if (err != SID_RADIO_ERROR_NONE)
    {
        SID_PAL_LOG_ERROR("Failed to start continuous Rx. Error %u", (uint32_t)err);
    }

    return err;
}
#endif /* HALO_ENABLE_DIAGNOSTICS */

/*----------------------------------------------------------------------------*/

#if HALO_ENABLE_DIAGNOSTICS
/**
 * @brief Start LoRa CAD procedure
 *
 * @retval Non-zero value in case of error
 */
SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_start_lora_cad(void)
{
    sid_radio_error_t err = SID_RADIO_ERROR_GENERIC;
    HAL_StatusTypeDef hal_err;

    do
    {
        if (FALSE == valid_subghz_cfg_received)
        {
            SID_PAL_LOG_WARNING("Attempt to start LoRa CAD before SubGHz config is sent");
            err = SID_RADIO_ERROR_INVALID_STATE;
            break;
        }

        /* Configure FEM for CAD */
        err = _sid_radio_subghz_set_radio_mode(STM32WLxx_RADIO_FRONTEND_MODE_RX);
        if (err != SID_RADIO_ERROR_NONE)
        {
            break;
        }

        /* Clear any residual IRQs */
        err = _sid_radio_subghz_clear_irq_status_all();
        if (err != SID_RADIO_ERROR_NONE)
        {
            break;
        }

        /* Set CAD-specific IRQ mask */
        err = _sid_radio_set_irq_mask(STM32WLxx_RADIO_COMM_LORA_CAD_IRQ_MASK);
        if (err != SID_RADIO_ERROR_NONE)
        {
            SID_RADIO_LOG_ERROR("Failed to set IRQ mask for LoRa CAD mode");
            break;
        }

        /* Update status in the driver */
        current_radio_state = SID_PAL_RADIO_CAD;
        __COMPILER_BARRIER();

        /* Start CAD */
        hal_err = HAL_SUBGHZ_ExecSetCmd(&hsubghz, RADIO_SET_CAD, NULL, 0u);
        if (hal_err != HAL_OK)
        {
            SID_PAL_LOG_ERROR("Failed to execute SubGHz cmd. Cmd: 0x%02X, HAL_SUBGHZ err: 0x%x", RADIO_SET_CAD, hal_err);
            current_radio_state = SID_PAL_RADIO_UNKNOWN;
            err = SID_RADIO_ERROR_HARDWARE;
            break;
        }

        err = SID_RADIO_ERROR_NONE;
     } while(0);

    /* As the timings are not critical anymore provide some postponed logs */
    _sid_radio_log_mod_params_change();

    if (err != SID_RADIO_ERROR_NONE)
    {
        SID_PAL_LOG_ERROR("Failed to start LoRa CAD. Error %u", (uint32_t)err);
    }

    return err;
}
#endif /* HALO_ENABLE_DIAGNOSTICS */

