TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/common/stm32wl55x_radio/Sidewalk/sid_radio.c
/*----------------------------------------------------------------------------*/

#if HALO_ENABLE_DIAGNOSTICS
/**
 * @brief Read live RSSI and send it to the host MCU
 *
 * @retval Non-zero value in case of error
 */
SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_get_live_rssi(void)
{
    sid_radio_error_t err = SID_RADIO_ERROR_GENERIC;
    stm32wlxx_req_completed_compact_data_t response_data = {
        .half_words = {(uint16_t)INT16_MAX},
    };

    do
    {
        int8_t rssi_now;

        err = _sid_radio_subghz_get_rssi(&rssi_now);
        if (err != SID_RADIO_ERROR_NONE)
        {
            /* Log messages are printed by _sid_radio_subghz_get_rssi() */
            break;
        }

        response_data.half_words[0] = (uint16_t)(int16_t)rssi_now;

        /* err is already set to SID_RADIO_ERROR_NONE by _sid_radio_subghz_get_rssi() */
    } while (0);

    /* Indicate the request is processed, wether it is successful or not */
    sid_radio_error_t indication_err = _sid_radio_indicate_request_processed(STM32WLxx_RADIO_COMM_OPCODE_GET_LIVE_RSSI, err, &response_data, NULL, 0u);
    if (indication_err != SID_RADIO_ERROR_NONE)
    {
        SID_PAL_LOG_ERROR("Failed to set IRQ indication upon live SubGHz RSSI readout. Error %u", (uint32_t)indication_err);
    }

    /* If only the indication error took place - report it. Otherwise report the root error */
    err = SID_RADIO_ERROR_NONE == err ? indication_err : err;

    return err;
}
#endif /* HALO_ENABLE_DIAGNOSTICS */

/*----------------------------------------------------------------------------*/

#if HALO_ENABLE_DIAGNOSTICS
/**
 * @brief Scans the specified radio channel for any activity
 *
 * @param [in] request Is Channel Free request data
 * @retval Non-zero value in case of error
 */
SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_is_channel_free(const stm32wlxx_rcp_is_channel_free_req_t * const request)
{
    sid_radio_error_t err, irq_err;
    stm32wlxx_req_completed_compact_data_t response_data = {0};

    do
    {
        uint32_t now_s, now_us;
        uint64_t scan_end_timestamp, current_timestamp;
        int8_t rssi_now;

        /* Disable radio IRQ reaction */
        HAL_NVIC_DisableIRQ(SUBGHZ_Radio_IRQn);

        /* Ensure the radio is in Standby */
        err = _sid_radio_subghz_standby();
        if (err != SID_RADIO_ERROR_NONE)
        {
            goto enable_irq;
        }

        /* Set target frequency */
        stm32wlxx_rcp_set_frequency_req_t freq_req = {
            .frequency = request->frequency,
        };
        err = _sid_radio_set_frequency(&freq_req);
        if (err != SID_RADIO_ERROR_NONE)
        {
            goto enable_irq;
        }

        /* Start continuous Rx to conduct RSSI measurements */
        err = _sid_radio_start_continuous_rx();
        if (err != SID_RADIO_ERROR_NONE)
        {
            goto enable_irq;
        }
        __COMPILER_BARRIER();

        now_s = TIMER_IF_GetTimeUs(&now_us);
        scan_end_timestamp = (uint64_t)now_s * 1000000UL + (uint64_t)now_us;
        if (request->duration_us < STM32WLxx_SUBGHZ_MIN_CHANNEL_FREE_DELAY_US)
        {
            scan_end_timestamp += (uint64_t)STM32WLxx_SUBGHZ_MIN_CHANNEL_FREE_DELAY_US;
        }
        else
        {
            scan_end_timestamp += (uint64_t)request->duration_us;
        }
        __COMPILER_BARRIER();

        /* Measurement loop */
        do
        {
            /* Keep inter-measurement delay */
            sid_pal_delay_us(STM32WLxx_SUBGHZ_MIN_CHANNEL_FREE_DELAY_US);

            /* Readout realtime RSSI */
            err = _sid_radio_subghz_get_rssi(&rssi_now);
            if (err != SID_RADIO_ERROR_NONE)
            {
                goto enable_irq;
            }
            if (rssi_now > request->rssi_threshold)
            {
                err = SID_RADIO_ERROR_NONE;
                goto enable_irq;
            }

            now_s = TIMER_IF_GetTimeUs(&now_us);
            current_timestamp = (uint64_t)now_s * 1000000UL + (uint64_t)now_us;
        } while (current_timestamp < scan_end_timestamp);

        /* Channel is free if the measurement loop terminated due to timeout */
        response_data.bytes[0] = TRUE;

enable_irq:
        /* Do not update err on success of the function calls below */

        /* Put radio to Standby to stop continuous Rx */
        irq_err = _sid_radio_subghz_standby();
        if (irq_err != SID_RADIO_ERROR_NONE)
        {
            err = irq_err;
        }

        /* Clear any accumulated IRQ flags */
        irq_err = _sid_radio_subghz_clear_irq_status_all();
        if (irq_err != SID_RADIO_ERROR_NONE)
        {
            err = irq_err;
        }

        /* Re-enabled IRQ pin on MCU side */
        HAL_NVIC_EnableIRQ(SUBGHZ_Radio_IRQn);
    } while (0);

    /* Indicate the request is processed, wether it is successful or not */
    sid_radio_error_t indication_err = _sid_radio_indicate_request_processed(STM32WLxx_RADIO_COMM_OPCODE_CHECK_CHANNEL_FREE, err, &response_data, NULL, 0u);
    if (indication_err != SID_RADIO_ERROR_NONE)
    {
        SID_PAL_LOG_ERROR("Failed to set IRQ indication upon live SubGHz RSSI readout. Error %u", (uint32_t)indication_err);
    }

    /* If only the indication error took place - report it. Otherwise report the root error */
    err = SID_RADIO_ERROR_NONE == err ? indication_err : err;

    return err;
}
#endif /* HALO_ENABLE_DIAGNOSTICS */

/*----------------------------------------------------------------------------*/

#if HALO_ENABLE_DIAGNOSTICS
/**
 * @brief Measure noise on the specified radio channel
 *
 * @param [in] request Get Channel Noise request data
 * @retval Non-zero value in case of error
 */
SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_get_channel_noise(const stm32wlxx_rcp_get_channel_noise_req_t * const request)
{
    sid_radio_error_t err, irq_err;
    stm32wlxx_req_completed_compact_data_t response_data = {0};
    int32_t noise = 0;

    do
    {
        /* Disable radio IRQ reaction */
        HAL_NVIC_DisableIRQ(SUBGHZ_Radio_IRQn);

