TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/common/stm32wl55x_radio/Sidewalk/sid_radio.c
        /* Ensure the radio is in Standby */
        err = _sid_radio_subghz_standby();
        if (err != SID_RADIO_ERROR_NONE)
        {
            goto enable_irq;
        }

        /* Set target frequency */
        stm32wlxx_rcp_set_frequency_req_t freq_req = {
            .frequency = request->frequency,
        };
        err = _sid_radio_set_frequency(&freq_req);
        if (err != SID_RADIO_ERROR_NONE)
        {
            goto enable_irq;
        }

        /* Start continuous Rx to conduct RSSI measurements */
        err = _sid_radio_start_continuous_rx();
        if (err != SID_RADIO_ERROR_NONE)
        {
            goto enable_irq;
        }
        __COMPILER_BARRIER();

        for (uint32_t i = 0u; i < STM32WLxx_SUBGHZ_NOISE_SAMPLE_SIZE; i++)
        {
            /* Readout realtime RSSI */
            int8_t rssi_now;
            err = _sid_radio_subghz_get_rssi(&rssi_now);
            if (err != SID_RADIO_ERROR_NONE)
            {
                goto enable_irq;
            }

            /* Add to noise */
            noise += (int32_t)rssi_now;
            sid_pal_delay_us(STM32WLxx_SUBGHZ_MIN_CHANNEL_NOISE_DELAY_US);
        }

        /* Compuite average */
        noise /= (int32_t)STM32WLxx_SUBGHZ_NOISE_SAMPLE_SIZE;

        /* Store cahnnel noise */
        response_data.half_words[0] = (uint16_t)(int16_t)noise;

enable_irq:
        /* Do not update err on success of the function calls below */

        /* Put radio to Standby to stop continuous Rx */
        irq_err = _sid_radio_subghz_standby();
        if (irq_err != SID_RADIO_ERROR_NONE)
        {
            err = irq_err;
        }

        /* Clear any accumulated IRQ flags */
        irq_err = _sid_radio_subghz_clear_irq_status_all();
        if (irq_err != SID_RADIO_ERROR_NONE)
        {
            err = irq_err;
        }

        /* Re-enabled IRQ pin on MCU side */
        HAL_NVIC_EnableIRQ(SUBGHZ_Radio_IRQn);
    } while (0);

    /* Indicate the request is processed, wether it is successful or not */
    sid_radio_error_t indication_err = _sid_radio_indicate_request_processed(STM32WLxx_RADIO_COMM_OPCODE_GET_CHANNEL_NOISE, err, &response_data, NULL, 0u);
    if (indication_err != SID_RADIO_ERROR_NONE)
    {
        SID_PAL_LOG_ERROR("Failed to set IRQ indication upon SubGHz channel noise measurement. Error %u", (uint32_t)indication_err);
    }

    /* If only the indication error took place - report it. Otherwise report the root error */
    err = SID_RADIO_ERROR_NONE == err ? indication_err : err;

    return err;
}
#endif /* HALO_ENABLE_DIAGNOSTICS */

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_process_irq_ack(void)
{
    SID_RADIO_LOG_DEBUG("Received IRQ readout ack from the host MCU -> clearing IRQ indication");

    // TODO: ensure we actually are in IRQ state before clearing the indication
#if defined (LOW_POWER_DISABLE) && (LOW_POWER_DISABLE == 0)
    /* Prohibit the system to enter Stop mode since SubGHz events should be processed ASAP from this point */
    if (current_radio_state != SID_PAL_RADIO_SLEEP)
    {
        UTILS_ENTER_CRITICAL_SECTION();
        if (UTIL_TIMER_IsRunning(&lpm_suspend_timer) != FALSE)
        {
            (void)UTIL_TIMER_Stop(&lpm_suspend_timer);
        }
        UTILS_EXIT_CRITICAL_SECTION();
        __COMPILER_BARRIER(); /* Esnure the timer is always processed before the UTIL_LPM_Set<X>Mode() calls */
        UTIL_LPM_SetStopMode((1u << CFG_LPM_HOST_COMM_RADIO), UTIL_LPM_DISABLE);
        UTIL_LPM_SetOffMode((1u << CFG_LPM_HOST_COMM_RADIO), UTIL_LPM_DISABLE);
    }
#endif /* LOW_POWER_DISABLE */
    SID_HOST_COMM_IRQ_CLEAR_EVENT();    /* Release IRQ line, turn off LED (if used) */
    SID_HOST_COMM_IRQ_ENABLE_TRIGGER(); /* Now enable EXTI on IRQ line to catch the GPIO Handshake requests from the host MCU */
    __COMPILER_BARRIER();

    switch (last_indicated_radio_event)
    {
        case STM32WLxx_PAL_RADIO_EVENT_TX_DONE:
            SID_PAL_LOG_DEBUG("Tx done. Len: %u", last_indicated_radio_event_data_len);
            break;

        case STM32WLxx_PAL_RADIO_EVENT_RX_DONE:
            SID_PAL_LOG_DEBUG("Rx done. Len: %u", last_indicated_radio_event_data_len);
            break;

        case STM32WLxx_PAL_RADIO_EVENT_CS_DONE:
#if SID_PAL_LOG_LEVEL >= SID_PAL_LOG_SEVERITY_DEBUG
            {
                int32_t rssi = (int32_t)((int8_t)(last_indicated_radio_event_data_len >> 24));
                uint32_t tx_len = last_indicated_radio_event_data_len & 0x00FFFFFFu;
                uint32_t current_freq_khz = current_radio_freq_hz / 1000u;
                uint32_t mhz_int  = current_freq_khz / 1000u;
                uint32_t mhz_frac = current_freq_khz % 1000u;
                SID_PAL_LOG_DEBUG("Tx of %u bytes aborted, ch busy: %s%ddB, %u.%03uMHz", tx_len, rssi < 0 ? "" : "+", rssi, mhz_int, mhz_frac);
            }
#endif /* SID_PAL_LOG_LEVEL */
            break;

        default:
            /* No logs for other event types */
            break;
    }

    /* Avoid repeated log printouts */
    last_indicated_radio_event = STM32WLxx_PAL_RADIO_EVENT_UNKNOWN;

#if defined (LOW_POWER_DISABLE) && (LOW_POWER_DISABLE == 0)
    /* Allow the system to enter LPM after sleep request is acknowledged */
    if (SID_PAL_RADIO_SLEEP == current_radio_state)
    {
        /* Enable the system to enter Stop mode since we don't expect any SubGHz operations anytime soon */
        UTIL_LPM_SetStopMode((1u << CFG_LPM_HOST_COMM_RADIO), UTIL_LPM_ENABLE);
    }
#endif /* LOW_POWER_DISABLE */

    return SID_RADIO_ERROR_NONE;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_process_sunghz_reset_req(const stm32wlxx_rcp_reset_subghz_req_t * const request)
{
    sid_radio_error_t err = SID_RADIO_ERROR_GENERIC;

    SID_RADIO_LOG_DEBUG("Received SubGHz peipheral reset request");

    do
    {
        if ((request->reset_key_1 != STM32WLxx_RADIO_COMM_SUBGHZ_RESET_KEY_1)
          || (request->reset_key_2 != STM32WLxx_RADIO_COMM_SUBGHZ_RESET_KEY_2))
        {
            SID_PAL_LOG_ERROR("External request to reset SubGHz peripheral rejected - invalid keys (k1: 0x%08x, k2: 0x%08x)", request->reset_key_1, request->reset_key_2);
            err = SID_RADIO_ERROR_FORBIDDEN;
            break;
        }

        err = sid_radio_reset_hardware();
        if (err != SID_RADIO_ERROR_NONE)
        {
            /* Log messages are printed by sid_radio_reset_hardware() */
            break;
        }

        /* err is already set to SID_RADIO_ERROR_NONE by sid_radio_reset_hardware() */
    } while (0);

    /* Indicate reset completion, wether it is successful or not */
    sid_radio_error_t indication_err = _sid_radio_indicate_request_processed(STM32WLxx_RADIO_COMM_OPCODE_SUBGHZ_RESET, err, NULL, NULL, 0u);
    if (indication_err != SID_RADIO_ERROR_NONE)
    {
        SID_PAL_LOG_ERROR("Failed to set IRQ indication upon SubGHz Reset completion. Error %u", (uint32_t)indication_err);
    }

    /* If only the indication error took place - report it. Otherwise report the root error */
    err = SID_RADIO_ERROR_NONE == err ? indication_err : err;

