TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/common/stm32wl55x_radio/Sidewalk/sid_radio.c
    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_process_subghz_sleep_req(const stm32wlxx_rcp_radio_sleep_req_t * const request)
{
    sid_radio_error_t err;

    do
    {
#if defined (LOW_POWER_DISABLE) && (LOW_POWER_DISABLE == 0)
        /* Check if this is a deep sleep request */
        if (request->deep_sleep_en != FALSE)
        {
            if ((request->sleep_duration_us != 0u) || (request->deep_sleep_key_1 != STM32WLxx_RADIO_COMM_DEEP_SLEEP_KEY_1) || (request->deep_sleep_key_2 != STM32WLxx_RADIO_COMM_DEEP_SLEEP_KEY_2))
            {
                SID_PAL_LOG_WARNING("Invalid deep sleep request - ignored");
                err = SID_RADIO_ERROR_INVALID_ARGS;
                break;
            }

            /* Put SubGHz into sleep */
            err = _sid_radio_subghz_sleep(request->sleep_duration_us);
            if (err != SID_RADIO_ERROR_NONE)
            {
                break;
            }

            /* Valid request, enable Standby/Off LPM mode */
            SID_PAL_LOG_INFO("Sidewalk operations ceased");
            UTIL_LPM_SetOffMode((1u << CFG_LPM_HOST_COMM_RADIO), UTIL_LPM_ENABLE);
        }
        else
#endif /* LOW_POWER_DISABLE */
        {
            /* Normal sleep request - just put SubGHz into sleep */
            err = _sid_radio_subghz_sleep(request->sleep_duration_us);
        }
    } while (0);

    /* Indicate reset completion, wether it is successful or not */
    sid_radio_error_t indication_err = _sid_radio_indicate_request_processed(STM32WLxx_RADIO_COMM_OPCODE_SUBGHZ_SLEEP, err, NULL, NULL, 0u);
    if (indication_err != SID_RADIO_ERROR_NONE)
    {
        SID_PAL_LOG_ERROR("Failed to set IRQ indication upon SubGHz Sleep completion. Error %u", (uint32_t)indication_err);
    }

    /* If only the indication error took place - report it. Otherwise report the root error */
    err = SID_RADIO_ERROR_NONE == err ? indication_err : err;

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_process_subghz_standby_req(void)
{
    sid_radio_error_t err;

    err = _sid_radio_subghz_standby();

    /* Indicate reset completion, wether it is successful or not */
    sid_radio_error_t indication_err = _sid_radio_indicate_request_processed(STM32WLxx_RADIO_COMM_OPCODE_SUBGHZ_STANDBY, err, NULL, NULL, 0u);
    if (indication_err != SID_RADIO_ERROR_NONE)
    {
        SID_PAL_LOG_ERROR("Failed to set IRQ indication upon SubGHz Standby completion. Error %u", (uint32_t)indication_err);
    }

    /* If only the indication error took place - report it. Otherwise report the root error */
    err = SID_RADIO_ERROR_NONE == err ? indication_err : err;

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_process_apply_cfg_req(const uint8_t * const frame_data, const uint32_t frame_length)
{
    sid_radio_error_t err = SID_RADIO_ERROR_GENERIC;
    sid_radio_error_t indication_err;

    SID_RADIO_LOG_DEBUG("Received SubGHz configuration update");

    const stm32wlxx_rcp_apply_cfg_t * const apply_cfg_frame = (stm32wlxx_rcp_apply_cfg_t *)(void *)frame_data;
    assert_param(sizeof(apply_cfg_frame->radio_config) == sizeof(WL55_cfg));
    do
    {
        /* Validity check */
        if (frame_length != sizeof(*apply_cfg_frame))
        {
            SID_PAL_LOG_ERROR("Failed to apply SubGHz Radio configuration. Received %u bytes but expected %u", frame_length, sizeof(*apply_cfg_frame));
            err = SID_RADIO_ERROR_WRONG_SIZE;
            break;
        }

        /* Store the updated config */
        UTILS_ENTER_CRITICAL_SECTION();
        SID_STM32_UTIL_fast_memcpy(&WL55_cfg, &apply_cfg_frame->radio_config, sizeof(WL55_cfg));
        valid_subghz_cfg_received = TRUE;
#if STM32WLXX_EXT_IFC_ENABLE_USER_DATA_TRANSFER
        (void)osThreadFlagsSet(udt_ctx.task, SID_RADIO_UDT_DRIVER_READY_FLAG);
#endif /* STM32WLXX_EXT_IFC_ENABLE_USER_DATA_TRANSFER */
        UTILS_EXIT_CRITICAL_SECTION();

        err = SID_RADIO_ERROR_NONE;
    } while (0);

    if (apply_cfg_frame->need_ack != FALSE)
    {
        /* Indicate request completion, wether it is successful or not */
        indication_err = _sid_radio_indicate_request_processed(STM32WLxx_RADIO_COMM_OPCODE_SEND_CONFIG, err, NULL, NULL, 0u);
        if (indication_err != SID_RADIO_ERROR_NONE)
        {
            SID_PAL_LOG_ERROR("Failed to acknowledge SubGHz Radio Configuration request. Error %u", (uint32_t)indication_err);
        }
    }
    else
    {
        indication_err = SID_RADIO_ERROR_NONE;
    }

    /* Print log info after acknowledgment is scheduled with SPI to avoid delaying the data transfer by logs */
    if (SID_RADIO_ERROR_NONE == err)
    {
        SID_PAL_LOG_INFO("Received SubGHz configuration");
    }

    /* If only the indication error took place - report it. Otherwise report the root error */
    err = SID_RADIO_ERROR_NONE == err ? indication_err : err;

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_process_sunghz_base_init_req(const stm32wlxx_rcp_apply_base_hw_cfg_req_t * const request)
{
    sid_radio_error_t err = SID_RADIO_ERROR_GENERIC;
    sid_radio_error_t indication_err;

    SID_RADIO_LOG_DEBUG("Got SubGHz base HW init request");
    do
    {
        if (FALSE == valid_subghz_cfg_received)
        {
            SID_PAL_LOG_ERROR("SubGHz hardware init requested before host MCU supplied SubGHz config");
            err = SID_RADIO_ERROR_INVALID_STATE;
            break;
        }

        err = sid_radio_subghz_init();
    } while (0);


    if (request->need_ack != FALSE)
    {
        /* Indicate reset completion, whether it is successful or not */
        indication_err = _sid_radio_indicate_request_processed(STM32WLxx_RADIO_COMM_OPCODE_APPLY_BASE_HW_CONFIG, err, NULL, NULL, 0u);
        if (indication_err != SID_RADIO_ERROR_NONE)
        {
            SID_PAL_LOG_ERROR("Failed to set IRQ indication upon SubGHz base HW init completion. Error %u", (uint32_t)indication_err);
        }
    }
    else
    {
        indication_err = SID_RADIO_ERROR_NONE;
    }

    /* If only the indication error took place - report it. Otherwise report the root error */
    err = SID_RADIO_ERROR_NONE == err ? indication_err : err;

