TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/common/stm32wl55x_radio/Sidewalk/sid_radio.c
    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_process_set_tx_power(const stm32wlxx_rcp_set_tx_power_req_t * const request)
{
    sid_radio_error_t err = SID_RADIO_ERROR_GENERIC;

    do
    {
        SID_RADIO_LOG_DEBUG("SubGHz Set Tx Power request: %s%ddB", request->target_tx_power >= 0 ? "+" : "", request->target_tx_power); /* tiny_vsnprintf may not support %+d */

        if (FALSE == valid_subghz_cfg_received)
        {
            SID_PAL_LOG_WARNING("Attempt to configure SubGHz Tx power before the config is sent");
            err = SID_RADIO_ERROR_INVALID_STATE;
            break;
        }

        err = _sid_radio_set_tx_power(request); /* Don't do explicit casting to (const stm32wlxx_radio_pa_setup_t * const) to detect any possible future deviations of stm32wlxx_rcp_set_tx_power_req_t from stm32wlxx_radio_pa_setup_t definition */

        if (err != SID_RADIO_ERROR_NONE)
        {
            SID_PAL_LOG_ERROR("Failed to set SubGHz Tx power to %s%ddB. Error %u", request->target_tx_power >= 0 ? "+" : "", request->target_tx_power, err); /* tiny_vsnprintf may not support %+d */
        }
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_process_set_subghz_tx_buf_req(const uint8_t * const frame_data, const uint32_t available_frame_length, const uint32_t full_frame_length)
{
    sid_radio_error_t err;
    HAL_StatusTypeDef hal_err;

    assert_param(frame_data != NULL);
    const stm32wlxx_rcp_set_subghz_tx_buf_t * const set_tx_buf_frame = (stm32wlxx_rcp_set_subghz_tx_buf_t *)(void *)frame_data;
#if DEBUG
    uint32_t calculated_full_frame_length = set_tx_buf_frame->write_length + sizeof(set_tx_buf_frame->opcode) + sizeof(set_tx_buf_frame->write_length);
    if (calculated_full_frame_length < sizeof(stm32wlxx_radio_comm_spi_frame_t))
    {
        calculated_full_frame_length = sizeof(stm32wlxx_radio_comm_spi_frame_t);
    }
    assert_param(full_frame_length == calculated_full_frame_length);
#endif

    /* See if we can do a (partial) upload to the SubGHz Tx buffer */
    const uint32_t available_subghz_tx_data = available_frame_length - offsetof(stm32wlxx_rcp_set_subghz_tx_buf_t, tx_buf_content);
    const uint32_t can_upload_size = available_subghz_tx_data - radio_tx_buf_upload_offset;
    assert_param(available_subghz_tx_data >= radio_tx_buf_upload_offset);

    if (can_upload_size > 0u)
    {
        do
        {
            SID_RADIO_LOG_DEBUG("Set SubGHz Tx buf: add %u bytes, offset %u", can_upload_size, radio_tx_buf_upload_offset);

            hal_err = HAL_SUBGHZ_WriteBuffer(&hsubghz, (uint8_t)radio_tx_buf_upload_offset, (uint8_t *)&set_tx_buf_frame->tx_buf_content[radio_tx_buf_upload_offset], can_upload_size);
            if (hal_err != HAL_OK)
            {
                SID_RADIO_LOG_ERROR("Failed to write %u bytes to SubGHz buffer. HAL_SUBGHZ err: 0x%x", set_tx_buf_frame->write_length, hal_err);
                err = SID_RADIO_ERROR_HARDWARE;
                break;
            }

            /* Done, advance the upload pointer */
            radio_tx_buf_upload_offset += can_upload_size;

            if (radio_tx_buf_upload_offset == set_tx_buf_frame->write_length)
            {
                /* Tx buffer upload completed */
                SID_RADIO_LOG_DEBUG("Set SubGHz Tx buf: done, total %u bytes", set_tx_buf_frame->write_length);
                radio_tx_buf_upload_offset = 0u; /* Reset for the next uploads */
                last_indicated_radio_event_data_len = set_tx_buf_frame->write_length;
            }

            err = SID_RADIO_ERROR_NONE;
        } while (0);
    }
    else
    {
        /* Not enough data to upload, keep waiting for addiiotnal incoming data */
        err = SID_RADIO_ERROR_NONE;
    }

    if (err != SID_RADIO_ERROR_NONE)
    {
        SID_PAL_LOG_ERROR("Failed to set SubGHz Tx buffer. Bytes written: %u, expected: %u, error %u", radio_tx_buf_upload_offset, set_tx_buf_frame->write_length, err);
    }

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_process_start_tx_req(void)
{
    sid_radio_error_t err;

    do
    {
        if (FALSE == valid_subghz_cfg_received)
        {
            SID_PAL_LOG_WARNING("Attempt to start Tx before SubGHz config is sent");
            err = SID_RADIO_ERROR_INVALID_STATE;
            break;
        }

        if (STM32WLxx_SUBGHZ_RADIO_MODEM_MODE_FSK == current_modem_mode)
        {
            err = _sid_radio_start_tx(WL55_cfg.fsk_cfg.tx_timeout);
        }
        else if (STM32WLxx_SUBGHZ_RADIO_MODEM_MODE_LORA == current_modem_mode)
        {
            err = _sid_radio_start_tx(WL55_cfg.lora_cfg.tx_timeout);
        }
        else
        {
            err = SID_RADIO_ERROR_INVALID_STATE;
        }

        /* As the timings are not critical anymore provide some postponed logs */
        _sid_radio_log_mod_params_change();

        if (err != SID_RADIO_ERROR_NONE)
        {
            SID_PAL_LOG_ERROR("Failed to start SubGHz Tx. Error %u. Modem mode: %u", (uint32_t)err, current_modem_mode);
        }
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline void _sid_radio_log_mod_params_change(void)
{
    if (mod_params_upd_indication_pending != FALSE)
    {
        if (STM32WLxx_SUBGHZ_RADIO_MODEM_MODE_FSK == current_modem_mode)
        {
            SID_PAL_LOG_DEBUG("FSK mod params updated. bw:0x%02X shp:0x%02X br:%u fdev: %u",
                              WL55_cfg.fsk_cfg.mod.bandwidth, WL55_cfg.fsk_cfg.mod.shaping, WL55_cfg.fsk_cfg.mod.bit_rate, WL55_cfg.fsk_cfg.mod.freq_dev);
        }
        else if (STM32WLxx_SUBGHZ_RADIO_MODEM_MODE_LORA == current_modem_mode)
        {
            SID_PAL_LOG_DEBUG("LoRa mod params updated. bw:0x%02X cr:0x%02X sf:0x%02X",
                              WL55_cfg.lora_cfg.mod.bandwidth, WL55_cfg.lora_cfg.mod.coding_rate, WL55_cfg.lora_cfg.mod.spreading_factor);
        }
        else
        {
            /* Nothing to do */
        }

