TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/common/stm32wl55x_radio/Sidewalk/sid_radio.c
        mod_params_upd_indication_pending = FALSE;
    }
}

/*----------------------------------------------------------------------------*/

static void _sid_radio_on_radio_timeout_event(void * context)
{
    sid_radio_error_t                      err;
    stm32wlxx_pal_radio_events_t           radio_event = STM32WLxx_PAL_RADIO_EVENT_UNKNOWN;
    stm32wlxx_radio_comm_spi_frame_t       spi_reply_frame;
    stm32wlxx_rcp_irq_status_t * const     irq_status_reply     = &spi_reply_frame.payload.irq_status;
    stm32wlxx_subghz_irq_details_t * const irq_details          = &irq_status_reply->subghz_irq_details;
    uint32_t                               irq_disarmed         = FALSE;
    int8_t                                 rssi_now             = 0;
    uint32_t                               radio_state_on_entry;
    uint32_t                               event_timestamp_s;
    uint32_t                               event_timestamp_us;

    (void)context;

    do
    {
        SID_RADIO_LOG_DEBUG("STM32WLxx_SUBGHZ_SIMULATED_IRQ_TIMEOUT");

        if ((current_radio_state != SID_PAL_RADIO_RX) && (current_radio_state != SID_PAL_RADIO_TX))
        {
            err = SID_RADIO_ERROR_INVALID_STATE;
            break;
        }

        /* Run in a critical section to avoid interference with radio IRQ processing */
        UTILS_ENTER_CRITICAL_SECTION();
        {
            /* Capture the event timestamp */
            event_timestamp_s = TIMER_IF_GetTimeUs(&event_timestamp_us);
            __COMPILER_BARRIER();

            /* Check if NVIC indicates an active SubGHz IRQ */
            if (HAL_NVIC_GetActive(SUBGHZ_Radio_IRQn) != FALSE)
            {
                /* There's an active radio IRQ, terminate processing */
                UTILS_EXIT_CRITICAL_SECTION();
                err = SID_RADIO_ERROR_INVALID_STATE;
                break;
            }

            /* There's no active IRQ at the moment - temporarily deactivate IRQ pin */
            HAL_NVIC_DisableIRQ(SUBGHZ_Radio_IRQn);
            irq_disarmed = TRUE;
            __COMPILER_BARRIER();

#if SID_HOST_COMM_PROCESSING_DELAY_PROFILING
            /* Indicate the actual radio IRQ event for profiling */
            SID_PDP_RADIO_IRQ_ACTIVITY_GPIO_Port->BSRR = SID_PDP_RADIO_IRQ_ACTIVITY_Pin;
#endif /* SID_HOST_COMM_PROCESSING_DELAY_PROFILING */

        }
        /* Done with the critical processing */
        UTILS_EXIT_CRITICAL_SECTION();

        /* Set default follow-up data length to zero */
        irq_status_reply->followup_payload_len = 0u;

        /* Capture real-time RSSI before putting the radio to Standby */
        if (WL55_cfg.drv_cfg.cad_exit_mode != STM32WLxx_RADIO_CAD_EXIT_MODE_NONE)
        {
            (void)_sid_radio_subghz_get_rssi(&rssi_now);
        }
        __COMPILER_BARRIER(); /* Ensure RSSI readout takes place before the radio is put to Standby */

        /* Put the radio to Standby state */
        err = _sid_radio_subghz_set_standby(STDBY_XOSC); /* Use STDBY_XOSC to save on oscillator restart time (e.g. when Tx follows right after CS) */
        if (err != SID_RADIO_ERROR_NONE)
        {
            current_radio_state = SID_PAL_RADIO_UNKNOWN;
            err = SID_RADIO_ERROR_HARDWARE;
            break;
        }

        /* Turn off FEM as we don't need it any longer */
        (void)_sid_radio_subghz_set_radio_mode(STM32WLxx_RADIO_FRONTEND_MODE_OFF);

        radio_state_on_entry = current_radio_state;
        current_radio_state  = SID_PAL_RADIO_STANDBY;
        __COMPILER_BARRIER();

        if (SID_PAL_RADIO_RX == radio_state_on_entry)
        {
            if ((WL55_cfg.drv_cfg.cad_exit_mode != STM32WLxx_RADIO_CAD_EXIT_MODE_NONE) && (STM32WLxx_SUBGHZ_RADIO_MODEM_MODE_FSK == current_modem_mode))
            {
                /* Restore the default IRQ mask for FSK after any type of Carrier Sense */
                err = _sid_radio_enable_default_irqs();
                if (err != SID_RADIO_ERROR_NONE)
                {
                    SID_RADIO_LOG_ERROR("Failed to set IRQ mask for FSK mode");
                    break;
                }
            }

            /* Process Carrier Sense/CAD events */
            if ((STM32WLxx_RADIO_CAD_EXIT_MODE_CS_LBT == WL55_cfg.drv_cfg.cad_exit_mode) && (STM32WLxx_SUBGHZ_RADIO_MODEM_MODE_FSK == current_modem_mode))
            {
                WL55_cfg.drv_cfg.cad_exit_mode = STM32WLxx_RADIO_CAD_EXIT_MODE_NONE;

                if (rssi_now >= STM32WLxx_RADIO_COMM_FSK_CS_RSSI_THRESHOLD)
                {
                    /* RSSI is above the threshold - radio channel is busy */
                    radio_event = STM32WLxx_PAL_RADIO_EVENT_CS_DONE;
                    err = SID_RADIO_ERROR_NONE;

                    /* Store the RSSI on the channel */
                    irq_details->received_packet_info.fsk_rx_packet_status.rssi_sync = rssi_now;

                    /* Append RSSI debug info to the unsued MSB of the Tx payload length */
                    last_indicated_radio_event_data_len = (last_indicated_radio_event_data_len & 0x00FFFFFFu) |  ((uint32_t)rssi_now << 24);
                }
                else
                {
                    /* CS detected no activity - selected radio channel is free */
#  if HALO_ENABLE_DIAGNOSTICS
                    radio_event = STM32WLxx_PAL_RADIO_EVENT_CS_TIMEOUT;
                    err = SID_RADIO_ERROR_NONE;
#  else
                    /* Carrier Sense for FSK ended with timeout - radio channel is free and we can proceed with Tx */
                    radio_event = STM32WLxx_PAL_RADIO_EVENT_UNKNOWN;

                    /* Start Tx */
                    err = _sid_radio_start_tx(STM32WLxx_RADIO_COMM_CAD_DEFAULT_TX_TIMEOUT);
                    if (err != SID_RADIO_ERROR_NONE)
                    {
                        /* Logs provided by _sid_radio_start_tx() */
                        break;
                    }
#  endif /* HALO_ENABLE_DIAGNOSTICS */
                }
            }
            else if (STM32WLxx_RADIO_CAD_EXIT_MODE_NONE == WL55_cfg.drv_cfg.cad_exit_mode)
            {
                /* This was a normal Rx, not CS */
                radio_event = STM32WLxx_PAL_RADIO_EVENT_RX_TIMEOUT;
                err = SID_RADIO_ERROR_NONE;
            }
            else
            {
                /* Nothing to do here - some sort of CS we're not interested in */
                err = SID_RADIO_ERROR_NONE;
            }
        }
        else /* if (SID_PAL_RADIO_TX == radio_state_on_entry) */
        {
            radio_event = STM32WLxx_PAL_RADIO_EVENT_TX_TIMEOUT;
            err = SID_RADIO_ERROR_NONE;
        }
    } while (0);

    if ((SID_RADIO_ERROR_NONE == err) && (STM32WLxx_PAL_RADIO_EVENT_UNKNOWN != radio_event))
    {
        /* Notify the radio about the event */
        err = _sid_radio_report_event(radio_event, &spi_reply_frame, event_timestamp_s, event_timestamp_us);
    }
    else
    {
#if SID_HOST_COMM_PROCESSING_DELAY_PROFILING
        /* Clear radio IRQ event indication */
        SID_PDP_RADIO_IRQ_ACTIVITY_GPIO_Port->BRR = SID_PDP_RADIO_IRQ_ACTIVITY_Pin;
#endif /* SID_HOST_COMM_PROCESSING_DELAY_PROFILING */
    }

    /* Restore IRQ pin settings */
    if (irq_disarmed != FALSE)
    {
        HAL_NVIC_EnableIRQ(SUBGHZ_Radio_IRQn);
    }
}

