TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/common/stm32wl55x_radio/Sidewalk/sid_radio.c
/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_start_radio_timeout_mon(const uint32_t timeout_us)
{
    sid_radio_error_t err;
    UTIL_TIMER_Status_t timer_err;

    do
    {
        if ((0u == timeout_us) || (SID_RADIO_INFINITE_TIME == timeout_us))
        {
            /* No need to start the countdown */
            err = SID_RADIO_ERROR_NONE;
            break;
        }

        /* Ensure the delay will be at lest the requested amount of the SubGHz ticks */
        const uint32_t rx_timeout = timeout_us + STM32WLxx_SUBGHZ_TICKS_TO_US(1u);

        timer_err = UTIL_TIMER_StartWithPeriodUs(&radio_timeout_mon, rx_timeout);
        if (timer_err != UTIL_TIMER_OK)
        {
            err = SID_RADIO_ERROR_HARDWARE;
            break;
        }

        err = SID_RADIO_ERROR_NONE;
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

#if defined (LOW_POWER_DISABLE) && (LOW_POWER_DISABLE == 0)
SID_STM32_SPEED_OPTIMIZED static void _sid_radio_lpm_suspend_timer_cb(void * context)
{
    (void)context;

    UTILS_ENTER_CRITICAL_SECTION();
    if (FALSE == valid_subghz_cfg_received)
    {
        /* Timer has elapsed and still there's no valid config received - put the radio into Sleep to save power */
        sid_radio_error_t err = _sid_radio_subghz_sleep(0u);
        if (err != SID_RADIO_ERROR_NONE)
        {
            SID_PAL_LOG_WARNING("Failed to put SubGHz into Sleep. Error %u", (uint32_t)err);

            /* Restart the timer to try to put the radio into sleep a bit later */
            (void)UTIL_TIMER_StartWithPeriod(&lpm_suspend_timer, SID_RADIO_LPM_RESUME_RETRY_PERIOD_MS);
        }
        else
        {
            /* Enable the system to enter LPM as well */
            UTIL_LPM_SetStopMode((1u << CFG_LPM_HOST_COMM_RADIO), UTIL_LPM_ENABLE);
            UTIL_LPM_SetOffMode((1u << CFG_LPM_HOST_COMM_RADIO), UTIL_LPM_ENABLE);
        }
    }
    else if (SID_PAL_RADIO_SLEEP == current_radio_state)
    {
        /* Enable the system to enter Stop since no activity took place, but driver is initialized */
        UTIL_LPM_SetStopMode((1u << CFG_LPM_HOST_COMM_RADIO), UTIL_LPM_ENABLE);
    }
    else
    {
        /* Nothing to do here, keep LPM config as is */
    }
    UTILS_EXIT_CRITICAL_SECTION();
}
#endif /* LOW_POWER_DISABLE */

/*----------------------------------------------------------------------------*/

#if STM32WLXX_EXT_IFC_ENABLE_USER_DATA_TRANSFER
SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_udt_init(void)
{
    sid_radio_error_t err = SID_RADIO_ERROR_GENERIC;

    do
    {
        /* Create UDT suspend timer */
        UTIL_TIMER_Status_t timer_err = UTIL_TIMER_Create(&udt_ctx.suspend_timer, 0, UTIL_TIMER_ONESHOT, _sid_radio_udt_suspend_timer_cb, NULL);
        if (timer_err != UTIL_TIMER_OK)
        {
            SID_PAL_LOG_ERROR("Can't create UDT suspend timer. Error %d", (int32_t)timer_err);
            err = SID_RADIO_ERROR_HARDWARE;
            break;
        }

        /* Create UDT message queue */
        if (NULL == udt_ctx.outbound_msg_queue)
        {
            udt_ctx.outbound_msg_queue = osMessageQueueNew(SID_RADIO_UDT_OUT_MSG_QUEUE_LEN, sizeof(sid_host_comm_out_udt_msg_desc_t), NULL);
            if (NULL == udt_ctx.outbound_msg_queue)
            {
                SID_PAL_LOG_ERROR("Can't create UDT message queue. No memory");
                err = SID_RADIO_ERROR_NOMEM;
                break;
            }
        }

        /* Create the task that will handle the UDT */
        if (NULL == udt_ctx.task)
        {
            udt_ctx.task = osThreadNew(_user_data_transfer_thread, NULL, &wlxx_user_data_transfer_thread_attributes);
            if (NULL == udt_ctx.task)
            {
                SID_PAL_LOG_ERROR("Can't create UDT processing thread. No memory");
                err = SID_RADIO_ERROR_NOMEM;
                break;
            }
        }

        err = SID_RADIO_ERROR_NONE;
    } while (0);

    return err;
}
#endif /* STM32WLXX_EXT_IFC_ENABLE_USER_DATA_TRANSFER */

/*----------------------------------------------------------------------------*/

#if STM32WLXX_EXT_IFC_ENABLE_USER_DATA_TRANSFER
SID_STM32_SPEED_OPTIMIZED static inline sid_radio_error_t _sid_radio_udt_setup_session(const uint32_t sleep_duration_us)
{
    sid_radio_error_t err = SID_RADIO_ERROR_GENERIC;
    UTIL_TIMER_Status_t timer_err;

    do
    {
        /* Ensure UDT cut-off timer is stopped. Run in a crtitical sections to avoid race conditions with timer ineterrupt */
        UTILS_ENTER_CRITICAL_SECTION();
        if (UTIL_TIMER_IsRunning(&udt_ctx.suspend_timer) != FALSE)
        {
            timer_err = UTIL_TIMER_Stop(&udt_ctx.suspend_timer);
        }
        else
        {
            /* No need to stop timer */
            timer_err = UTIL_TIMER_OK;
        }
        UTILS_EXIT_CRITICAL_SECTION();
        if (timer_err != UTIL_TIMER_OK)
        {
            /* Failed to stop the timer, can't proceed */
            udt_ctx.udt_enabled = FALSE;
            err = SID_RADIO_ERROR_HARDWARE;
            SID_PAL_LOG_ERROR("UDT - failed to stop cut-off timer. Error %d", (int32_t)timer_err);
            break;
        }

        /* Determine if UDT operations can be enabled during the planned sleep period */
        if ((0u == sleep_duration_us) || (UINT32_MAX == sleep_duration_us))
        {
            /* This is a special case - radio is put into Sleep for undefined amount of time (e.g. due to sid_stop() call) */
            /* Allow UDT task to run */
            udt_ctx.udt_enabled = TRUE;
            __COMPILER_BARRIER();
            (void)osThreadFlagsSet(udt_ctx.task, SID_RADIO_UDT_TRANSFER_ENABLED_FLAG);
        }
        else if (sleep_duration_us > SID_RADIO_UDT_SUSPEND_RESERVED_TIME_US)
        {
            /* Schedule the UDT cut-off timer */
            uint32_t cutoff_delay_ms = (sleep_duration_us - SID_RADIO_UDT_SUSPEND_RESERVED_TIME_US) / 1000u;

            /* Ensure we can schedule the cut-off event properly */
            if (cutoff_delay_ms >= UTIL_TimerDriver.GetMinimumTimeout())
            {
                /* Configure cut-off timer */
                timer_err =  UTIL_TIMER_SetPeriod(&udt_ctx.suspend_timer, cutoff_delay_ms);
                if (timer_err != UTIL_TIMER_OK)
                {
                    udt_ctx.udt_enabled = FALSE;
                    err = SID_RADIO_ERROR_HARDWARE;
                    SID_PAL_LOG_ERROR("UDT - failed to set cut-off timer period. Error %d", (int32_t)timer_err);
                    break;
                }

                /* Start the cut-off countdown */
                timer_err = UTIL_TIMER_Start(&udt_ctx.suspend_timer);
                if (timer_err != UTIL_TIMER_OK)
                {
                    udt_ctx.udt_enabled = FALSE;
                    err = SID_RADIO_ERROR_HARDWARE;
                    SID_PAL_LOG_ERROR("UDT - failed to start cut-off timer. Error %d", (int32_t)timer_err);
                    break;
                }

                /* Allow UDT task to run */
                udt_ctx.udt_enabled = TRUE;
                __COMPILER_BARRIER();
                (void)osThreadFlagsSet(udt_ctx.task, SID_RADIO_UDT_TRANSFER_ENABLED_FLAG);
            }
            else
            {
                /* Can't meet the constraints of UTIL_TIMER, skipping UDT */
                udt_ctx.udt_enabled = FALSE;
                SID_RADIO_LOG_WARNING("UDT skipped due to constraints of UTIL_TIMER");
            }
        }
        else
        {
            /* Not enough time for UDT */
            udt_ctx.udt_enabled = FALSE;
            SID_RADIO_LOG_WARNING("UDT skipped due to insufficient sleep duration");
        }

        /* Everything is fine if we got here */
        err = SID_RADIO_ERROR_NONE;
    } while (0);

