TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/common/stm32wl55x_radio/Sidewalk/sid_radio.c
    return err;
}
#endif /* STM32WLXX_EXT_IFC_ENABLE_USER_DATA_TRANSFER */

/* Global function definitions -----------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_radio_error_t sid_radio_process_app_frame(const uint8_t * const frame_data, const uint32_t available_frame_length, const uint32_t full_frame_length)
{
    sid_radio_error_t err = SID_RADIO_ERROR_GENERIC;

    if ((NULL == frame_data) || (0u == full_frame_length))
    {
        SID_RADIO_LOG_ERROR("SID Radio App frame cannot be null");
        return SID_RADIO_ERROR_INVALID_ARGS;
    }

    const stm32wlxx_radio_comm_spi_frame_t * const frame = (stm32wlxx_radio_comm_spi_frame_t *)(void *)frame_data; /* Cast pointer to conveniently access frame elements */

    switch (frame->opcode)
    {
        case STM32WLxx_RADIO_COMM_OPCODE_DUMMY_DATA:
            {
#if SID_RADIO_EXTRA_LOGGING
                if (available_frame_length == full_frame_length)
                {
                    uint32_t actual_payload_length = full_frame_length - (sizeof(*frame) + sizeof(frame->payload));
                    SID_RADIO_LOG_DEBUG("Received %u bytes of dummy payload, skipping", actual_payload_length);
                }
#endif /* SID_RADIO_EXTRA_LOGGING */
                err = SID_RADIO_ERROR_NONE;
            }
            break;

        case STM32WLxx_RADIO_COMM_OPCODE_LONG_DATA_START:
        case STM32WLxx_RADIO_COMM_OPCODE_LONG_DATA_CONT:
            /* This should never happen as Long Data Transfer wrapping shall be demangled before the data gets here */
            SID_RADIO_LOG_ERROR("Unexpectedly received Long Data Transfer command (OpCode 0x%x)", (uint32_t)frame->opcode);
            err = SID_RADIO_ERROR_UNEXPECTED_DATA;
            break;

        case STM32WLxx_RADIO_COMM_OPCODE_IRQ_STATUS:
            assert_param(available_frame_length == sizeof(stm32wlxx_radio_comm_spi_frame_t));
            SID_RADIO_LOG_DEBUG("Host MCU performed IRQ status readout");
            err = SID_RADIO_ERROR_NONE;
            break;

        case STM32WLxx_RADIO_COMM_OPCODE_IRQ_ACK:
            assert_param(available_frame_length == sizeof(stm32wlxx_radio_comm_spi_frame_t));
            err = _sid_radio_process_irq_ack();
            break;

        case STM32WLxx_RADIO_COMM_OPCODE_SUBGHZ_RESET:
            assert_param(available_frame_length == sizeof(stm32wlxx_radio_comm_spi_frame_t));
            err = _sid_radio_process_sunghz_reset_req(&frame->payload.subghz_reset_req);
            break;

        case STM32WLxx_RADIO_COMM_OPCODE_SUBGHZ_SLEEP:
            assert_param(available_frame_length == sizeof(stm32wlxx_radio_comm_spi_frame_t));
            err = _sid_radio_process_subghz_sleep_req(&frame->payload.radio_sleep);
            break;

        case STM32WLxx_RADIO_COMM_OPCODE_SUBGHZ_STANDBY:
            assert_param(available_frame_length == sizeof(stm32wlxx_radio_comm_spi_frame_t));
            err = _sid_radio_process_subghz_standby_req();
            break;

        case STM32WLxx_RADIO_COMM_OPCODE_SEND_CONFIG:
            if (available_frame_length == full_frame_length)
            {
                err = _sid_radio_process_apply_cfg_req(frame_data, full_frame_length);
            }
            else
            {
                /* Just wait for the whole config data to arrive */
#if SID_RADIO_EXTRA_LOGGING
                SID_RADIO_LOG_DEBUG("Received %u out of %u bytes of radio config", available_frame_length, full_frame_length);
#endif /* SID_RADIO_EXTRA_LOGGING */
                err = SID_RADIO_ERROR_NONE;
            }
            break;

        case STM32WLxx_RADIO_COMM_OPCODE_APPLY_BASE_HW_CONFIG:
            assert_param(available_frame_length == sizeof(stm32wlxx_radio_comm_spi_frame_t));
            err = _sid_radio_process_sunghz_base_init_req(&frame->payload.apply_hw_cfg);
            break;

        case STM32WLxx_RADIO_COMM_OPCODE_SUBGHZ_SET_MODEM_MODE:
            assert_param(available_frame_length == sizeof(stm32wlxx_radio_comm_spi_frame_t));
            err = _sid_radio_set_modem_mode(&frame->payload.set_modem_mode);
            break;

        case STM32WLxx_RADIO_COMM_OPCODE_SUBGHZ_SET_FREQUENCY:
            assert_param(available_frame_length == sizeof(stm32wlxx_radio_comm_spi_frame_t));
            err = _sid_radio_set_frequency(&frame->payload.set_frequency);
            break;

        case STM32WLxx_RADIO_COMM_OPCODE_SUBGHZ_SET_TX_POWER:
            assert_param(available_frame_length == sizeof(stm32wlxx_radio_comm_spi_frame_t));
            err = _sid_radio_process_set_tx_power(&frame->payload.set_tx_power);
            break;

        case STM32WLxx_RADIO_COMM_OPCODE_SUBGHZ_SET_SYNCWORD:
            assert_param(available_frame_length == sizeof(stm32wlxx_radio_comm_spi_frame_t));
            err = _sid_radio_set_sync_word(&frame->payload.set_sync_word);
            break;

        case STM32WLxx_RADIO_COMM_OPCODE_SET_LORA_SYMB_TIMEOUT:
            assert_param(available_frame_length == sizeof(stm32wlxx_radio_comm_spi_frame_t));
            err = _sid_radio_set_lora_symbol_timeout(&frame->payload.set_lora_symb_timeout);
            break;

        case STM32WLxx_RADIO_COMM_OPCODE_SET_LORA_MOD_PARAMS:
            assert_param(available_frame_length == sizeof(stm32wlxx_radio_comm_spi_frame_t));
            err = _sid_radio_process_set_lora_mod_params_req(&frame->payload.set_lora_mod_params);
            break;

        case STM32WLxx_RADIO_COMM_OPCODE_SET_LORA_PKT_PARAMS:
            assert_param(available_frame_length == sizeof(stm32wlxx_radio_comm_spi_frame_t));
            err = _sid_radio_set_lora_packet_params(&frame->payload.set_lora_pkt_params);
            break;

        case STM32WLxx_RADIO_COMM_OPCODE_SET_LORA_CAD_PARAMS:
            assert_param(available_frame_length == sizeof(stm32wlxx_radio_comm_spi_frame_t));
            err = _sid_radio_set_lora_cad_params(&frame->payload.set_lora_cad_params);
            break;

        case STM32WLxx_RADIO_COMM_OPCODE_SET_FSK_MOD_PARAMS:
            assert_param(available_frame_length == sizeof(stm32wlxx_radio_comm_spi_frame_t));
            err = _sid_radio_process_set_fsk_mod_params_req(&frame->payload.set_fsk_mod_params);
            break;

