TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/common/stm32wl55x_radio/Sidewalk/sid_radio.c
        case STM32WLxx_RADIO_COMM_OPCODE_SET_FSK_PKT_PARAMS:
            assert_param(available_frame_length == sizeof(stm32wlxx_radio_comm_spi_frame_t));
            err = _sid_radio_process_set_fsk_packet_params_req(&frame->payload.set_fsk_pkt_params);
            break;

        case STM32WLxx_RADIO_COMM_OPCODE_SUBGHZ_SET_TX_BUF:
            err = _sid_radio_process_set_subghz_tx_buf_req(frame_data, available_frame_length, full_frame_length);
            break;

        case STM32WLxx_RADIO_COMM_OPCODE_SUBGHZ_START_TX:
            assert_param(available_frame_length == sizeof(stm32wlxx_radio_comm_spi_frame_t));
            err = _sid_radio_process_start_tx_req();
            break;

        case STM32WLxx_RADIO_COMM_OPCODE_SUBGHZ_START_RX:
            assert_param(available_frame_length == sizeof(stm32wlxx_radio_comm_spi_frame_t));
            err = _sid_radio_start_rx(&frame->payload.start_rx_params);
            break;

        case STM32WLxx_RADIO_COMM_OPCODE_START_CARRIER_SENSE:
            assert_param(available_frame_length == sizeof(stm32wlxx_radio_comm_spi_frame_t));
            err = _sid_radio_start_fsk_carrier_sense(&frame->payload.start_fsk_cs_params);
            break;

        case STM32WLxx_RADIO_COMM_OPCODE_USER_DATA:
#if STM32WLXX_EXT_IFC_ENABLE_USER_DATA_TRANSFER
            err = _sid_radio_process_user_data_upload(frame_data, available_frame_length, full_frame_length);
#else
            SID_PAL_LOG_WARNING("Command USER_DATA is not supported");
            err = SID_RADIO_ERROR_NOT_SUPPORTED;
#endif /* STM32WLXX_EXT_IFC_ENABLE_USER_DATA_TRANSFER */
            break;

        case STM32WLxx_RADIO_COMM_OPCODE_START_CW_TX:
#if HALO_ENABLE_DIAGNOSTICS
            assert_param(available_frame_length == sizeof(stm32wlxx_radio_comm_spi_frame_t));
            err = _sid_radio_start_cw_tx(&frame->payload.start_cw_tx_params);
#else
            SID_PAL_LOG_WARNING("Command START_CW_TX is not supported");
            err = SID_RADIO_ERROR_NOT_SUPPORTED;
#endif /* HALO_ENABLE_DIAGNOSTICS */
            break;

        case STM32WLxx_RADIO_COMM_OPCODE_START_INFINITE_PBL_TX:
#if HALO_ENABLE_DIAGNOSTICS
            assert_param(available_frame_length == sizeof(stm32wlxx_radio_comm_spi_frame_t));
            err = _sid_radio_start_infinite_preamble_tx(&frame->payload.start_inf_pbl_tx_params);
#else
            SID_PAL_LOG_WARNING("Command START_INFINITE_PBL_TX is not supported");
            err = SID_RADIO_ERROR_NOT_SUPPORTED;
#endif /* HALO_ENABLE_DIAGNOSTICS */

        case STM32WLxx_RADIO_COMM_OPCODE_START_CONTINUOUS_RX:
#if HALO_ENABLE_DIAGNOSTICS
            assert_param(available_frame_length == sizeof(stm32wlxx_radio_comm_spi_frame_t));
            err = _sid_radio_start_continuous_rx();
#else
            SID_PAL_LOG_WARNING("Command START_CONTINIOUS_RX is not supported");
            err = SID_RADIO_ERROR_NOT_SUPPORTED;
#endif /* HALO_ENABLE_DIAGNOSTICS */
            break;

        case STM32WLxx_RADIO_COMM_OPCODE_SET_RX_DUTY_CYCLE:
#if HALO_ENABLE_DIAGNOSTICS
            assert_param(available_frame_length == sizeof(stm32wlxx_radio_comm_spi_frame_t));
            err = _sid_radio_start_rx_duty_cycle(&frame->payload.start_rx_duty_cycle_params);
#else
            SID_PAL_LOG_WARNING("Command SET_RX_DUTY_CYCLE is not supported");
            err = SID_RADIO_ERROR_NOT_SUPPORTED;
#endif /* HALO_ENABLE_DIAGNOSTICS */
            break;

        case STM32WLxx_RADIO_COMM_OPCODE_START_LORA_CAD:
#if HALO_ENABLE_DIAGNOSTICS
            assert_param(available_frame_length == sizeof(stm32wlxx_radio_comm_spi_frame_t));
            err = _sid_radio_start_lora_cad();
#else
            SID_PAL_LOG_WARNING("Command START_LORA_CAD is not supported");
            err = SID_RADIO_ERROR_NOT_SUPPORTED;
#endif /* HALO_ENABLE_DIAGNOSTICS */
            break;

        case STM32WLxx_RADIO_COMM_OPCODE_GET_LIVE_RSSI:
#if HALO_ENABLE_DIAGNOSTICS
            assert_param(available_frame_length == sizeof(stm32wlxx_radio_comm_spi_frame_t));
            err = _sid_radio_get_live_rssi();
#else
            SID_PAL_LOG_WARNING("Command GET_LIVE_RSSI is not supported");
            err = SID_RADIO_ERROR_NOT_SUPPORTED;
#endif /* HALO_ENABLE_DIAGNOSTICS */
            break;

        case STM32WLxx_RADIO_COMM_OPCODE_CHECK_CHANNEL_FREE:
#if HALO_ENABLE_DIAGNOSTICS
            assert_param(available_frame_length == sizeof(stm32wlxx_radio_comm_spi_frame_t));
            err = _sid_radio_is_channel_free(&frame->payload.is_channel_free_params);
#else
            SID_PAL_LOG_WARNING("Command CHECK_CHANNEL_FREE is not supported");
            err = SID_RADIO_ERROR_NOT_SUPPORTED;
#endif /* HALO_ENABLE_DIAGNOSTICS */
            break;

        case STM32WLxx_RADIO_COMM_OPCODE_GET_CHANNEL_NOISE:
#if HALO_ENABLE_DIAGNOSTICS
            assert_param(available_frame_length == sizeof(stm32wlxx_radio_comm_spi_frame_t));
            err = _sid_radio_get_channel_noise(&frame->payload.get_channel_noise_params);
#else
            SID_PAL_LOG_WARNING("Command GET_CHANNEL_NOISE is not supported");
            err = SID_RADIO_ERROR_NOT_SUPPORTED;
#endif /* HALO_ENABLE_DIAGNOSTICS */
            break;

        default:
            SID_PAL_LOG_ERROR("Received an unknown Sidewalk Radio App OpCode: 0x%X, 0x%X", (uint32_t)frame->opcode, frame->payload.raw[0]);
            err = SID_RADIO_ERROR_INVALID_OPCODE;
            break;
    }

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_radio_error_t sid_radio_set_handshake_response(void)
{
    sid_radio_error_t err = SID_RADIO_ERROR_GENERIC;
    stm32wlxx_radio_comm_spi_frame_t hs_response = {
        .opcode = STM32WLxx_RADIO_COMM_OPCODE_IRQ_STATUS,
        .payload = {
            .irq_status = {
                .irq_flags = STM32WLxx_APP_IRQ_SPI_HANDSHAKE,
                .followup_payload_len = 0u,
                .handshake_details = {
                    .protocol_version = {
                        .major = STM32WLxx_RADIO_COMM_PROTOCOL_MAJOR_VERSION,
                        .minor = STM32WLxx_RADIO_COMM_PROTOCOL_MINOR_VERSION,
                        .patch = STM32WLxx_RADIO_COMM_PROTOCOL_PATCH_VERSION,
                    },
                    .app_version = {
                        .major = SID_APP_PROJECT_MAJOR_VERSION,
                        .minor = SID_APP_PROJECT_MINOR_VERSION,
                        .patch = SID_APP_PROJECT_PATCH_VERSION,
                    },
                },
            },
        },
    };

    const sid_host_comm_error_t hc_err = sid_host_comm_enqueue_tx((void *)&hs_response, sizeof(hs_response));
    if (hc_err != SID_HOST_COMM_ERROR_NONE)
    {
        SID_RADIO_LOG_ERROR("Unable to enqueue Handshake IRQ response. Host Comm error %u", (uint32_t)hc_err);
        err = SID_RADIO_ERROR_HARDWARE;
    }
    else
    {
        SID_RADIO_LOG_DEBUG("Successfully enqueued Handshake IRQ response");
        err = SID_RADIO_ERROR_NONE;
    }

