TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/common/stm32wl55x_radio/Sidewalk/sid_radio.c
    return err;
}

/*----------------------------------------------------------------------------*/

sid_radio_error_t sid_radio_reset_hardware(void)
{
    sid_radio_error_t err = SID_RADIO_ERROR_GENERIC;

#if STM32WLXX_EXT_IFC_ENABLE_USER_DATA_TRANSFER
    udt_ctx.udt_enabled = FALSE;
#endif /* STM32WLXX_EXT_IFC_ENABLE_USER_DATA_TRANSFER */

    HAL_NVIC_DisableIRQ(SUBGHZ_Radio_IRQn);

    uint32_t remaining_attempts = SID_RADIO_SUBGHZ_RESET_ATTEMPTS;
    do
    {
        err = _subghz_reset();
        if (SID_RADIO_ERROR_TIMEOUT == err)
        {
            /* Recoverable error */
            SID_PAL_LOG_WARNING("Can't reset SubGHz peripheral - operation timeout. A retry will be attempted");
            sid_pal_scheduler_delay_ms(SID_RADIO_SUBGHZ_RESET_COOLDOWN_MS);
        }
        else
        {
            /* Either everything is ok or unrecoverable error happened - jump out in both cases */
            break;
        }

        remaining_attempts--;
    } while (remaining_attempts != 0u);

    /* Inspect the results of SPI communication startup */
    if (SID_RADIO_ERROR_NONE != err)
    {
        SID_PAL_LOG_ERROR("Can't reset SubGHz peripheral. Unrecoverable error %u", (uint32_t)err);
    }
    else
    {
        /* Clear config after reset */
        UTILS_ENTER_CRITICAL_SECTION();
        SID_STM32_UTIL_fast_memset(&WL55_cfg, 0u, sizeof(WL55_cfg));
        subghz_cold_start                   = TRUE;
        current_radio_state                 = SID_PAL_RADIO_UNKNOWN;
        current_modem_mode                  = STM32WLxx_SUBGHZ_RADIO_MODEM_MODE_UNDEFINED;
        current_radio_freq_hz               = 0u;
        last_indicated_radio_event          = STM32WLxx_PAL_RADIO_EVENT_UNKNOWN;
        last_indicated_radio_event_data_len = 0u;
        mod_params_upd_indication_pending   = 0u;
        valid_subghz_cfg_received           = FALSE;
        radio_tx_buf_upload_offset          = 0u;

        /* Initialize the peripheral */
        err = sid_radio_subghz_init();
        UTILS_EXIT_CRITICAL_SECTION();

        /* Restore IRQ settings */
        HAL_NVIC_ClearPendingIRQ(SUBGHZ_Radio_IRQn);
        HAL_NVIC_SetPriority(SUBGHZ_Radio_IRQn, RADIO_IRQ_PRIO_HIGH, 0u);
        HAL_NVIC_EnableIRQ(SUBGHZ_Radio_IRQn);

        if (err != SID_RADIO_ERROR_NONE)
        {
            SID_PAL_LOG_ERROR("Failed to perform SubGHz hardware initialization. Error %u", (uint32_t)err);
        }
        else
        {
            SID_PAL_LOG_DEBUG("SubGHz peripheral reset and initialized");
        }
    }

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_radio_error_t sid_radio_subghz_init(void)
{
    sid_radio_error_t err;
    HAL_StatusTypeDef hal_err;

    do
    {
        /* Apply essential settings after power on or full SubGHz reset --------------*/
        if (subghz_cold_start != FALSE)
        {
            /* Low level init */
            RADIO_INIT();

            /* Put the radio into the Standby RC state -----------------------------------*/
            err = _sid_radio_subghz_set_standby(STDBY_RC);
            if (err != SID_RADIO_ERROR_NONE)
            {
                SID_PAL_LOG_ERROR("SubGHz init failure - unable to put radio into Standby RC state. Error %u", (uint32_t)err);
                break;
            }
            sid_pal_delay_us(STM32WLxx_SUBGHZ_STDBY_STATE_DELAY_US);
            /*----------------------------------------------------------------------------*/

            /* Select regulator mode -----------------------------------------------------*/
            uint8_t regulator_mode;
            if (RBI_IsDCDC() != FALSE)
            {
                /* Use SMPS if the board supports it */
                const uint8_t drive_lvl = SMPS_DRIVE_SETTING_DEFAULT;

                /* Enable SMPS clock detection to avoid permanent damages to the IC if HSE clock is frozen */
                err = _sid_radio_subghz_smps_clk_detect_en();
                if (err != SID_RADIO_ERROR_NONE)
                {
                    /* Logs are provided by _sid_radio_subghz_smps_clk_detect_en() */
                    Error_Handler();
                }

                err = _sid_radio_smps_set(drive_lvl);
                if (err != SID_RADIO_ERROR_NONE)
                {
                    SID_RADIO_LOG_ERROR("Failed to set SMPS current drive to 0x%02X. Error %u", drive_lvl, (uint32_t)err);
                    break;
                }

                /* Configure MCU to use SMPS as well */
                LL_PWR_SMPS_SetMode(LL_PWR_SMPS_STEP_DOWN);
                regulator_mode = USE_DCDC;
            }
            else
            {
                /* Fall back to the LDO */
                LL_PWR_SMPS_SetMode(LL_PWR_SMPS_BYPASS);
                regulator_mode = USE_LDO;
            }

            err = _sid_radio_set_reg_mode(regulator_mode);
            if (err != SID_RADIO_ERROR_NONE)
            {
                SID_RADIO_LOG_ERROR("Failed to set SubGHz regulator mode to %s. Error %u", USE_LDO == regulator_mode ? "LDO" : "DC-DC", (uint32_t)err);
                break;
            }
            /*----------------------------------------------------------------------------*/

            /* Initialize TCXO control ---------------------------------------------------*/
            if (RBI_IsTCXO() != FALSE) /* If the board supports TCXO */
            {
                if (LL_RCC_HSE_IsEnabledTcxo() == FALSE)
                {
                    SID_PAL_LOG_WARNING("HSE TCXO power is disabled, falling back to XTAL");
                    /* Set XTAL trim values from the radio driver config */
                    err = _sid_radio_subghz_set_xtal_trim(XTAL_DEFAULT_CAP_VALUE, XTAL_DEFAULT_CAP_VALUE);
                    if (err != SID_RADIO_ERROR_NONE)
                    {
                        break;
                    }
                }
                else
                {
                    /* Configure TCXO as clock source using the values from the radio driver config */
                    err = _sid_radio_set_tcxo_mode(TCXO_CTRL_VOLTAGE, STM32WLxx_RADIO_COMM_TCXO_TIMEOUT_DURATION_TUS);
                    if (err != SID_RADIO_ERROR_NONE)
                    {
                        break;
                    }

                    /* XTAL trim will be automatically changed to 0x2F (33.4 pF) to filter any glitches */
                }
            }
            else
            {
                /* Set XTAL trim values from the radio driver config */
                err = _sid_radio_subghz_set_xtal_trim(XTAL_DEFAULT_CAP_VALUE, XTAL_DEFAULT_CAP_VALUE);
                if (err != SID_RADIO_ERROR_NONE)
                {
                    break;
                }
            }

