TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/common/stm32wl55x_radio/Sidewalk/sid_radio.c
            /* Perform calibration calibration */
            err = _sid_radio_calibrate(0x7Fu); /* calibrate everything */
            if (err != SID_RADIO_ERROR_NONE)
            {
                break;
            }
            /*----------------------------------------------------------------------------*/

            /* WORKAROUND - Trimming the output voltage power_ldo to 3.3V ----------------*/
            uint8_t drv_ctrl_val = 0x7u << 1;
            hal_err = HAL_SUBGHZ_WriteRegisters(&hsubghz, REG_DRV_CTRL, &drv_ctrl_val, sizeof(drv_ctrl_val));
            if (hal_err != HAL_OK)
            {
                SID_PAL_LOG_ERROR("Failed to write SubGHz reg. Reg: 0x%04X, HAL_SUBGHZ err: 0x%x", REG_DRV_CTRL, hal_err);
                err = SID_RADIO_ERROR_HARDWARE;
            }
            /*----------------------------------------------------------------------------*/

            SID_PAL_LOG_DEBUG("SubGHz cold start done");
            subghz_cold_start = FALSE;
        }
        /*----------------------------------------------------------------------------*/

        /* Set default Tx/Rx fallback mode -------------------------------------------*/
        uint8_t set_fb_mode_buf = (uint8_t)STM32WLxx_RADIO_FALLBACK_STDBY_XOSC;
        hal_err = HAL_SUBGHZ_ExecSetCmd(&hsubghz, RADIO_SET_TXFALLBACKMODE, &set_fb_mode_buf, sizeof(set_fb_mode_buf));
        if (hal_err != HAL_OK)
        {
            SID_PAL_LOG_ERROR("Failed to execute SubGHz cmd. Cmd: 0x%02X, HAL_SUBGHZ err: 0x%x", RADIO_SET_TXFALLBACKMODE, hal_err);
            err = SID_RADIO_ERROR_HARDWARE;
            break;
        }

        /* Put the radio into the Standby XOSC state ---------------------------------*/
        err = _sid_radio_subghz_set_standby(STDBY_XOSC);
        if (err != SID_RADIO_ERROR_NONE)
        {
            SID_PAL_LOG_ERROR("SubGHz init failure - unable to put radio into Standby XOSC state. Error %u", (uint32_t)err);
            break;
        }
        sid_pal_delay_us(STM32WLxx_SUBGHZ_STDBY_STATE_DELAY_US);

        /* Configure internal buffer base addresses ----------------------------------*/
        err = _sid_radio_set_buffer_base_addr(SID_RADIO_TX_BUFFER_BASE_OFFSET, SID_RADIO_RX_BUFFER_BASE_OFFSET);
        if (err != SID_RADIO_ERROR_NONE)
        {
            SID_RADIO_LOG_ERROR("Failed to set base addresses for SubGHz Tx/Rx internal buffers. Error %u", (uint32_t)err);
            break;
        }
        /*----------------------------------------------------------------------------*/

        /* External-only config parameters -------------------------------------------*/
        if (valid_subghz_cfg_received != FALSE)
        {
            /* Configure Rx Boost using the received config if available -----------------*/
            err = _sid_radio_cfg_rx_boosted(WL55_cfg.drv_cfg.rx_boost);
            if (err != SID_RADIO_ERROR_NONE)
            {
                SID_RADIO_LOG_ERROR("Failed to set SubGHz Rx boost. Error %u", (uint32_t)err);
                break;
            }
            /*----------------------------------------------------------------------------*/

            /* Tx power ------------------------------------------------------------------*/
            err = _sid_radio_set_tx_power(&WL55_cfg.pa_cfg);
            if (err != SID_RADIO_ERROR_NONE)
            {
                SID_RADIO_LOG_ERROR("Failed to set SubGHz Tx power. Error %u", (uint32_t)err);
                break;
            }
            /*----------------------------------------------------------------------------*/
        }
        /*----------------------------------------------------------------------------*/

        /* Clear all error flags -----------------------------------------------------*/
        uint16_t errors;
        err = _sid_radio_get_subghz_errors(&errors);
        if (err != SID_RADIO_ERROR_NONE)
        {
            SID_RADIO_LOG_ERROR("Failed to read SubGHz error flags. Error %u", (uint32_t)err);
            break;
        }
        SID_RADIO_LOG_DEBUG("Actie SubGHz error flaghs on init: 0x%04X", errors);
        err = _sid_radio_clear_subghz_errors();
        if (err != SID_RADIO_ERROR_NONE)
        {
            SID_RADIO_LOG_ERROR("Failed to clear SubGHz error flags. Error %u", (uint32_t)err);
            break;
        }
        /*----------------------------------------------------------------------------*/

        /* Apply the customized IRQ mask if the external config has arrived ----------*/
        if (valid_subghz_cfg_received != FALSE)
        {
            err = _sid_radio_enable_default_irqs();
            if (err != SID_RADIO_ERROR_NONE)
            {
                /* Logs are provided by _sid_radio_enable_default_irqs() */
                break;
            }
        }
        /*----------------------------------------------------------------------------*/

        /* Init RF Switch GPIO -------------------------------------------------------*/
        RBI_Init();
        /*----------------------------------------------------------------------------*/

        /* Done */
        current_radio_state = SID_PAL_RADIO_STANDBY;
        err = SID_RADIO_ERROR_NONE;
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_radio_error_t sid_radio_handle_subghz_irq(const uint32_t irq_timestamp_s, const uint32_t irq_timestamp_us)
{
    sid_radio_error_t err = SID_RADIO_ERROR_GENERIC;
    HAL_StatusTypeDef hal_err;

    //TODO: Consider modifying SubGHz HAL driver to use DMA (or at least do some optimizations) to offload CPU core and speed up data exchange
    do
    {
        uint8_t irq_status_buf[2u];
        uint32_t itsource;

        /* Retrieve Interrupts from SUBGHZ Irq Register */
        hal_err = HAL_SUBGHZ_ExecGetCmd(&hsubghz, RADIO_GET_IRQSTATUS, irq_status_buf, sizeof(irq_status_buf));
        if (hal_err != HAL_OK)
        {
            SID_RADIO_LOG_ERROR("Unable to retrieve SubGHzIRQ status. HAL error 0x%x", (uint32_t)hal_err);
            err = HAL_BUSY == hal_err ? SID_RADIO_ERROR_RESOURCE_BUSY : SID_RADIO_ERROR_HARDWARE;
            break;
        }

        /* Convert the received bytes into usable format and add store it*/
        itsource = ((uint32_t)irq_status_buf[0] << 8) | (uint32_t)irq_status_buf[1];

        /** Clear SUBGHZ IRQ register - this will clear the EXTI line and associated IRQ in NVIC if no more radio
         *  radio events are pending. However, should there appear a new radio IRQ while the driver is processing
         *  the ccurent one, the IRQ line will be triggered again and ISR will be re-entered automatically to
         *  handle the new radio event. This is the desired behavior of this driver
         */
        hal_err = HAL_SUBGHZ_ExecSetCmd(&hsubghz, RADIO_CLR_IRQSTATUS, irq_status_buf, sizeof(irq_status_buf));
        if (hal_err != HAL_OK)
        {
            SID_RADIO_LOG_ERROR("Unable to clear SubGHz IRQ status. Active IRQ: 0x%x, HAL error 0x%x", itsource, (uint32_t)hal_err);
            err = HAL_BUSY == hal_err ? SID_RADIO_ERROR_RESOURCE_BUSY : SID_RADIO_ERROR_HARDWARE;
            break;
        }

