TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/common/stm32wl55x_radio/Sidewalk/sid_radio.c
        /* Clear SubGHz IRQ pending flag in NVIC - if any new radio IRQ occurs during the processing, NVIC flag will be set again by hardware */
        HAL_NVIC_ClearPendingIRQ(SUBGHZ_Radio_IRQn);

        /* Process the received radio events (IRQs) */
        err = _sid_radio_irq_process(itsource, irq_timestamp_s, irq_timestamp_us);

        /* Terminate on failed IRQ handling attempt */
        if (err != SID_RADIO_ERROR_NONE)
        {
            SID_PAL_LOG_ERROR("SubGHz IRQ process error %u. IRQ: 0x%04X radio state: %u, modem %u", (uint32_t)err, itsource, current_radio_state, current_modem_mode);
            break;
        }

        /* Re-enable SubGHz IRQ after the processing is done */
        HAL_NVIC_SetPriority(SUBGHZ_Radio_IRQn, RADIO_IRQ_PRIO_HIGH, 0u);
        HAL_NVIC_EnableIRQ(SUBGHZ_Radio_IRQn);
        err = SID_RADIO_ERROR_NONE;
    } while (0);

    /**
     * @note If an error happens during the radio IRQ processing, the code should exit without re-enabling the SUBGHZ IRQ line.
     *       This will prevent entering an infinite ISR loop. Instead, the error is procssed by the HostComm task, which triggers
     *       SUBGHZ internal reset, clears NVIC state, and re-enables the SUBGHZ IRQ line once it is safe to do so.
     */

#if SID_HOST_COMM_PROCESSING_DELAY_PROFILING
    /* Clear the actual radio IRQ event indication for profiling after the radio IRQ is processed */
    SID_PDP_RADIO_IRQ_ACTIVITY_GPIO_Port->BRR = SID_PDP_RADIO_IRQ_ACTIVITY_Pin;
#endif /* SID_HOST_COMM_PROCESSING_DELAY_PROFILING */

    return err;
}

/*----------------------------------------------------------------------------*/

/* Even though this method logically belongs to host_comm.c, keep it here to avoid cascading function calls and speed up the processing */
SID_STM32_SPEED_OPTIMIZED sid_host_comm_error_t sid_host_comm_set_user_data_received_cb(sid_host_comm_on_incoming_user_data callback, void * user_arg)
{
#if STM32WLXX_EXT_IFC_ENABLE_USER_DATA_TRANSFER
    /* Update the pointer to the user callback in a critical section to avoid mid-flight invocations */
    UTILS_ENTER_CRITICAL_SECTION();
    udt_ctx.on_user_data_rx          = callback;
    udt_ctx.on_user_data_rx_user_arg = user_arg;
    UTILS_EXIT_CRITICAL_SECTION();

    if (callback != NULL)
    {
        SID_PAL_LOG_DEBUG("STM32WLxx On User Data Received callback set");
    }
    else
    {
        SID_PAL_LOG_DEBUG("STM32WLxx On User Data Received callback cleared");
    }

    return SID_HOST_COMM_ERROR_NONE;
#else
    (void)callback;
    return SID_HOST_COMM_ERROR_NOT_SUPPORTED;
#endif /* STM32WLXX_EXT_IFC_ENABLE_USER_DATA_TRANSFER */
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_host_comm_error_t sid_host_comm_send_user_data(const uint8_t * const data, const uint32_t data_len, const uint32_t auto_free)
{
#if STM32WLXX_EXT_IFC_ENABLE_USER_DATA_TRANSFER
    sid_host_comm_error_t err = SID_HOST_COMM_ERROR_GENERIC;
    osStatus_t os_err;

    do
    {
        /* Validate the inputs */
        if ((NULL == data) || (0u == data_len))
        {
            err = SID_HOST_COMM_INVALID_ARGS;
            break;
        }

        /* This API can be invoked from concurrent thread, use a local copy of the driver status to avoid race conditions */
        UTILS_ENTER_CRITICAL_SECTION();
        const uint32_t local_valid_subghz_cfg_received = valid_subghz_cfg_received;
        UTILS_EXIT_CRITICAL_SECTION();

        if ((FALSE == local_valid_subghz_cfg_received) || (NULL == udt_ctx.outbound_msg_queue))
        {
            /* Driver is not ready to accept user messages */
            err = SID_HOST_COMM_ERROR_INVALID_STATE;
            break;
        }

        /* Put the data in the queue */
        sid_host_comm_out_udt_msg_desc_t msg = {
            .data_ptr =  (uint8_t *)data,
            .data_len  = data_len,
            .auto_free = auto_free,
        };

        os_err = osMessageQueuePut(udt_ctx.outbound_msg_queue, &msg, 0u, 0u);
        if (os_err != osOK)
        {
            /* Failed to put the message in the queue, probably it is full */
            err = SID_HOST_COMM_ERROR_RESOURCE_ALLOC;
            break;
        }

        err = SID_HOST_COMM_ERROR_NONE;
    } while (0);

    return err;
#else
    (void)data;
    (void)data_len;
    (void)auto_free;
    return SID_HOST_COMM_ERROR_NOT_SUPPORTED;
#endif /* STM32WLXX_EXT_IFC_ENABLE_USER_DATA_TRANSFER */
}

/*----------------------------------------------------------------------------*/

#if defined (LOW_POWER_DISABLE) && (LOW_POWER_DISABLE == 0)
SID_STM32_SPEED_OPTIMIZED void sid_radio_tmp_lpm_prohibit(void)
{
    /* Temporarily prohibit LPM to allow fast IRQ acknowledgment -----------------*/
    UTIL_TIMER_Status_t timer_err;

    timer_err = UTIL_TIMER_StartWithPeriod(&lpm_suspend_timer, SID_RADIO_HANDSHAKE_LPM_SUSPEND_TIME_MS);
    if (timer_err != UTIL_TIMER_OK)
    {
        /* Something went wrong. That's not critical - notify user and proceed */
        SID_PAL_LOG_WARNING("Failed to arm LPM suspend timer. Error %u", (uint32_t)timer_err);
    }
    /* Prohibit the system to enter Stop mode since SubGHz events should be processed ASAP from this point */
    UTIL_LPM_SetStopMode((1u << CFG_LPM_HOST_COMM_RADIO), UTIL_LPM_DISABLE);
    UTIL_LPM_SetOffMode((1u << CFG_LPM_HOST_COMM_RADIO), UTIL_LPM_DISABLE);
}
#endif /* LOW_POWER_DISABLE */

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_radio_error_t sid_radio_app_init(void)
{
    sid_radio_error_t err = SID_RADIO_ERROR_GENERIC;

    do
    {
        /* Create the timer to process Rx,Tx, and CS/CAD timeouts */
        UTIL_TIMER_Status_t timer_err = UTIL_TIMER_Create(&radio_timeout_mon, 0u, UTIL_TIMER_ONESHOT, _sid_radio_on_radio_timeout_event, NULL);
        if (timer_err != UTIL_TIMER_OK)
        {
            SID_PAL_LOG_ERROR("Failed to create radio timeout monitor. Error %d", (int32_t)timer_err);
        }

#if defined (LOW_POWER_DISABLE) && (LOW_POWER_DISABLE == 0)
        /* Create LPM suspend timer for handshake requests */
        timer_err = UTIL_TIMER_Create(&lpm_suspend_timer, 0u, UTIL_TIMER_ONESHOT, _sid_radio_lpm_suspend_timer_cb, NULL);
        if (timer_err != UTIL_TIMER_OK)
        {
            SID_PAL_LOG_ERROR("Can't create LPM suspend timer. Error %d", (int32_t)timer_err);
            err = SID_RADIO_ERROR_HARDWARE;
            break;
        }
#endif /* LOW_POWER_DISABLE */

        /* Initialize the peripheral */
        err = sid_radio_subghz_init();
        if (err != SID_RADIO_ERROR_NONE)
        {
            SID_PAL_LOG_ERROR("Failed to perform SubGHz hardware initialization. Error %u", (uint32_t)err);
            err = SID_RADIO_ERROR_HARDWARE;
            break;
        }

#if STM32WLXX_EXT_IFC_ENABLE_USER_DATA_TRANSFER
        err = _sid_radio_udt_init();
        if (err != SID_RADIO_ERROR_NONE)
        {
            SID_PAL_LOG_ERROR("Failed to initialize UDT service. Error %u", (uint32_t)err);
            err = SID_RADIO_ERROR_HARDWARE;
            break;
        }
#endif /* STM32WLXX_EXT_IFC_ENABLE_USER_DATA_TRANSFER */

        err = SID_RADIO_ERROR_NONE;
    } while (0);

    return err;
}
